[
    {
        "title": "What are the best ways to get enough protein? ",
        "content": "I really want to build muscle, what are the best ways to get enough protein?   \n  \nA lot of protein powders are overly filling and too heavy for me. I’d prefer something less dense but still convenient. I sometimes eat meat but not too much, and I can have dairy products so whey is still in if the texture is good. \n\nDoes anyone know how much protein is in, say, nuts or trail mixes? ",
        "comments": [
            {
                "comment": "Crazy Nutrition 100% Tri-Protein might be up your alley. It combines six different types of protein, including whey isolate, which is lighter and more easily digestible than many other forms. \n\nTri-Protein blend helps with sustained protein release throughout the day, which is great for muscle recovery and growth. Plus, the texture is smooth, so it shouldn't feel overly dense or heavy.   \n\n\nBtw, different nuts have different protein amounts, where walnuts have about 4 and peanuts have as much as 7 grams per ounce. A protein calculator could make it easier to track your needs and how different foods contribute to them.",
                "author": "Millmd11"
            },
            {
                "comment": "Not a fan of protein powders. 😁 But lucky for us there are plenty of alternatives and all you have to do is tweak what you already eat. Lean meat, eggs, dairy (greek yogurt, cottage cheese), legumes, tofu and tempeh (if you like soy).\n\nTrail mixes are also a nice touch. Almonds, cashews, chia seed, peanuts, dried edamame and lentils are excellent protein-packed options you can add to the mix. They include 5-6 g/oz of protein each.   \n  \nIn short, I just try to add more protein to my diet by prioritizing protein-rich foods and snacks I enjoy (this will make sticking to your plan easier). \n\nAlso, aim for a consistent protein intake rather than relying on large amounts at one time. And since you don’t mind taking whey there are whey protein isolates that are less dense than concentrates you can try. I haven’t tried any but I know people who swear by them.",
                "author": "emyliphysis"
            },
            {
                "comment": "If you munch on a handful of nuts, I’ve heard you can get around 3 to 6 grams of protein. But I guess it depends on what kind of nuts you like and how much you end up eating?\n\nPersonally, I rely on protein powders and my fave is also from - Crazy Nutrition Mass Gainer. I use it to make sure I’m taking the same amount of protein every day. If you think powders are too heavy though, nuts are a pretty tasty way to chow down more protein!",
                "author": "Rainbowfoco"
            }
        ]
    },
    {
        "title": "Does anyone have actionable tips on losing fat after 40?",
        "content": "We all know that losing fat after 40 can be hectic, but I never knew it would be this hard, to be honest. I’m 41, and since I had my lastborn and since I turned 40, it’s been almost impossible to shed the weight off.   \n  \nAny tips on how to sustainably lose fat at this age? Got to be something realistic please, as I’m a mother of 3 and still juggling a career.\n\n  \n",
        "comments": [
            {
                "comment": "This may be much harder than it sounds at this point in life but you need to eat well, sleep well, and be as active as you can. What I mean is: \n\n1) Eat a balanced diet and don’t get fast food on your breaks. Avoid sweets, sodas, and white bread 😭\n\n2) Preset your go-to-bed time and quit the screens before bedtime. Make sure you have 6 to 8 hours of sleep on most nights.\n\n3) Create an enjoyable exercise routine and stick to it. Whether it’s hitting the gym, running, or playing sports for an hour every evening, you’ll need things you enjoy doing for both physical and mental wellbeing.\n\n4) Consider buying a fat burner if you’ve ticked these boxes and still struggle to make progress. It may give the boost you need in terms of thermogenesis and energy.",
                "author": "merkarslan"
            },
            {
                "comment": "You’ve got this!!! I began my own fitness journey in my early 40s, and I’ve never felt healthier. Most people make it sound difficult but it’s achievable with the right approach. Watch what you eat, exercise more and regularly, build muscles, avoid stressful situations, and be consistent and patient. All in all, just take good care of yourself and make sure you’re always making healthy decisions.",
                "author": "Jadedmuffins"
            },
            {
                "comment": "Losing fat after 40 can be hard but definitely doable! \n\nI’d add to make sure you get your hormone levels tested to see if there’s any extra support you may need - estrogen, progesterone, and testosterone. Also thyroid hormones, which can start to drop too. I’m not sure if there is a reliable cortisol test but it’s the main stress hormone and a much easier fix in some ways. Those of us in our 40s have a lot going on in life, especially if you have kids or ill parents, so self-care is absolutely essential. ",
                "author": "dylcomo123"
            }
        ]
    },
    {
        "title": "Bad Arms Genetics Or Underdeveloped ?(M 16) ",
        "content": "",
        "comments": []
    },
    {
        "title": "How do you keep your T levels up? ",
        "content": "I’ve been struggling with a couple of common low testosterone symptoms (hair, fatigue, muscle mass) on and off over the past couple of years. I finally did some tests last month and have T levels just under 250 ng/dl so I’d like to try and address the issue here. \n\nI’d love to know how you guys keep your testosterone levels up? I want to try natural ways first and preferably incorporate a “mild” booster with natural ingredients ONLY. I’m open to any suggestions, but please don’t go the route with exotic food I can’t find in a local supermarket.",
        "comments": [
            {
                "comment": "Well, first let me sympathize with you buddy as I know what you’re going through is less than ideal. I personally had an issue where my t levels had dropped lower than 250, and so I had to go on a craze of searching and looking, trying to discover natural ways of how to boost testosterone. A friend of mine introduced me to this supplement called testoprime and also adviced me to eat leafy greens, fish, and work out. He’s no expert or anything but it worked and now my testosterone levels are at 413 ng/dL, so I’d suggest you give it a shot. And definitely don’t forget the workout part, as most people underestimate how crucial working out is when it comes to maintaining healthy t levels. ",
                "author": "Opnes123"
            },
            {
                "comment": "If you want to go down the natural path like I did a few months back you have to make some lifestyle changes and revamp your diet. Cut off alcohol (or if you’re like me replace it with kombucha; not the best alternative but works for me 😁), get adequate sleep, maintain a healthy weight, and workout regularly. Eat more protein and try zinc-rich foods like oysters. I also supplement vitamin B12.",
                "author": "black_shadow123"
            },
            {
                "comment": "I guess my story’s a bit different. I have felt recently like I’m all of a sudden slowing down.I’ve always had high energy, so I started doing some online research about it and read a bit about testosterone and how it drops with age. I went to see my doctor after reading different peoples stories in a  forum like this, and after checking my T levels, he recommended that I don’t go the testosterone booster route. \n\nHe said at my age what I was going through was normal and that if I wanted to do something about my energy levels I should go at it from a diet and exercise perspective. It’s been a journey, but after a few months of no unhealthy food, more fish and veggies (I’m a pescatarian now) and actually seeing a therapist to deal with my stress levels, I feel a lot better than before. You folks in this forum sound younger, so my story may not resonate with you, but I think my point is that before going for a fix, see your doctor first. I do feel more energetic now, not like when I was younger, but I really do feel more healthy now and that’s a lot.",
                "author": "THE_SLIME_DREAM"
            },
            {
                "comment": "Well, I can’t actually say that there’s a single thing that keeps my T-levels \n\nup since it’s a hodgepodge of stuff, really. For one, I make it a point to work out several times a week. I also eat a lot of fish, oysters (when I can get them anyway), leafy greens, and beans. Then, I used to take TestoPrime when I tested low levels, which is a natural testosterone booster supplement that some people at my gym vouched for. Hope this helps!",
                "author": "goatt651"
            }
        ]
    },
    {
        "title": "Has anyone had success with the caloric bypass diet?",
        "content": "I’ve heard of something called the caloric bypass diet which apparently prevents you from storing calories as fat, does it work? Like when the urge to overeat gets too much to ignore, does it help you fight cravings or just burn more energy in some way? This is an area I have struggled with my whole life and want to burn a lot of belly fat, but I don’t want to have weight loss surgery, it’s too drastic.",
        "comments": [
            {
                "comment": "Not an expert in weight loss, but from what I’ve heard from a friend who takes training seriously is that a caloric bypass diet is a specialized diet plan that focuses on dietary changes, portion control, and lifestyle changes to achieve sustainable results when trying to lose weight.\n\n I think most people try to cut corners, but if you want to lose weight sustainably, you need to eat healthy foods and exercise regularly.",
                "author": "maridytroy"
            },
            {
                "comment": "Caloric bypass diet is a misconception!!!!!! You can’t prevent calories from being stored as fat—your body naturally processes energy from food. While certain factors influence how your body breaks down calories, there's no magic shortcut. If you’re struggling with cravings there are more realistic ways to deal with it. It will take a few lifestyle changes and a lot of self control but you’ll thank yourself for it. \n\nFirst do the snack swap: sugary drinks for squeezed fruits, or replace chips with carrot sticks, you get the idea, right? Exercise is also important. Find a physical activity that you enjoy and do it regularly. And when a craving strikes, find something to distract yourself. I usually go for a walk or listen to my dance playlist and…dance, haha. Just anything that would take your mind off it. But if you feel you can’t do it alone, it’s okay to seek medical help.",
                "author": "merkarslan"
            },
            {
                "comment": "According to what I read on the Mayo Clinic website, a caloric bypass diet is for obese people who have had gastric bypass surgery to reduce the size of their stomach so they can lose weight. This diet consists of  having 4-6 tablespoons of food eaten over 30 minutes 3-6 times a day.I can see this diet making sense if you’ve had major G.I. surgery, but to do it because you want to slim down sounds nuts. I mean you’re literally starving yourself and then exercising as well? I’m not obese, so I can’t imagine what that’s like, but I can gain a few unwanted pounds like anyone else and I think it sounds dangerous to do a gastric bypass diet without consulting your doctor first.",
                "author": "rikoclawzer"
            },
            {
                "comment": "I've been researching about it as I was thinking to try it out. But IMO, the caloric bypass diet is just a fancy new name for healthy eating.",
                "author": "emyliphysis"
            },
            {
                "comment": "Diets don’t work by definition, if the goal is long term lower body fat levels. You need to make lifestyle changes that you think you can make somewhat permanent. Lifestyle changes that work scientifically are more lifting, more activity, more protein, less processed foods, less alcohol, more sleep, tracking macros, tracking calories, tracking weight. Choose the ones that you think you can do long term and your body fat will fall by a proportional amount over time.",
                "author": "Objective-Door-513"
            }
        ]
    },
    {
        "title": "When and how to count calories as a night shift worker?",
        "content": "I am currently working on a night shift set up from 8PM to 5AM and decided to take counting calories strictly for health concerns. After my shift, I would eat breakfast at 6AM and be able to sleep at 7 AM, probably wake up at 2-3PM and workout at 5PM-7PM. I am just asking when I should start tracking on MyFitnessPal app? I am just worried if you are working instead of properly sleeping on the right hours would affect how you count them or could mess up with your metabolism. I'm not that knowledgable in nutrition, sorry. Any help is appreciated. Thank you!",
        "comments": []
    },
    {
        "title": "Is it possible for my friend to lift 20kg on bench press?",
        "content": "So, ik this is stupid, and its not a lot, but im sort of insecure tbh\n\nwe‘re both girls and i bench 20kg and started bench press this month, been at the gym fo 5 months though\n\nmy friend is somewhat sports considering she is a fast runner\n\nbut in insecure asf, she‘s 14, im 13, is it possible for her to brnch press 20kg first try?  \nwe‘re bith around 163cm or so and she‘s a little heavier than me\n\nShe‘s never been to a gym to train before since she didnt know that thry allow teens in",
        "comments": [
            {
                "comment": "Just asking if its possible for her to do it first try btw",
                "author": "THROWAWAY10111112"
            },
            {
                "comment": "I guess she would be able, keep in mind that the bar also weighs around 10kg, so only put 5 on each side for 20kg. Personally i wouldnt do bench right now, rather learn to do a proper push up. This also trains your core and mimics the bench",
                "author": "Bratanssaten"
            },
            {
                "comment": "Maybe you can start with seated chest press if they have that at your gym and then transition to a bench press.",
                "author": "guybrush_uthreepwood"
            },
            {
                "comment": "the bar is 20kg at y gym, i can do a push up tho ig",
                "author": "THROWAWAY10111112"
            }
        ]
    },
    {
        "title": "How to increase metabolism",
        "content": "I think I have a really slow metabolism. Regardless of how much I plan my portions and calorie intake, or exercise or even not eat I can’t seem to lose weight so I believe it must be my metabolism. Has anyone else struggled with this? Do you know what I am doing wrong? I’m just really desperate as I am going on vacation soon and I still haven't reached my weight goal. Thanks!",
        "comments": [
            {
                "comment": "Building lean mass is the most effective way to increase metabolic rate. That being said, our metabolic rate means quite a bit less than our habits and choices over the long term. For the vast majority of people, the range between a slow and a fast metabolism is, from data I’ve seen in the past, around 300 calories. That amounts to 0.5-1 Starbucks drink if you want to look at it that way. \n\n\nHere’s an article from Harvard Health that may be of some interest:\n\n[Eat protein and do weight training. Your metabolism increases whenever you eat, digest, and store food, a process called thermic effect of food. Protein has a higher thermic effect compared with fats and carbohydrates because it takes longer for your body to burn protein and absorb it.  It's not clear how much of an effect protein has on metabolism, but studies suggest the best approach is to combine adequate protein intake with weight training, which increases muscle mass — and that also can boost metabolism. Use this online calculator to determine your exact daily amount of protein: /dri.](https://www.health.harvard.edu/staying-healthy/the-truth-about-metabolism#:~:text=A%20slow%20metabolism%20burns%20fewer,and%20not%20gain%20extra%20pounds)",
                "author": "SryStyle"
            },
            {
                "comment": "It helps if you build a bit of muscle mass, that’s what I did and I noticed a difference in my energy levels and metabolism. Eat lots of protein and workout with weights several times a week – give it a month and you’ll notice a difference. You gotta be disciplined though.",
                "author": "AhmadH70"
            },
            {
                "comment": "One of the biggest mistakes people make during their loss journey is trying to lose a lot of weight too fast. What happens when you eat very few calories is that your body tries to adapt low calorie demands because it is forced to survive on little. Your metabolism then goes down, which is why people who lose a lot of weight fast end up gaining it back as soon as they go back to their normal calorie intake. I totally understand you trying to get answers on how to increase your metabolism and keep off the weight completely; you need to be exercising, eating plenty of protein, and getting enough sleep",
                "author": "Jadedmuffins"
            },
            {
                "comment": "Boosting metabolism is usually a combination of several factors. I don’t worry about it much as long as I eat a balanced diet at consistent times, exercise regularly, get enough sleep, and stress less. Although I’ve heard some people say cold baths and spices like cayenne pepper and ginger can help. Haven’t really done my research on those though.",
                "author": "Rainbowfoco"
            },
            {
                "comment": "I’m not an MD, but from what I've read there can be a lot involved in having slow or decreased metabolism. Our bodies are pretty subtle chemical terrains and even the slightest thing off can cause problems. Besides the obvious things you’re considering, like a balanced diet, exercise, and sleep (which all sound fine) maybe there’s another less obvious factor at work? Did you know that  things like stress, age, alcohol consumption, and even prescription drugs can affect your metabolism? Perhaps you should schedule an appointment with your Doctor and let them investigate this. This is a mystery you need to get to the bottom of.",
                "author": "rashigoogle"
            },
            {
                "comment": "Mk677",
                "author": "Square_Project_8273"
            }
        ]
    },
    {
        "title": "Set of mobility exercises that utilizes strength to lock in mobility gains?",
        "content": "I’m looking for some mobility excercises that cover the whole body and utilize strength gains to lock in the mobility gains. I’m already doing some of the Knees Over Toes Guy’s stuff, and I’m particularly interested in anything for hip hinging and forward neck posture. However, I want something for the whole body ideally. Thanks!",
        "comments": [
            {
                "comment": "There are a lot of meaningless buzzwords here, so it seems like the question you're really asking is: \"How can I improve my range of motion?\"\n\nThere are plenty of physio resources for hip hinge and cervical back exercises, just search on Youtube. Physiologically, resistance training brings an appreciable increase in range of motion for the relevant muscle group of a given exercise.\n\nWhen it comes to resistance training, deadlifts and hip thrusts are key for hip hinge, and basic neck exercises will help your upper back posture but don't neglect anything that works your traps, rhomboids, lats, etc like pull-ups, rows, facepulls, etc.",
                "author": "rendar"
            }
        ]
    },
    {
        "title": "What am I doing wrong?",
        "content": "Hey all, looking for advice on my routine and what I might be doing wrong.  I feel like I exercise and take care of my body pretty well, but am only 38 and have never felt so stiff and fragile, like I could pull something or tweak something at any moment.  Current in PT which has helped a bit, but very tight pretty much all day every day.  Also, not seeing a ton of gains or differences to my physical body which seems strange.  Routine below:\n\nMorning:\n\n* 5 min Core Routine (plank, bird dog, leg lifts, dead bugs)\n* 10 min easy workout, mostly mobility movements\n\nOffice Job 8-5, get up every 45 min – 1 hour, do some squats / push-ups / pull-ups, just to move a little\n\nStrength Training:\n\n* 3 times a week (legs/shoulders – chest/triceps – back/biceps)\n* Abs 2 times a week\n\nCardio:\n\n* Once a week, 30 min boxing, stair stepper or stationary bike\n\nNight:\n\n* 20 min mobility movements for hips & overhead mobility as recommended by my physical therapist\n\nEat pretty well & try not to drink a ton.  Am I doing too much? Or something wrong?\n\n",
        "comments": []
    },
    {
        "title": "What is the most efficient way to fuel my body before a workout?",
        "content": "Morning all - Some context below:\n\nI’m 36M. My method of exercise is metabolic style workouts. They are a combo of high intensity/cardio with weight focused indicators mixed in. They usually last about 45 minutes.\n\nMy work schedule allows me to workout most days bright and early at 7AM. However, the one day I struggle to perform well is on a day that I have to go AFTER work, meaning WHAT and WHEN I eat are likely contributing to my performance on that day. On this day of the week I wake up at 4AM for work and workout over 12hrs later at around 4:45PM. This leads to my question to you all.\n\nI’m already tracking macros and eating high protein/low cal foods, but I’m not sure I’m eating the right things at the right times. How long before the workout should I eat a substantial lunch? What/when should I be eating in order to optimize my performance on this “off” day for me?\n\nI do take preworkout that has caffeine on these days and I’ve been trying to have an apple/banana an hour or so before the workout. Haven’t noticed much improvement.",
        "comments": [
            {
                "comment": "I completely understand what you are talking about, experienced it a little bit my self.  \nIt's common having issues with workout performance when there’s a long gap between meals and exercise. Here are some practical tips to help you get the most out of your pre workout nutrition:\n\n1. **Lunch Timing**: Try to have a substantial lunch 3-4 hours before your workout. This should give your body enough time to process, digest and convert the food into energy.\n2. **Balanced Meals**: Make sure your lunch includes a good mix of protein, carbs, and healthy fats, like grilled chicken with quinoa and vegetables which provide sustained energy.\n3. **Pre Workout Snack**: Since your workout is in the late afternoon, try having a smaller snack about 30-60 minutes before you exercise. A good option might be Greek yogurt with some fruit or 30-60 grams of nuts and a piece of fruit. Try not to eat very heavy or greasy foods as they might weigh you down.\n4. **Stay Hydrated**: Drink water throughout the day. Sometimes that feeling of tiredness or fatigue can be due to dehydration.\n5. **Experiment**: Try different snack sizes and timings to see what works best, try adjusting it a bit every time so you can keep record of it and make accurate conclusions. You might find that having your snack 90 minutes before your workout works better for you, instead of 60 minutes for example.\n6. **Listen to Your Body**: Everyone is different, so it might take several tries, after some trial and error to figure out what works best for you, you will be on the right track.\n\nHopefully, modifying these aspects of your nutrition will help improve your performance on those later workout days.",
                "author": "sorinel2104"
            },
            {
                "comment": "Thank you so much for taking the time to put this together. I got similar feedback about lunch timing in another comment and I tried pushing it back (a little closer to my workout) to fit in that 3-4hr window. We’ll see how it goes today!",
                "author": "Heavy-Funny-8080"
            }
        ]
    },
    {
        "title": "What risks are involved with working out while sick",
        "content": "I'm dealing with COVID rn but between being sick and having meetings out of town I've only been able to do pushups a couple times over the past week, otherwise I've done nothing. I want to hit chest today (full home gym, not public) but Google says working out with body aches and temp regulation issues can be harmful. is it really that bad or can I get back into my routine?",
        "comments": [
            {
                "comment": "I have tried to work out when feeling sick a few times. I was either feeling better after it or waay worse. It really depends on your body and the disease.",
                "author": "goatt651"
            },
            {
                "comment": "If you have a mild cough and or stuffy nose it’s ok to workout. But you don’t want to get anyone in the public sick if you have a runny nose and cough a lot. Since your working out at home you won’t have that issue getting others sick. \n\nSince covid can cause alot of Respiratory Issues and muscle aches it can interfere with working out as the body needs oxygen. \n\nThe primary reason why it’s bad to workout when sick is recovery. When you break down muscle tissue and you want it to rebuild and recover you are using your body’s resources think of your computer with a like 20 tabs open vs 3 tabs there’s a lot of energy and resources and management that’s is being used on all those tabs being open.\n\nSame with your body if your body is fighting a cold or flu or symptoms it needs those resources to fight the invaders and recover. Your body has already dedicated those resources to recovering from being sick. It will have a hard time trying to do both recovery from sickness and recovery from working out. \n\nWorking out while sick can hinder your recovery thus putting you at risk for getting sicker because of your weakened immune system so what can happen is not recovering properly to rebuild muscle tissue so it’s a lose lose situation \n\nYou know your body better than anyone and what it’s capable of. You can do a mild workout to test the waters. \n\nA light 45 minute workout with less sets more rest time. Or cut the volume in half and do less and see how you feel from there. Then you can increase the sets and intensity accordingly. Just make sure to sleep. Stay hydrated and eat enough for recovery",
                "author": "Fiftyshadezofgains"
            },
            {
                "comment": "Because you have Covid I would definitely try and get as much rest as possible and not over exert yourself. If you do it will delay the healing process or might even make it worse. This is because your body will have a tough time to help repair the muscle while also battling an infection. \n\nIt would probably be better just to go for a moderate pace walk or something light",
                "author": "Brave-Vegetable5744"
            }
        ]
    },
    {
        "title": "How Can I Maintain Weight Loss?",
        "content": "Honestly, I don’t have a hard time losing weight whenever I go on a diet… but my problem is how to actually keep off those pounds. I feel so frustrated! It’s like two steps forward, three steps backward for me all the time.\n\nAsking for advice: What helps you maintain your weight loss results?",
        "comments": [
            {
                "comment": "Here’s the thing…if you go on a strict diet when on a weight loss journey, what happens is, you lose the weight, but you also lose muscle. So, your metabolism goes down and that means it becomes even easier for your body to gain weight faster than before because it’s easier to be on a caloric surplus when your metabolism is low. \n\nThe solution? You guessed it! It’s pretty much doing some form of resistance training to build some muscle because muscle needs more energy to maintain, which means you’ll need more calories to maintain them. Exercise generally raises your metabolism, and building some muscle means your metabolism increases and you can easily keep off the weight after losing fat.",
                "author": "AhmadH70"
            },
            {
                "comment": "I know exactly what you mean, for me it’s the hardest to keep it off long-term. The best thing for me was not dieting exactly but eating more protein and less carbs. I joined an exercise class 3 times a week and the rest of the time I just go on long walks (I hate running and the gym). I also started a weight loss supplement about 6 weeks ago and so far I’m seeing good results. Hoping I can drop a few more pounds before my vacation and then maintain this weight.",
                "author": "rashigoogle"
            },
            {
                "comment": "What works for me is sticking to a routine: staying hydrated, getting enough sleep, moderate physical activities (walking and dumbbell exercises), and a balanced diet. Not really a fan of supplements. So whenever I go off this routine my weight starts to fluctuate, lol.",
                "author": "makecharacteelimit30"
            },
            {
                "comment": "There’s a lot of good advice here. Yet as far as the most important things to keep in mind, I would have to say that focusing on maintaining a balanced food intake (not necessarily a diet) with more protein and less carbs is the key.  Exercise then becomes your insurance to keep your metabolism up so you’re always burning off those unwanted pounds. Being overweight can become a habit, so can dieting, so make your new habit striving to keep your food sources protein rich and keep that body moving.",
                "author": "goatt651"
            }
        ]
    },
    {
        "title": "Why does it seem like i gain muscle-mass, even though I only train once a week these days?",
        "content": "Hey everyone!\n\nSo there's been times where i was working out 3 to 4 days a week. Nowadays, especially in summer, i get to go once, maybe twice a week. (cause of other activities like other sports, work, making music etc.)\n\nI have a split that i like. I usually do arms/shoulders as 1, and back/chest/core as 2. With a bit of legs on both of them. I don't focus on legs tho, cause i go mountainbiking whenever i have time, so in summer i think that's enough for legs. I do more in winter.\n\nLately, i feel like i have done drastically less in the gym. Like, for the last six months for sure. I have been drinking more alcohol (partly because of band-practice, which sucks of crouse) and have had less time for the gym in general. But if i lost any muscle mass, you would notice definitely.\n\n\nHow could that be? I mean I'm still active, mountainbiking, and basically walking everywhere by foot, but that doesn't make my biceps grow? lol.\n\nI do eat healthy tho. High protein and omega 3 fats, aswell as carbs such as potatoes and rice.\n\nAny theories on what I'm doing... right? lmao\n\nThanks!\n\nOh yeah I'm 23, so maybe that plays a part.",
        "comments": [
            {
                "comment": "Different people respond better to different volumes, but I would guess that long term you would max your muscles out with more than once a week. You also put on more weight including muscle as you get older - so if you’re less than 30 it could be that. Look at how lebron James got bigger despite trying to stay thin.  If your lifts are going up then you are likely to be putting on muscle. If you are also not gaining much weight then that means very little fat is being added.",
                "author": "Objective-Door-513"
            },
            {
                "comment": "Switching it up is a good recipe to escape a plateau. You're more rested, and are better able to fuck up your muscles, perhaps?\n\nAlso, it could be your age.",
                "author": "Positive_Judgment581"
            }
        ]
    },
    {
        "title": "Workout split",
        "content": "Hi. I’m a 42 year old man. I’ve been exercising 5-6 times a week for about 5 years. This year my goal has been prioritising pull ups as i had been previously unable to do any. I can do 1 now and am enjoying working on this. I do some core work every day and have a day focussed on glutes / hamstrings as it’s a weakness I want to work on. I also run about 10k three times a week and also enjoy it. \n\nMy workout split is day 1) legs day 2) pull ups 3) chest + run 4) glutes and hamstring + run 5) back + run 6) pull ups.\n\n I need to get up at 4:30am to get this done (2 youngs kids and a wife that works shifts.) and I’m beginning to struggle to keep it going. Am I doing too much? Can you suggest a split that maintains overall fitness and keep the running and pull up sessions in place?\n\nThanks for your time. \n",
        "comments": []
    },
    {
        "title": "Do I need to bend my knees in a situp",
        "content": "Hello, \n\nI am trying to get back into situps but my feet keep lifting off the floor no matter how hard I try, I remember being able to do them without lifting my feet of the ground when I was younger and lighter. \n\nI dont want to put a weight on my feet to keep them down. Tonight I made the discovery that as I extend my legs outwards away from my body that they stop lifting off the ground. with my short legs and heavier upper body I found that the exact counter balance to let me do sit ups is actually with my legs almost out straight.\n\nCan I do this? does my legs being bent actually serve a purpose? or is it just so people don't make their situps needlessly easy?",
        "comments": []
    },
    {
        "title": "Ab advice for skinny male. Abs is my highest priority for my results.",
        "content": "I'm a skinny male, 133lbs @ 5'7\". I goto the gym 3-4 times a week. Mostly lifting, made up of mostly arms, core and some legs. I started bulking (Higher protein intake and higher calorie intake, not eating specifically lean though) and put on 6 lbs. in the past 3 months (was 127 lbs. before). \n\n  \nI've been getting good results that are very visually noticeable and I'm happy with how things are going but I'm starting to question my ab progress. My workout with abs is a mix of captains chair crunches, cable pulldowns, incline sit ups and few other basic ab workouts.\n\n\n\nDoes this seem like a good routine for me still or any advice to get better results?",
        "comments": [
            {
                "comment": "In my experience abs will just start to show up when they feel like it.\n\nYour exercises should be good but I recommend adding weight to each of them. Sometimes you won't be able to hold the weight while doing them so I'd find a machine where you can add plates.\n\nI add 135-180 lbs to the ab cruncher where I'm at.\n\nWithout adding weight you'll get tone but you're probably already tone.",
                "author": "Shopping_Penguin"
            }
        ]
    },
    {
        "title": "Beginner",
        "content": "Hi, im a 200lb 5'10 male, and I'm wondering how many reps of each body weight excersize I should do",
        "comments": [
            {
                "comment": "3 sets of 12 reps per exercise is pretty much the standard. Worth mentioning that if you find yourself struggling with the weight by 8-10 reps, leave the set at that and maybe adjust the weight for the next one. It's not worth making it to 12 reps if you're barely doing the motion right, plus you could get hurt.",
                "author": "ZeroDisruptionX"
            }
        ]
    },
    {
        "title": "How to lose weight fast (healthy suggestions only)",
        "content": "I know weight loss takes time but I need to shed a few pounds in less than two months before my vacation. I currently don’t like the shape of my body when I look in the mirror or how I feel in it, but I’m not looking for a drastic change. Any minor result to give my confidence a nudge is all I need. Not really a fan of the gym but I've started running again and I also do a few home workouts whenever I get the chance. I welcome any suggestions that involve quick, healthy tips on how to lose weight fast. Thanks!",
        "comments": [
            {
                "comment": "Have you ever tried the keto diet? I find it works well for me when I want to fit into a smaller size, especially when I use weight loss supplements like KetoCharge. After all, I don’t need to starve myself (which makes me cranky!), just change what I eat—like more proteins, less carbs. It doesn’t work overnight, but from my experience, it does speed up things a little.",
                "author": "Thinksa1ot"
            },
            {
                "comment": "You don’t really have to hit the gym, but it would help! It’s easier to target your exercises with equipment and advice, but also set the time you devote to your figure in stone. Otherwise, I’d eat more protein and hit the recommended daily intake EVERY DAY. Also, you can’t just cut back on candy and soda, you have to give them the boot and control your meals in detail. Last but not least, drink lots of water and stay active throughout the day. Good luck, hope you get that beach bod in time!",
                "author": "makecharacteelimit30"
            },
            {
                "comment": "I know this isn’t what you want to hear, but excess weight almost never goes away quickly, it only arrives quickly.The good news is that you can lose weight faster than you think if you commit to smarter eating and regular exercise. You don’t have to starve or torture yourself at the gym, just eliminate the junky things you know add weight gain and start a regular, moderate exercise routine you can maintain. Establish that foundation and then build on it.Also, focus on eating a lot more protein and a lot less carbs at each meal. You’ll be surprised at how the weight goes when you eliminate carbs. ",
                "author": "alpine068"
            },
            {
                "comment": "The problem with our society today is that we want microwaveable results. I honestly suggest you look for a long-term solution rather than trying to microwave fast results because you’ll likely gain the weight back again. You probably shouldn’t be looking for advice on how to lose weight fast…but rather, how to lose weight sustainably and effectively. \n\nI would suggest you just set a workout routine you can follow through with and try as much as possible to stay away from sugars and any fast foods (no cheating). I try to always cut down on carbs, but it’s hard to be motivated to work out when you’re low on cards. So, my advice? Set a 6-month goal at least, instead of a quick 2 months!",
                "author": "rikoclawzer"
            },
            {
                "comment": "> lose weight fast  \n...  \n> healthy suggestions only\n\nWell, which one do you want? Getting both is pretty rare.",
                "author": "TheBear8878"
            },
            {
                "comment": "Really you should be following a bodybuilding cutting cycle. They are all basically pseudo scientists of weight loss, while retaining muscle.\n\nIf you just crash diet, you’ll lose a LOT of muscle, and since you don’t lift, it may take years to regain the muscle (but you’ll regain the weight quickly in fat). \n\nThe rules of cutting are basically:\n\n-track macros and aim to lose .5-1lbs per week (if you reduce carbs you can lose several pounds of water which shouldn’t be considered part of the 1lb)\n-Eat 1g of protein per lb of weight\n-lift weight regularly so the weight that comes off is fat rather than muscle\n-don’t eat processed foods (makes you hungrier)\n\nThat being said, you won’t keep off the weight unless you make permanent lifestyle changes, but you didn’t ask for that.",
                "author": "Objective-Door-513"
            },
            {
                "comment": "just drink this🍵👉: [https://leanbodytonic.com?&shield=bac708ijr603w-wfefwgn49me9&traffic\\_source=reddit&traffic\\_type=social](https://leanbodytonic.com?&shield=bac708ijr603w-wfefwgn49me9&traffic_source=reddit&traffic_type=social)",
                "author": "BernardAff"
            },
            {
                "comment": "Fast? I guess. My point was without supplements or sleeping in the gym",
                "author": "emyliphysis"
            },
            {
                "comment": "Thank you so much for the advice!",
                "author": "emyliphysis"
            },
            {
                "comment": "Consume less calories than you take in. Try a 500 calorie deficit for a few weeks.",
                "author": "TheBear8878"
            },
            {
                "comment": "Thanks!",
                "author": "emyliphysis"
            },
            {
                "comment": ">Thanks!\n\nYou're welcome!",
                "author": "exclaim_bot"
            }
        ]
    },
    {
        "title": "How to change a routine",
        "content": "Hello,\nSome context, I workout every morning for way to long, lift, abs, run, then I go back to the gym a little later for some planks, bike, incline walk with weights, and a little more biking. \nThis has become my routine from me becoming more and more obsessed with my abs and being skinny and low body fat. \nAs you might imagine this routine is just not ok and I need to change it and do less. I am just so worried that doing less, whether it is no more biking, no more walking, only one session a day, etc. I am worried that any kind of cutting back will make me lose what I have, lose my abs, get fat, be in worse shape. I understand there will be a change because I have been doing this routine for some time, but a change needs to be made. \nIs it possible to lessen my workload and not lose abs or gain fat? How do I mentally accept changing my routine?\nThanks to anyone who helps my ventilation",
        "comments": [
            {
                "comment": "I do understand where you're getting from and not wanting to lose the progress you've made, but such a routine is not healthy too. It will wear you off and can affect you mentally. Try not to do everything every day but have a dedicated day for each.",
                "author": "Thinksa1ot"
            }
        ]
    },
    {
        "title": "Are there any subreddits or movements/approaches for super casual bodybuilding? Not counting reps etc. Opportunistic, means over ends",
        "content": "The regimented workout X reps and sets of y kind every z days is something I'm struggling to stick to.\n\nI will have periods of getting into it and doing it well and falling out of it. I made good gains over the past year or two from 9 months to 3 months periods of this \n\nBut when I fall out of it, the very \"go for it. All or nothing\" attitude of the bodybuilding community is what leads to the toxic black and white thinking that causes me to not bother working out for ages once I stop - because it can't be perfect. Because maybe I'm ill or travelling and can't do the perfect workout.\n\nI've met a lot of people recently irl who have a more ad-hoc, opportunistic approach to bodybuilding - mostly getting in shape from yoga or whirling, when needed, and opportunistic bits of callisthenics here and there.\n\nI have been doing this myself and find I much prefer it. I don't mind much slower progress and gains. At this point in my life I would much rather develop a steady practic of working out in some form every day, a little bit, some days more than others - than being religiously stuck to some routine I just won't follow.\n\nThis may well be my way back into a regular routine eventually but that's not what I want right now.\n\nI want to meet and surround myself with other people and media (posts, YouTube videos) about opportunistic, as hoc, \"slow-bodybuilding\". That has a mover general lifestyle and attitude based approach.\n\nI want to do reps to near failure or nowhere near failure or complete failure depending on how I'm feeling. Labourers get ripped and they don't always do shit to failure.\n\nI want enjoying the process and lifestyle, means focused,virtue ethics style approach, rather than an instrumental, ends-focused approach.",
        "comments": []
    },
    {
        "title": "I Need Help With My Fitness",
        "content": "Im a 17 year old, 170lb male who lives at home and is eating the food my parents provide me. I dont know how to track what i am eating considering most of it is homemade and my mom who is making the meal doesnt check the nutrition in the ingredients. I dont know how to reach my protein goals because i cant just ask my mom to make different meals because everyone else in the family is fine with what she makes. My mom doesnt necessarily make unhealthy food, im just pretty sure her meals usually dont have enough protein to fit what i need. Ive been going to the gym for around a year pretty consistently but still have a skinny fat build, and a bit of face fat that i want to lose. Can anyone help?",
        "comments": [
            {
                "comment": "What I would recommend if you are serious about it, is checking the nutritional value of the container of the ingredients, once she has cocked the meal, get a plate a try to separate the different ingredients on the meal, to weight them and check the nutritional value of that portion, mainly focus on the protein, the carbs and vegetables you can count them as if they were all the same one, this is something I have done and works fine. Is something simple, your family may look at your in a weird way but if you have explained your goals, I think they will understand.\n\nThe pro about this method is that you will have a pretty solid idea of what you are eating without messing with your family's routine and diet, and once you have the nutritional value of each ingredient you can choose to eat more or less of each of the ingredients.",
                "author": "Megadonico"
            },
            {
                "comment": "thank you man i appreciate it, ill give it a try",
                "author": "ItzDarkkinx"
            }
        ]
    },
    {
        "title": "Why am I not losing weight? ",
        "content": "I started a New lifestyle in June 21, 2024, so almost 2 months ago I'm getting really frustrated because every time I look at the scale it never goes down. I'm on a low carb diet followed by a calorie deficit. I track  every single meal and including all my macros. I'm also working out six times a week with cardio and weightlifting I notice a small difference in my body, but it's really not a big difference and I'm starting to get upset and want to give up. I workout for at least 30-45 min a day. I'm sore from weight lifting, running, hiking, incline on my treadmill, eating super healthy. Why is NOTHING working? ",
        "comments": [
            {
                "comment": "If you are not losing weight, you are simply not in a calorie deficit. This is simple chemistry. Either you are tracking calories incorrectly or overestemating the amount of calories burned. It's not magic after all",
                "author": "zurelemon2"
            },
            {
                "comment": "If you weight lifting regularly and you are infact counting calories and have you TDEE correct. The only other possibility besides you have one of those first to wrong is if your new to exercise a lot of fat is probably going to muscle",
                "author": "xsyafag"
            },
            {
                "comment": "Have you also been tracking your fat percentage? Perhaps you are actually getting stronger and losing fat at roughly the same pace. Are you seeing progress in your lifts?",
                "author": "Positive_Judgment581"
            }
        ]
    },
    {
        "title": "Need Plan for Night School ",
        "content": "Hi, first time one here, starting night school just as I began my fitness journey, Now I need help to build a program that I can do while in school to maintain the momentum I have so far. Would apprciate any help with really effecient exercises as well as once a week dedicated to cardio. Below find my schedule.\n\nMonday: Can only workout one hour \n\nTuesday: Can only work out 45 min \n\nWednesday: Can only workout one Hour \n\nThursday: cannot workout \n\nFriday: Can only workout one hour \n\nSaturday: can workout for 2 hours \n\nSunday: can workout 2 hours ",
        "comments": [
            {
                "comment": "You have a significant amount of time each day it seems. Almost anything can work. What type of training do you like? Frequency? Goals?",
                "author": "JohnsLiftingLogOnIG"
            },
            {
                "comment": "I like slow training with occasional HIIT or cardio. General frequency should be 4 days and my overall goal is to look bulky with signs of muscle. So not body builder, I want to have a thick waste/abs but dont care if abs show.  I want to look like to look like Don Frye",
                "author": "Mountain-flake"
            }
        ]
    },
    {
        "title": "Does this plan make sense for someone looking to get back on track?",
        "content": "Hi y'all\n\nBeing in the military before, I used to be in decent shape. Never having a passion for working out or doing sports, I scraped by doing the bare minimum until I left. Then I did nothing for a year and as a result I'm now what I'd say is skinny fat (180cm-75kg/5'11''-165lb with high BF %). My core has always been weak, even at my best.\n\nI whipped up a quick plan for starting off just running and strengthening my core with some quick research and with the help of ChatGPT:\n\nDay 1 Morning : \n\n* Plank: 3 sets of 30-45 seconds\n\n* Russian Twists: 3 sets of 15-20 reps per side\n\n* Dead Bug: 3 sets of 10-12 reps per side\n\nDay 1 Night: \n\n* Run: 20-30 minutes at a comfortable pace. \n\nDay 2 Morning:\n\n* Side Plank: 3 sets of 20-30 seconds per side\n\n* Bird-Dog: 3 sets of 10-12 reps per side\n\n* Glute Bridge: 3 sets of 15-20 reps\n\nDay 2 Night:\n\n* Run: 5-minute warm-up jog, then 1 minute of fast running followed by 2 minutes of walking or light jogging. Repeat for 20 minutes.\n\nDay 3 Rest\n\nDay 4 Morning:\n\n* Bicycle Crunches: 3 sets of 15-20 reps per side\n\n* Mountain Climbers: 3 sets of 20-30 seconds\n\n* Leg Raises: 3 sets of 10-15 reps\n\nDay 4 Night:\n\n* Run: 30-40 minutes at a moderate pace, slightly faster than Day 1 but still comfortable.\n\nDay 5 Morning: \n\n* Hollow Body Hold: 3 sets of 20-30 seconds\n\n* Superman: 3 sets of 15-20 reps\n\n* Reverse Crunches: 3 sets of 12-15 reps\n\nDay 5 Night:\n\n* Run: Hill Run for 20-25 minutes. \n\nDay 6 Morning:\n\n* Plank: 3 sets of 45-60 seconds\n\n* Flutter Kicks: 3 sets of 20-30 seconds\n\n* Side Plank with Hip Dips: 3 sets of 10-12 reps per side\n\nDay 6 Night:\n\n* Run: 40-50 minutes at an easy, conversational pace. Focus on endurance.\n\nDay 7 Rest.\n\nI'd like to finally say I have a strong core before starting other programs and bulking up, doing functional training, etc.\nIs it a good idea to run this for 1-2 months, all the while eating for maintenance? Or should I be in caloric surplus or deficit? Do you have improvements to my plan?\n\nAll opinions welcome",
        "comments": [
            {
                "comment": "Seems like too much going from 0 for someone who \"Never having a passion for working out or doing sports\".\n\nWhy do you want to cram all this in from nothing?\n\nStart with a jog 3 days a week. Slowly add in some other things from there.",
                "author": "TheBear8878"
            },
            {
                "comment": "Honestly is not a bad plan at all, you should keep asking chat gpt, and it will give you a more than acceptable approach to your fitness goals. Try start eating a fixed amount of macro nutrients for 2-4 weeks, but you need to be as accurate as possible, this way after those 2-4 weeks you will see if you lost weight, gained or keep the same way, now you know what you need to start doing, but if you never do a control period to understand your what your body needs, not chat gpt nor a professional dietician/trainer will be able to help you out efficiently",
                "author": "Megadonico"
            }
        ]
    },
    {
        "title": "Tips On Helping Lose Weight vs. Leaning Out",
        "content": "I'm what most would say an endomorph. I started with a personal trainer in February and after 6 months, I've leaned out big time (so definitely working and seeing improvements!), but can't drop the actual pounds. I haven't hit any plateau yet, as I've actually gained 3lbs (of muscle I'm assuming); some clothes are fitting different so yay I guess--but my ultimately goal was to drop 20lbs so I'm not really that excited. I do 4-5 workouts a week, and we've incorporated more cardio in my workouts. I've lowered my calories down another 200 calories; and still nothing. I'm curious at this point if something is wrong and may need to chat with a doctor soon--but wanted to throw out to the people for some possible adjustments or tips that we're missing. ",
        "comments": [
            {
                "comment": "First you have to find the amount of calories to maintain your weight and if you would like to lose weight. cut that calorie intake 200-500 cals depending how fast you want to lose weight. But keep in mind if you are doing exercise 4-5 days a week, you have to make sure that you keep getting your right macros intake, carbs, proteins and fat, you need them all, you just have to play with the % of each among the calorie target intake. I'd guess you are probably still eating more calories than you need to, but a visit to the doc can give you even more insight, some conditions may mess with all these calculations we try to make for ourselves.",
                "author": "earth2mac"
            },
            {
                "comment": "Lots of people come on here saying they eat low calories but aren’t losing weight. The truth is, that people find ways of getting more calories without knowing it. Plus the calories on labels are low.\n\nThe way you do it (to answer your question in the comments) is to weigh yourself 3 mornings in a row, then count your calories for a week and weigh yourself 3 mornings in a row again. Average the weights before and after the week, and you know how much you gained or lost over the week. Add all the calories up and subtract 3500 for each lb you gained or add 3500 for each lb you lost. Then divide by 7. That’s your daily maintenance calories. This method adjusts for the mislabeling of the typical food you eat, and your individual propensity to cheat without realizing it. You’ll find you’re eating way more than you thought. \n\nOnce you have maintenance, you drop 250 calories and day and that equals 2 lbs per month of weight loss.",
                "author": "Objective-Door-513"
            },
            {
                "comment": "Hmmm ok wondering if it’s the calories. Is this a dumb follow up question—how do you know how many calories is too low? \nBut yea. Gonna go to the doctor soon. Have some appointments. It can’t hurt to raise some concerns a Dan see what’s going on in this body of mine. Thanks for commenting back!",
                "author": "dbenz5"
            },
            {
                "comment": "OOO OK. I'll try this out too. Thanks for the tip and reply.",
                "author": "dbenz5"
            }
        ]
    },
    {
        "title": "Can someone please explain this?",
        "content": "I walked roughly the same amount of steps, but according to the app, I walked for less miles and burned less calories. For both times I walked on the 2.8-3.0 setting on my walking pad.",
        "comments": []
    },
    {
        "title": "Feedback on my Plan",
        "content": "Hello all, this is my first post here. I've been bulking and working out for a year now and plan to bulk to around 200 lbs and then slowly cut for a few months to half a year to get abs.\n\nI'm around 6,1 185 lbs, 20 years old.\n\nI'd estimate that I currently have around 18-24% body fat. I hope to reach 200 lbs under 25% body fat.\n\nCurrent lifts\n\nIncline bench 150 lbs 3-5 reps.\n\nflat bench 170 3-5 reps\n\nbarbell shoulder press 125 3-5 reps\n\ndeadlift 315 lbs 1 rep max.\n\nPullups and chinups deadhang 12-15 reps\n\nCurl 110 lbs 3-5 reps.\n\nDips 20-25 reps bodyweight.\n\nsquat 185 lbs 3-5 reps.\n\nbarbell hip thrust 405 lbs.\n\nI'm hoping to get a few things answered.\n\n1. What body fat do you think I am? I'd say 18-24% but I don't know exactly.\n2. Should I continue to bulk to 200+ lbs for a slow cut?\n3. How long would it take for me to get abs on a moderate deficit?\n\nHere's what I currently look like: [https://imgur.com/YhVIaC2](https://imgur.com/YhVIaC2) (After a shower NSFW)\n\nI'm a bit skinny fat, looking to bulk a bit more and than cut to get abs.\n\nAny tips and advice on how best to do this?\n\nThanks for all of the feedback!",
        "comments": []
    },
    {
        "title": "Do biking endurance and jogging endurance build up separately?",
        "content": "I've been biking a ton for about a year, and I feel like my endurance has increased. But I still find jogging to be very unpleasant, and I can't last long at all. Does the endurance I've built while biking not carry over to jogging very well? Or maybe I'm just jogging wrong heh",
        "comments": [
            {
                "comment": "The carryover would be general aerobic conditioning (endurance is vague in this context).\n\nHowever, biking is considerably more energy efficient and lower impact than jogging. So you're essentially switching modalities, which also includes different movement patterns. That muscular endurance does not carry over; training must be specific.\n\nThere could be other reasons to explain poor jogging performance (form as you said, training methodology, etc) but the answer to your question is that the carryover is not as much as you'd think.",
                "author": "rendar"
            },
            {
                "comment": "you have improved, but biking and jogging are very different since biking is mostly leg muscles. when you're running your body has to keep up with the fact that your whole body is in movement. add more jogs to your routine and you'll start to see your jogging endurance will improve as well",
                "author": "ZeroDisruptionX"
            }
        ]
    },
    {
        "title": "I was 183 pounds 3 months ago. Now I’m 169 pounds. And I can bench 125 pounds. I could hardly bench 10’s on each side 2 months ago. Is that good progress? And do I look ok?. The second one was me 3 months ago. And the first one was me yesterday ",
        "content": "",
        "comments": [
            {
                "comment": "If you just keep consistently working out, you are going to be in phenomenal shape in a couple years or sooner. Being so young, your goal is consistency and making this a lifestyle. When you're 22 and done growing, sure set some body image goals. But for now just literally keep working out as often as you can",
                "author": "ugh_everything"
            },
            {
                "comment": "You made awesome progress. You look good, not to fat, not to skinny, simply the best starting point. If you keep up consistently, you‘re gonna be jacked at 20 years old. I started at the same weight with the same age as you did. \n\nIf I could give you one advice, please listen to your body and don‘t overtrain, especially in times of social media this is easier said than done. I pushed myself to far because I wanted more muscle all the time and it even worked out at that time aswell. But at 20 years of age, my elbow,knee and shoulder joints are all fucked. It got so bad I had to stop for several years and I lost almost all my gains. Now  I can only do calisthenics and even there I have to be super catious. Probably will never be able to go weighted. If I see people who can, I still get madly jealous. Dont progress the weights to fast, joints and tendons take almost four times longer to adapt than muscles and they heal badly if injured. \n\nI‘m not saying dont go all out, train everyday if you feel like it but be caucious with your body, if some exercise hurt, stop it and work on the weak link. For example if your front shoulder hurts while doing bench press, stop training chest until you feel no more pain. Then go back to training chest but lower the volume for chest and work more on your front shoulder. If you feel like you progressed decently in your front shoulder, go back to your old bench press workout. \n\nSorry for the long story but I always wished someone would have told me at 16 and not to find out by myself when its to late. Im 28 now btw",
                "author": "Bratanssaten"
            },
            {
                "comment": "Keep up the good work. Monitor your diet, but make sure you still enjoy your food. Creatine is really good. Loading phase of 10mg a day for a week and then 5 each day for the rest of your usage. It will help your muscles retain water, recover a little faster, and look fuller. Don't buy into a bunch of bullshit exercises. The simple stuff is the most effective.",
                "author": "Suspicious_Cow_7383"
            },
            {
                "comment": "nice man u look so good and better than ur old self",
                "author": "I-MUJIX-I"
            },
            {
                "comment": "I’m also 16 years old. But I was 15 in the second photo",
                "author": "Natural_One_1458"
            },
            {
                "comment": "It's all about consistency. You're making great progress and as you work out you'll figure out what parts you wanna focus on and how you wanna shape yourself. Be careful not to injure yourself though. not worth it to overdo it one day and not be able to work out for weeks due to an injury.",
                "author": "ZeroDisruptionX"
            },
            {
                "comment": "Keep up the good work! You’ll be surprised how strong you really are if you stay consistent!",
                "author": "CousinTeej"
            },
            {
                "comment": "Thank you so much ",
                "author": "Natural_One_1458"
            }
        ]
    },
    {
        "title": "Pain in index finger joints",
        "content": "Hello everyone,\n\nI (37/m) notice pain in my big index finger joints when doing pull exercises or basically anything that requires grip strength. Also curls with basically any bar also trigger this pain. I wonder if this is due to not having enough grip strength/missing flexibility and the bars pressing directly on my joints. Or maybe my age is slowly catching up with me and I should get checked for something like arthritis?\n\nWonder if anyone had this problem here and can point me in a direction?",
        "comments": [
            {
                "comment": "I had a similar pain but in my elbows and fingers. Doc said it could be a to tight gap at my elbows which crushes the nerve while flexed. I have pain with chin ups and any type of curls. I guess its nerve pain, in my case i need an OP :( try some flexibility drills and work on your grip strength, if its not getting better in a month or two you should seek a doctor, its probably a problem you cant solve on your own then",
                "author": "Bratanssaten"
            }
        ]
    },
    {
        "title": "Help with bulking",
        "content": "I've been working out for about 4 years inconsistently and just graduated high school. With the freedom of no school and being able to finally create my own schedule, I've been able to take bulking and working out very seriously. I have been attempting to bulk for the past year but only have been able to take it seriously for the past two or three months, since I got out of school. My main meals have been a local burrito place (get a bowl with double white rice, black beans, chicken, pickled onions, sour cream, cheddar cheese, & pico), and a homemade bowl with jasmine rice and chicken. I work at a coffee place and make an asiago bagel with egg, bacon, cheese, onions, avocado and cream cheese for my lunch break. I average 3000 calories a day. I workout almost daily with a push/pull/legs split. I am 5'11 and recently went from 160lbs to 174lbs, but I've noticed I'm gaining a lot more of a gut than I ever thought I would. I'm considering calling off the bulk because while I am noticing minimal gain in chest, shoulders, biceps, legs, etc., I'm gaining a large gut and have never had to deal with something like this and feel very uncomfortable. Am I doing something wrong? Do I keep pushing and trust the process?",
        "comments": [
            {
                "comment": "3000 seems like too much. The more you are above maintenance calories, the more fat you will gain. The literature and experts suggests that beginners should gain 1-1.5% weight per month MAX in order to gain with a good muscle ratios. At 160, that would mean 2.4 lbs per month, so it should have taken you roughly 6 months to gain that much weight. If you gained it faster than that its kind of expected that you would put on a lot of fat with your muscle.\n\nMy honest advice, and its probably not what you want to hear, but at this point I would switch to a cut and get back down to a body fat level you are comfortable with. Use the militaries waist formula to estimate your body fat now, and lose max 1 lb per week on a cut until you really like the way you look and retest body fat levels every month. Then switch back to a bulk and do it WAY slower while monitoring body fat percentage. If you determine that you were gaining 2.4 lbs per month, I would go for more like 1.5 lbs per month next time. You should basically always be getting higher in body fat percentage during a bulk (cutting is for losing body fat percentage), but not to the extent that you did. Generally, I don't think cutting is a great tool for non event based dieting (ie unless you are doing it for a contest or photoshoot or vacation). This is because its hard to keep off fat if you are going below your normal bodyfat percentage, and it hides the fact that your habits haven't permanently changed. However, since you just bulked and this is above your normal body fat percentage, I'd try to get back down to something closer to your norm, because staying above your norm body fat percentage for a long time resets your norm to the higher number (reverse is not the case).",
                "author": "Objective-Door-513"
            },
            {
                "comment": "If you don't like how fast you are gaining weight then reduce your surplus",
                "author": "DickFromRichard"
            }
        ]
    },
    {
        "title": "Are there any proven weight loss programs for a 50 yr old obese woman? (IF you actually work at it, obviously).",
        "content": "I've been overweight all my life and I'm tired of it.  I have health issues because of it (HBP), and generally now after a day of work on my feet all day, I'm aching and exhausted.  Google searches will give me tons of weight loss programs out there - most have gimmicks.  I'm talking WW, Reverse Health, etc.  Being fully aware NO weight loss program works if you sit on your ass all day and take \"miracle pills\" or \"Metabolism boosting drinks!\" - that you still have to diet and exercise, have any particular programs been approved by medical experts other than The Mediterranean  Diet? (I have a few dietary issues with that one and finding substitutions can be a pain.)\n\nThanks in advance.",
        "comments": [
            {
                "comment": "Diet programs just dress up caloric deficits & influence psychology by requiring investment. Try figuring out your BMR, deducting 400 calories, and doing something stimulating, like going on walks. If you are having trouble walking, you can try using exercise bikes, I’ve heard those are much easier on joints. You’ll probably find it easier to stand & walk after 30 pounds. The bike itself should give you another 300 calories per day depending on how long you do it, which with diet should total to about 5,000 extra calories expended per week, which is almost 2lb of fat (7000 cal, each pound is about 3500 cal).\n\nAnd if you’re drinking any calories, like alcohol, soda, juices, coffee with creamer, then try eliminating those too. It’s super easy to drink calories.\n\nIf you need help trying to figure out diet, I’d look at apps, such as MyFitnessPal to identify how many calories you’re eating on average per day. It’ll even tell you how many calories you should be eating related to the goal you have in mind.\n\nBest of luck!",
                "author": "checkyourearsbro"
            },
            {
                "comment": "Heres the science (simplified):\n\nNo diets work for 95% of people because they gain it all back. The 5% that doesn't gain it back does so by being EXTREME for the rest of their lives. For example, my friend went from obese to 6 pack, and kept it for 10 years, but he worked out 250 times per year and ate chicken broccoli 6x per week, and weighed himself EVERY day. He didn't miss days for anything.  \n  \nInstead of dieting, you should make lifestyle changes that are sustainable. Those changes should be centered around the following:  \n-No processed foods or artificial sugar (eating these foods make you eat more than you need even weeks later)  \n-Get enough protein, about 1g per lb of muscle that you have (this is because protein lets you retain muscle and build muscle when otherwise it would be stored as fat... its also satiating)  \n-Lift weights but start really, really slow given your age (this is like protein in that it stores your extra calories as muscle instead of fat). Also note, that you won't be able to get \"big\" like a guy no matter how much you lift.  \n-Increase your activity in all possible ways by committing to lifestyle changes (same as above, plus it gives you energy to do the lifts and it improves hormone health which means lower bodyfat)\n\nThe other option is the medical route of a obesity medication (eg Ozempic). These drugs really actually work, but they are lifelong, and if you don't lift weights and eat LOTS of protein, you will lose weight in an extremely unhealthy way (ie you will lose way too much muscle). Total muscle is a super strong predictor of longevity, so you don't want to lose too much if you go this route.",
                "author": "Objective-Door-513"
            },
            {
                "comment": "At the end of the day, the only way to lose weight it less calories in than you burn. There is no other way around it (unless you have some condition that messes with that) \n\nThe only way to lose it and keep it off (unless you greek demigod levels of will power and discipline) is to focus on losing 1-2 pounds a week. Its slow but people (including myself) have attempted very low calorie crash diets to drop weight quicker and it always ends up with breaking the diet and gaining all the weight back.\n\nHigh protein and low carbs work for me. Chicken and beef are dense and take time to digest so you feel full longer than if you ate a slice or two of pizza which is around the same calories.",
                "author": "Sufficient-Ad-3586"
            },
            {
                "comment": "I'm **not** learned in the subject at all, I haven't gone to classes, read books etc, so I can understand ignoring my post. \nBut I *have* been in your situation, and there are some things I wish I knew before I entered into the journey of losing weight.\n\nFirst of all, your best friend in the entire world is water, I can not hype water enough, it's a miracle drug, if you're hungry, you can drink a litre of water and feel filled. \nAlso I started thinking of sleep as a speed hack, if you're hungry late at night? drink a litre of water, and go to bed. There you go, now it's breakfast, food.\nSomething to note is that the body can only efficiently filter 0.8-1L of water an hour, so I'd recommend staying within that limit, but don't get worried, you can drink a lot of water.\n\n\nThe most important thing to learn however when losing weight is calories.\nPeople love to spout information about this and that, carbs, trans fats, blabla, while that is all true, it doesn't matter that much to someone trying to lose extreme weight, it's good information for when you're at a normal weight sure, but when losing weight? just count calories, that should be your bible, think of your weight as a mathematical problem. \n1 kg= 7700 calories, let's say your body burn 2000 calories a day, technically you can lose ~2kg a week if you simply don't eat anything.\nI wouldn't recommend doing that of course, but that's thinking with calories, you could technically eat a bag of chips a day if you want, as long as it has less calories than what your body burns in a day, it's just straight up math.\nThere are sites to calculate your daily calorie consumption online.\n\nAnother thing I wish I knew before the journey was that it never hurts consuming daily vitamins/minerals pills, no matter which way you decide to lose weight, it's very hard to get everything the body needs everyday, so this is just a good way to make sure nothing goes wrong with the body's needs, and if you gain excess of anything, you'll just end up peeing it out.\n\nAlso, people tend to simply tell you to exercise, you don't have to do that, exercise burns calories, yes, but as long as you stay within your limit of calories you don't have to supplement your calorie deficiency with exercising, sure it speeds it along, no doubt about that, and I personally like cycling during the weekend, but it's not a required thing for losing weight.\n\nI'd suggest getting a calorie deficiency of roughly 1000, that way you lose a kg a week, if not more depending on how many calories your body burns everyday, 2000 sounds like a fairly plausible one for you, but again, check online for a calculator to calculate it correctly.\n\nAt the end of the day, if there is one thing you take away from this post, I want it to be this:\nIf you burn 2000 calories everyday, as long as you consume less than that everyday, you WILL lose weight, it DOESN'T really matter where those calories come from, carbs? fat? it doesn't matter, as long as it's less calories thanÂ your burn everyday.\nWhat works for you depends on the type of person you are.\n\nI personally were 400lbs ~180 kg since my teens, at 33 I started doing the following:\nI stopped eating, I ate 1 meal every third day, for about 3 months I kept this up, and water of course.\nAfter 3 months of doing that I was down to 290 lbs ~140kg(its fast as hell in the start)\nHowever I started getting sick regularly, so I figured maybe eating more regularly was a better idea, so I ate a chicken breast, and a cucumber everyday.\n\n\n2 months later, I'm still getting sick, and I'm now starting to lose my hair, but I was down to 230 LBS ~115kg\nAt this point I started to realize that i'm really just hurting myself, I started looking up some information online, I started to eat 3 meals a day, which added up to ~1000 calories in total, breakfast Protein Oatmeal, lunch Protein oatmeal, dinner a stew with a lot of meat, vegetables etc, things the body need, and a multi vitamin/mineral pill for the things that I simply don't gain normally.\n\n\nFast Forward 3 months, I'm 190 lbs ~95kg. I'm not sick anymore, and I'm regaining my hair. \nSure, the weight loss was slower now, but I didn't much mind anymore, my original goal was 100kg anyway.\n\n5 months later, which is now, I'm at 85kg, and I still have the same routine, oatmeal for breakfast and lunch, and my stew for dinner with a pill. I don't really lose weight anymore, I tend to hover at around 84 as my lowest now. I'm in general a really big guy, my side of the family is, and I'm 187cm tall, at this point I probably have around 3-5 kg in loose skin as well, so I understand why i'm not really losing anymore weight, I think i'm at a fairly normally weight,\nLately I've started experimenting, keeping my diet routine the same, and having something like two  pizza with an insane amount of sauce and fries on the weekend (saturday & sunday) and I seem to lose the extra transient weight during the week, so i'm fairly comfortable with that kind of lifestyle, eat the diet I do, but eat literally whatever I want during the weekend, and not really gaining any weight, that is what works for me.\n\n\nThe reason I went into this detail is to clarify that what works for me, or Person A, or person B, wouldn't necessarily work for you, its a very personal thing I feel like, Hopefully something of what I said clicks for you, but I honestly believe it wont matter unless you've really hit the moment when you basically say \"Fuck it, I'm just going to do it\" \nFor me the trigger, funnily enough, was family and friends around me stopping to encourage me to lose weight, it meant that they finally gave up trying toÂ convince me to lose weight, they didn't believe I could do it anymore, and who can blame them? 33 years of being overweight, I get it, but it made me incredibly motivated to almost sort of spite them by doing what they didn't think I could anymore.\nI guess i'm a fairly spiteful person lol.\n\nTLDR: Eat less calories than what your body burns, depending on how much less your consume, the faster it is, doesn't matter what kind of calories you consume, be it pizza, or salads.\n\n\nBad formatting, hade to post this on my Phone.",
                "author": "Circleenvy"
            },
            {
                "comment": "You can also weigh yourself everyday and count calories if you think this is sustainable.\n\nDoing meal prep and eating prepped meals is another great tool. So is signing up things that are active.\n\nThe biggest rule though is to not do things that you can't sustain for 10+ years, because anything you don't sustain will get reversed.",
                "author": "Objective-Door-513"
            },
            {
                "comment": "Your post is a good one, but (personally) I consider not eating any processed foods an unreachable goal over the long run, unless you're retired or don't work so you have the time to make all your own food.  Sadly, so much food today is processed, it's practically impossible to avoid it entirely, but I get what you're saying, don't have it a major part of your diet, etc.\nThanks for replying!",
                "author": "Sufficient-Jump578"
            },
            {
                "comment": "Yeah, I understand the basic science behind it, but some diets/programs are still better than others for weight loss. For example, eating almost nothing but salads for weeks will result in weight loss, but it's not healthy nor sustainable.  Some diets are so restricted in what foods you can eat, you'd have to have the willpower of a  God.  And of course some diet programs are just overall more healthy anyway, which was why I asked.\nThanks for replying!",
                "author": "Sufficient-Jump578"
            },
            {
                "comment": ">The biggest rule though is to not do things that you can't sustain for 10+ years, because anything you don't sustain will get reversed.  \n  \nNo processed foods or artificial sugar (eating these foods make you eat more than you need even weeks later)\n\n  \nI think no processed foods is not sustainable for most people in most food environments. Just moderate your intake, start with less than you are eating currently and go from there. \n\nAnd there is no link between non nutritive sweeteners and weight gain. They can be a great 0 calorie substitute for foods you're used to eating.",
                "author": "DickFromRichard"
            },
            {
                "comment": "Agreed on sustainably reducing processed foods. When I said artificial sugar, it was a mistake and I meant added processed sugar.\n\nI wasn’t intending to talk about artificial sweeteners, but it’s not accurate to say there is no link. The epidemiology finds a link to weight gain and other health effects. Epidemiology needs to be taken with a grain of salt. The very few random control studies on humans don’t find one. The random control studies on animals show there is a metabolic effect. It’s unclear how drinking diet soda for example will affect your metabolism. It’s not the worst thing in the world probably.",
                "author": "Objective-Door-513"
            },
            {
                "comment": "I just recently read an article in The National Institute of Health reporting a possible link between artificial sweeteners and cardiac events. However, the article did post a noted Conflict of Interest Statement at the beginning, warning that the doctor who studied the link had received research funds from P&G - make of that what you will.",
                "author": "Sufficient-Jump578"
            }
        ]
    },
    {
        "title": "Hey guys need advice",
        "content": "Right now I workout 4 days a week, all 4 days HIIT cardio and after that 2 hours later I do weight lifting. It gives me 3 rest days, however, I was wondering if I could spread my 8 workouts in 6 days and have 1 rest day. It will keep me active as I think 3 days rest a week is a lot. Let me know what you guys think , my diet is on point. ",
        "comments": [
            {
                "comment": "Yes. \n\n\nLots of people will split up their weekly volume into more days to hopefully keep session quality higher.",
                "author": "JohnsLiftingLogOnIG"
            },
            {
                "comment": "If you think 3 rest days a week is a lot, you might not even be working out enough to need them. So you can either spread them out like you said, or increase the intensity on your 4 workout days.",
                "author": "TheBear8878"
            }
        ]
    },
    {
        "title": "Uneven chest? Insertion point abnormality?",
        "content": "One side of my chest is “empty” below the nipple. When I flex and prod that area, I can feel it’s completely soft, there is no muscle there.\n\nIs there a name and solution for this? I am targeting the area successfully, have decent form and don’t perceive any imbalance of strength in my chest, as I do with my triceps and hamstrings for example.\n\nAny advice appreciated. Worried that the more I grow my chest, the weirder it will look",
        "comments": [
            {
                "comment": "Yeah I can see the little indent. It could be genetics. Thank your mom and dad. But if your born with it. It’s with you forever. So you may need to fill it out with some more muscle and it may look less indented or it could actually fill out we won’t know until you build some mass on it.\n\nThat said the Chest muscle is One large muscle a lot of people think it’s 3 different muscle parts with the upper, middle and lower. The muscle fibres run down, across and above. So if you want to specialize in hitting the chest you can direct more focus to the upper muscle fibres, middle or lower.\n\nI think you should focus on building the Overall Chest Muscle with a focus on lower chest development so you can fill out that lower indent portion. After you have built some mass it may just fill out and look normal. Or it will fill out and you’ll have a little indent that may not be noticeable cuz you’ll have more mass on your chest.\n\nThe flaws show more on the body when there is less muscle and/or a lagging body part.\n\nIt’s better to have a full chest development with a little indent than a flat chest with a noticeable indent so focus on building the chest and you can see if it’s genetic or if it just needed to be more developed\n\nAnd yeah being strong with chest doesn’t mean shieet it’s all about the muscle development",
                "author": "Fiftyshadezofgains"
            }
        ]
    },
    {
        "title": "i have a question ",
        "content": "hi, my goal is to lose body fat and build muscle. im in a calorie deficit and eating plenty protein. is going to the gym 1-2x a week and 1hour of boxing 3x a week good? or should i go to the gym more? ",
        "comments": [
            {
                "comment": "The primary driver of weight loss should be your diet.",
                "author": "TheBear8878"
            },
            {
                "comment": "I think so... body fat percentage is a function of lifting weights, good diet and total activity in the long term. You have two of the 3... so why not go for all 3?",
                "author": "Objective-Door-513"
            },
            {
                "comment": "Thats pretty solid for losing weight, train full Body if u only go to the gym 2 times a week. 1 hour of purely boxing is tough, i would add some ropeskipping and fast shadowboxing if youre not already doing it",
                "author": "Bratanssaten"
            }
        ]
    },
    {
        "title": "Can someone help me get fit?",
        "content": "I've got a ton of cervical and lumbar issues along with just being unfit in general.  I've done PT twice and get no real guidance beyond yoga and don't hurt myself.\n\n  I don't have a set regimen of anything, but I try do do a few 2 mintute planks daily.  I can do 5 proper chinups a few times and walk an average of 3 miles a day. \n\n  \nI don't have access to a pool or money for equipment of any kind.  Any motion is painful and I can fight through it, I'm just worried about doing more damage.\n\nHere is a list of some of my issues from a second opinion service:\n\n  \nLumbar pain \n\nLumbosacral spondylosis without myelopathy\n\n Spinal stenosis of lumbar region with neurogenic claudication\n\n Lumbar degenerative disc\n\n  Arthritis \n\nBone Spurs \n\nCervicalgia \n\nChronic pain syndrome  \n\nLeft shoulder pain Osteoarthritis (excision dystal clavicle)\n\nCervical disc degeneration",
        "comments": [
            {
                "comment": "I am absolutely not an expert, and I wouldn't be taking advice from random people on reddit with that list of ailments. There may be professionals on this page, but it sounds like you need a physio and PT to create a plan for you.",
                "author": "JMol87"
            },
            {
                "comment": "I’ve been to physical therapy twice for multiple weeks. First was for the shoulder pre surgery. Second time was moving away from the neck and shoulder and trying to address the lumbar. I’ve done injections and ablation or surgery are next. \n\nEdit. Sorry. That sounded dismissive. I’m basically just trying to do what I can myself for body until it’s time for surgery. This last year of doctors visit wiped out my job and savings so it’s hard to keep seeing specialists as well",
                "author": "Useful_Necessary8248"
            },
            {
                "comment": "Damn. It's sounds left field, but the DDP Yoga programme was designed for people with limited mobility. May be a place to start ... but once again, I'm not a professional and wouldn't want you to hurt yourself.",
                "author": "JMol87"
            },
            {
                "comment": "Thank you!  I will definitely look into this program!",
                "author": "Useful_Necessary8248"
            }
        ]
    },
    {
        "title": "Just trying to get a normal routine 😭",
        "content": "I don't want it to be such a struggle.  \nI workout in order to get in better shape and gain some weight, since I am fairly short and pretty skinny.\n\nI'm 17, Male, around 47-49kg (100+-lb) and around 165cm (5,4ft 😭)  \nBeen going to the gym for more than half a year mainly with friends, now I go 2-3 times a week, once a week or so with friends in a different gym that's a bit further away from me.\n\nWhen I started I started with full body workouts 2-3 times a week and later on switched to a gym that's closer to me and now I am not sure what exercises to do.\n\nNot trying to ask my friends anymore because it confuses me even more, I am not a huge fitness guy and I don't really care for that really, I exercise to exercise that's basically it, I kind of want to switch from full body workouts to push pull legs because my friends kept telling me I should.\n\nNot sure what exercises to do, there are some that I prefer and what not but I guess it's not about that, I kind of want to switch from full body workouts because it takes too long for each workout for me and I feel the tension and muscles way more when I focus on each part specifically if that makes sense?\n\nSo again I want to switch to push pull legs or whatever else it's called or other routine of some sorts, just not sure what exercises to do, I go to the gym 2-3 a week I can go more but even 3 times sometimes is a stretch so I don't want to get burned out by forcing myself...\n\n(As for preferred exercises which I don't know if it even matters, I like benching on the smiths, any leg workout, dips machine, rows, latpull down, pec dec? and the one that is opposite if that's what they are called, and there a few more but again, I am not an expert so I sound stupid explaining it and I am not sure if it even matters...)\n\n",
        "comments": []
    },
    {
        "title": "Losing muscle and gaining fat what am I doing wrong? ",
        "content": "Background info I am 25 Male 170cm and 70kg, have been at the gym for a year now I started at 90kg. \n\nI have been extremely frustrated at the lack of improvement for the past 5 months and looking back at old progress pics I look pretty much exactly like I did 5 months ago. I feel I look quite small with little muscle but still have a lot of belly fat. \n\nI started with recomping, eating at a deficit and lifting and it worked for some time as strength was improving and I was losing weight. I was increasing my calories as well and was still maintaining/losing weight at 2500 cal. \n\nThen I tried bulking eating at 3000 calories and my weight started going up. Strength did go up slightly for a little bit but quickly stopped getting stronger and even losing strength some times? \n\nI take the inbody test once a week to see if I made any progress by comparing to previous tests as I know they are inaccurate. The stuff I eat is usually the same on days I take the test. For 2 months my skeletal muscle mass consistently went down and my body fat went up. There was never an increase in skeletal muscle mass. At this point I have lost 2kg of skeletal muscle mass and gained 1kg of fat according to it. \n\nI eat minimum of 150g of protein a day upwards of 200g and I sleep at least 8 hours a day for most days. For training I do a 2 day split twice a week, back, legs, biceps then shoulders, chest, triceps. Usually 6 sets per muscle per session targetting 12 reps. \n\nThe only thing I can think of is my training is shit but I'm very focused on ensuring my form is correct and pushing as hard as possible. Usually I get comments that my form is really good and that I push really hard from other people at the gym. I'm pretty bad at estimating remaining reps so I tend to go to muscular failure. My brain thinks I can do more but my body will not lift the weights. I do slow concentric movements as well. \n\nOne of my friends that I made in the gym is a sciency guy and kept telling me I'm doing too much so I have started to try make sure I'm close to failure but not hit it for the past month. My strength I feel is quite low compared to everyone else even beginners. Strength has stagnanted the past few months and am very inconsistent with the number of reps I can do each session.\n\nI'm trying my best but not only am I not progressing I am actively getting worse. I feel I look fatter and small but I can't figure out what I'm doing wrong and it is seriously affecting me. Do I need to eat even more? I'm already gaining fat even though I have a belly and there is no strength or muscle gains. \n\nTl;dr: 150g protein minimum each day, tried 3000 calories and 2500 calories but both show decrease in skeletal muscle and increase in body fat. Look the same or worse as 5 months ago. Strength stagnate or sometimes worse. Usually train to failure 4 times a week",
        "comments": [
            {
                "comment": "Are you working out till failure or are you going with the leave a couple in the chamber for best results method and also what’s your workout volume? I didn’t start making any actual good progress until I was working out till absolute failure and not doing the leaving a couple left in the chamber for best growth method everyone says.",
                "author": "xsyafag"
            },
            {
                "comment": "First off, try measuring your waist instead. Its a really solid measure of relative body fat percentage. I don't know what inbody machine you are using, but as you know the scales aren't particularly accurate for body fat percentage (and all the sub-categories are almost completely useless). However, if you are putting on weight, but your lifts aren't going up then you are probably gaining fat... so its not the measurement.\n\nSecond, you should concentrate on just maintaining weight until you can figure out why your lifts aren't improving. Maybe you need to switch up your workout to periodize it. You should look into how to break through plateaus on youtube. Until your lifts are going up, you aren't making new muscle, so having a calorie surplus is a negative.\n\nYou might also look at your hormone health (testosterone for example). A prolonged cut (which you did) can reduce T levels for a while. T levels don't seem to make much of a difference at the high end of normal in terms of muscle gain, but they do make a difference at the low end (and of course at 2-3x supernatural steroid levels).\n\nGenerally speaking it sounds from your description like you are doing things mostly right... it might be you don't realize you are doing something wrong, or it might be that your genetics don't fit your workout, or it might be that your workout is good, but you need some advanced techniques like periodization or drop sets. If its genetic, then you need to increase or decrease the volume/intensity until you find what fits your genetics. Remember that even one single extra rep is progressive overload. Oh, also, I'd look into recovery if you are feeling really spent all the time.",
                "author": "Objective-Door-513"
            },
            {
                "comment": "Also, you never mentioned diet other than protein. I would submit to you that the best way to lose body fat is to continue with the protein, but cut out ALL processed foods. Longterm, this is pretty true regardless of what else you are doing.",
                "author": "Objective-Door-513"
            }
        ]
    },
    {
        "title": "Work out time question",
        "content": "Dumb question but when you're timing your cardio, do you stop the timer when you stop or when your heart rare drops below a point. In this case a stationary bike.\n\nA steak isn't done cooking when you take it off the grill, its done when the temperature drops, right? Do I get to count that 5-10 minutes?",
        "comments": [
            {
                "comment": "Count both. \"I ran for x minutes and it took y minutes for me to return to resting HR\". Since there isn't really a linear relationship between the two",
                "author": "Skiddds"
            },
            {
                "comment": "That makes sense. I was only thinking of it in terms of lying about how long I worked out if I said 37 instead of 30 lol. Clearly not a fitness person or in good enough shape for it to matter, but definitely got my attention as a generally curious nerd. Is the time it takes to get back to resting relevant? Proportional to aerobic time? Never considered it as an actual metric, only if it was cheating.",
                "author": "That_Toe8574"
            }
        ]
    },
    {
        "title": "Body fat % estimate ",
        "content": "25 M 5’8 started lifting 8 months ago at 185. I started focusing muscle/bulk and realized I was already way fatter than I wanted to be. Started a proper cut at 178 with measurements calculator estimating 20-22%. My goal was to get just under 15% before I bulk I am 163 right now and am seeing abs showing for the first time. However I have notice little to no change in my chest and stomach sides some but little. I have virtually non on my arms and legs. Does it look like I’m still around 18-20% range, or do I just hold fat all my fat in unfortunate places. I was hoping I’d be were I want at 160 but thinking I might need to hit more like 155-150. I’m also wondering if I should still bulk at 160 because with more muscle mass it will make the next cut easier and more defined, or if I should focus on get much leaner first so I don’t fatten up to much. All thoughts and estimates are greatly appreciated.",
        "comments": [
            {
                "comment": "20% from my eyes. You could probably cut a bit, but you’re looking great, you can see your abs! Also I think you have slight gynecomastia, the tissue in your chest is not just fat, you’d need to have it removed surgically. I’d go see a doctor to get some bloodwork done.",
                "author": "checkyourearsbro"
            },
            {
                "comment": "Do you think so? cause it feels like regular fat to the touch. Not as what I’ve researched gyno feels like. I had a pretty flat chest before I got fat the first time used to be pretty slim. I did get most of my weight from booze I drank a bunch before I got serious health wise and I heard booze tends to store fat in certain places more so sides, tums, moobs.",
                "author": "xsyafag"
            },
            {
                "comment": "It sounds like you know the difference, if it feels like fat then it probably is. Everybody’s body is different! Although, it wouldn’t hurt to get your blood checked (if your insurance covers it). They usually don’t do testosterone for generic panels but you could make up some reason to legitimize the coverage.\n\nKeep up the good work, congrats on your current progress.",
                "author": "checkyourearsbro"
            },
            {
                "comment": "Hey thanks man",
                "author": "xsyafag"
            }
        ]
    },
    {
        "title": "Question about the cut ",
        "content": "Hello,\nI've been consistently working out for 10 months now. I started at 169 lbs and bulked to 185 lbs, dropped to 175 lbs and maintained until now. I have started a cut and am down to 171 lbs. I plan to cut until I hit my year mark for the final progress pictures. If I continue the cut it will be nine weeks in total and I should be around 164 lbs. My question is, is it alright that I am cutting down past my original starting weight? 5'10\". Reference pics are from when I started to July 26th. Thanks!\n\n",
        "comments": []
    },
    {
        "title": "Looking for solid advice",
        "content": "40M. 6'2\" 280lbs. Type I Diabetic since I've been a kid. I've been on an insulin pump for years. Pandemic hit me pretty hard and I'm completely ashamed of how bad I look today compared to me 20s and 30s even. Up until last summer I was still walking up to 5KM a day (sometimes more) mostly outside. I'm an avid outdoorsman. But recently my weight has really caught up to me. I'm looking to loose the belly. My arms still have some muscle and form left but my belly/chest is terrible. My chest has always been terrible. Even when I was in better shape. I'd like to drop 50 lbs and at least and be left with some muscle. Please help and advice is welcomed.",
        "comments": [
            {
                "comment": "Don’t try to change too much at once. Clean up a couple of habits, allow tine for them to set in, then choose a couple more things to work on. \n\nTrying to go too hard early on often leads to non-compliance and regression. \n\nA good starting point might be to set a daily step goal, and a lean protein consumption goal. Maybe a sleep goal, maybe a fibre goal. Hydration is important, so that could be another. Limiting alcohol might be something else. A daily fruit and/or vegetable consumption goal would be good. \n\nThe point is to remember that this must also be sustainable when your motivation is at its lowest. So don’t go “too hard in the paint” right away…",
                "author": "SryStyle"
            },
            {
                "comment": "Lift weights, no processed foods, 250g of protein per day, stay active",
                "author": "Objective-Door-513"
            }
        ]
    },
    {
        "title": "Any advice for a better aesthetic look? Which part should I train more?",
        "content": "",
        "comments": [
            {
                "comment": "I’d focus on bringing up your shoulders and chest. Can’t see your back, but bringing up your lats to help with that V shape is a great idea as well. Don’t neglect your legs either. \n\nYou’re reasonably lean which is good, you just need some muscle!",
                "author": "bigtravdawg"
            },
            {
                "comment": "23 male, 92kg, 182cm",
                "author": "AdStrong7621"
            },
            {
                "comment": "Shoulders, Chest and Abs, Do some HIIT Cardio, Do all that for a year and you're set",
                "author": "Wonderful-Spot-8489"
            },
            {
                "comment": "Chest and shoulders",
                "author": "Objective-Door-513"
            },
            {
                "comment": "Definitely your chest and your abs. You don't need to overdo it, just a bit more muscles there will fit into your whole physique",
                "author": "ZeroDisruptionX"
            }
        ]
    },
    {
        "title": "Hey There!",
        "content": "I'm Austin and I am currently taking online courses on becoming a personal trainer\n\nI want to get some experience online with real people and i'd love to do it entirely free as it's part of my training.\n\n  \nif you are interested comment \"i'm in\" and ill dm you with all the details \n\n  \np.s i will only be able to do it with a handful of people so there will be a bit of selection process ",
        "comments": [
            {
                "comment": "I'm in",
                "author": "Objective-Door-513"
            }
        ]
    },
    {
        "title": "Feeling Aesthetic - Link in Description",
        "content": "",
        "comments": []
    },
    {
        "title": "Energy Levels",
        "content": "So long story short was on the heavier side 89kg 5’10 as skinny fat as you can get basically all around my waist, lost a bunch of a weight going the gym and being in a calorie deficit. I eventually plateaued so much I was eating 1100 calories a day at 65kg, eating that little left me with no energy and I completely lost motivation for the gym. It’s been about a year since then I eat whatever I want and rarely go to the gym, I’m now 70kg (been averaging 15k steps a day and eating about 2000+ calories atleast) I want to get back into the gym but still having energy problems I’m motivated and I go but I just can’t workout, I end up exhausted mid way through my set and can’t push anymore even though I don’t feel any burn in the muscles. It’s hard for me to explain but imagine doing 10 reps on bench press and you start to struggle at 7 and really have to work to push out those last 3, for me I get to 4 and instead of struggling at 5 the weights just don’t go up no matter how hard I push and even with assistance from a friend.\n\nSleep, more water, creatine and trying different times at the gym to see when my body reacts better are what I’m going to try and do, is there anything else I need to focus on?",
        "comments": [
            {
                "comment": "I've been going through this a bit, as I'm getting back into the gym at near 40 after some injuries. I've found two things that have helped: First, I started slow... I was doing 60-75 hard minutes in the gym 4x per week. The issue was that when I came back, I would lose motivation at like 20 minutes. The solution for me has been to design a workout that is only 30 minutes (more achievable) and then just do it everyday. So I always go, and I do like 2 sets of 5 exercises and leave. I plan on slowly building up my ability to \"push through,\" at which point I'll add exercises as I get more used to the additional work. You need to design your gym goals to be things that you can accomplish, so that you feel good about the work you are doing.\n\nAdditionally, getting my testosterone up through lifestyle and some supplementation has helped as well. In retrospect, I think there is some evidence that low T effects ability to push through tough things. However, I would say that I'm not a doctor and I didn't expect improving my t to help me push through my workouts. I looked at T because high T results in VERY slightly lower bodyfat percentage, but it seemed to help my mental gym performance.\n\nI don't really know what you mean about getting tired through a couple reps. Maybe you need to lower the weight, or track it more closely so that you are really trying to beat your old record of reps by a tiny bit (\"I did 4 last time, I'm going to get 5 this time\").\n\nAs far as your overall tiredness and weight loss... Weight loss causes tiredness. Your body is programmed to get you back to old fat levels, and part of the way it does it is to make you tired so you move less. You might need to add some good fats into your diet for hormone levels. You might need to see if you can add like 100 calories a day without putting on weight - there isn't one number of maintenance calories, its a range of several hundred calories and if you are at the bottom of it, you will be more tired and less active, then if you are at the top of your maintenance range. Mostly I think you need to start slow but deliberately",
                "author": "Objective-Door-513"
            },
            {
                "comment": "Personally I would recommend trying to find a more balanced approach to eating and training, less highs and lows. Also I wouldn't worry about getting a killer workout in every time, training until my muscles are about to explode and organs about to fall out. If you are not getting sore every time, that is fine so long as you show up and put in the work. hope this helps.",
                "author": "Wonderful-Spot-8489"
            }
        ]
    },
    {
        "title": "New to the gym. Need to know where to start.",
        "content": "As the title reads, I’m new to the gym and want to make sure the work I have been doing is actually beneficial. I’m a 5’9 male weighing 205 pounds. I’ve been going to the gym for about 2 weeks now and have completely changed my diet to low carb/high protein meals, but have yet to lose a single pound even though I follow my diet religiously and never miss the gym. I go to the gym 3 days a week. A typical workout for legs and back for me is as follows:\n\nTuesday:\nAir squats 2 sets x 15 reps \nPull-ups to the bar 2 sets x 15 reps\nGravitron pull ups 2 sets x 12 reps\nCable rope pull down 2 sets x 15 reps\nCable triceps pushdown 2 sets x 15 reps\nCrunches 2 sets x 20 reps\n\nI’m also taking 35g of whey, 20g of casein, and 5g of creatine. \n\nWill this help me build muscle while losing weight or do I need to switch up my workouts? ",
        "comments": [
            {
                "comment": "> I’ve been going to the gym for about 2 weeks now and have completely changed my diet to low carb/high protein meals, but have yet to lose a single pound even though I follow my diet religiously and never miss the gym.\n\nYou need to be in a caloric deficit",
                "author": "TheBear8878"
            },
            {
                "comment": "Losing fat and building muscle at the same time, is something we call \"body recomposition,\"  it can be challenging, but it is possible. \n\nTo lose fat, you need to burn more calories than you consume. By creating a calorie deficit, you can lose fat while maintaining muscle mass. Try a macro calculator to get an estimate of your caloric needs. \n\n[https://legionathletics.com/macronutrient-calculator/](https://legionathletics.com/macronutrient-calculator/) \n\nBuilding muscle requires progressive resistance training. Incorporate compound exercises such as squats, deadlifts, and press variations to target multiple muscle groups at once.\n\nCheck out this article of ours to learn more:\n\n[https://legionathletics.com/body-recomposition/](https://legionathletics.com/body-recomposition/) \n\nIt'll break everything down for you so you know exactly what to do and why. I hope this helps! :)",
                "author": "Legion_Athletics"
            },
            {
                "comment": "Don't worry about weight, You can be 205 and 20% body fat at 5'9 or 205 and 35 %body fat, what probably matters to you is, are you feeling healthier?, looking better? and making progress in your strength and cardio training? if you are then you are doing the right thing and just stick to it or make some minor adjustments.\n\n  \nwhat i would personally recommend is splitting your workouts into Categories by day\n\nPush\n\nBench, Flies, Tricep Push Down\n\n  \nPull\n\nBent Over Rows, Lat Pull Downs, Bicep Curls\n\n  \nLegs\n\nSquats Or Deadlifts, Hamstring Curls, Quad Extensions\n\n  \nMaybe Throw Some Abs and The Assault Bike in there too if you want a defined six pack some day down the line.\n\nHope this Helps!",
                "author": "Wonderful-Spot-8489"
            },
            {
                "comment": "What’s the easiest way to track that?",
                "author": "Whole_Estimate_5838"
            },
            {
                "comment": "Thank you! I’ve changed my workouts drastically and started using my fitness pal to track my meals. As of today I’m 10 pounds down from when I first started! It seemed like once I started incorporating more cardio the pounds started to fall off.",
                "author": "Whole_Estimate_5838"
            },
            {
                "comment": "Take your current weight in lb, multiply by 14, then take 250 off that number. Eat that amount of calories for 2 weeks. If you're losing weight, keep doing that. If not, lower more.\n\nGet a food scale and track what you're eating, I use a spreadsheet.",
                "author": "TheBear8878"
            },
            {
                "comment": "Thank you! Any app recommendations to track how many calories burned per day? I have an Apple Watch if there are any compatible with it.",
                "author": "Whole_Estimate_5838"
            },
            {
                "comment": "Calories burned through exercise are pretty minimal tbh, and hard to track regardless. I don't track it at all, and I don't really worry about it. Dietary changes should be the main driver of weight loss.\n\nJust be flexible, you may find yourself tired and beatdown all the time, in which case add some carbs/calories back so you don't feel awful. And don't try to get into the maximum deficit you can, it's not sustainable.",
                "author": "TheBear8878"
            }
        ]
    },
    {
        "title": "Newbie question – is training each muscle group once a week really enough?",
        "content": "Hi all. I’m relatively new (this time round) to resistance training, I used to work out a fair bit in my teens and early 20s but having let myself go for a decade or two I’m now getting a bit serious about things again in my late 30s. \n\nI’ve been loosely following this dumbbell only guide from Buff Dudes for the last ten weeks, modifying it to suit my own goals, weaknesses and abilities. Up until now, each muscle group has been worked 2-3 times a week, but now it’s moving into its final phase each muscle group has its own dedicated day.\n\nI’m aware is fairly common practice, and of the rationale behind doing it this way – it allows you to really focus in on the muscles worked, hit them hard and with variation, push them to failure and then get a good recovery in afterwards – but I’d always been under the impression that it’s best to hit each muscle group at least twice a week.*\n\nSo my question is, is hitting each muscle group only one day a week really beneficial/optimal? And if not, and assuming I only have chance to train once a day, how does one strike a balance between training a muscle group thoroughly as well as more regularly.\n\nPlease forgive my ignorance, I still kind of have no idea what I’m doing, but I’m autistic and get quite frustrated when things aren’t as obvious and straightforward as I’d like them to be.\n\n*(For example, I used to do a simple upper/lower split hitting everything twice per week. A whole week’s rest for a muscle group seems unnecessary, and sub-optimal for progress. This is received wisdom and to be honest I’ve no idea where I received it from, but it makes sense to me.)",
        "comments": [
            {
                "comment": "I think it depends on intensity. When I started doing sets of 3 or 5, I found that sometimes I can only train a muscle group once a week. Usually that occurs on heavier weeks",
                "author": "Skiddds"
            },
            {
                "comment": "yes",
                "author": "Wonderful-Spot-8489"
            }
        ]
    },
    {
        "title": "what exercise i can do in office toilet in small space except squats?",
        "content": "",
        "comments": [
            {
                "comment": "Why..",
                "author": "albsein9"
            },
            {
                "comment": "I used to this at the office 2-3 times in a row 2x per day:\n\n[https://archive.nytimes.com/well.blogs.nytimes.com/2013/05/09/the-scientific-7-minute-workout/?src=recg](https://archive.nytimes.com/well.blogs.nytimes.com/2013/05/09/the-scientific-7-minute-workout/?src=recg)\n\nMost of it is toilet friendly if you don't mind getting your hands nasty on the floor and toilet bowl.",
                "author": "Objective-Door-513"
            },
            {
                "comment": "I stay in office most of my time and want to slip in workouts, i can only do them in toilet",
                "author": "Alternative-Dare4690"
            },
            {
                "comment": "only triceps and crunches seem of interest. Push ups dont have space and i dont wanna do too much legs i cycle alot.",
                "author": "Alternative-Dare4690"
            }
        ]
    }
]