[
    {
        "title": "Beginner's Guide to Working Out",
        "content": " As a personal trainer, I wanted to take the time to answer some of the most frequently asked questions by people who are new to working out. Feel free to let me know if I've missed anything!\n\n&#x200B;\n\n### How do I lose weight?\n\nIt’s actually way simpler than you might think: maintain a caloric deficit. Consume fewer calories than you burn. It doesn’t matter of you’re morbidly obese or you’re cutting for a show, this basic principal still applies. Note that eating a healthy diet makes this **far** easier - lots of fruits, veggies, lean protein and water will help you stay satiated for far fewer calories than fatty junk foods (not to mention you’ll have way more energy, and just feel better).\n\nTo find out how many calories you should be eating in a day to lose weight, you have a few different options. The first is to determine your maintenance calories with an online calculator, then subtract 250-500 per day from that (to lose about 0.5-1lbs per week). \n\nThe other option (my personal favourite, because everyone is different!) is to start by just honestly tallying up how much you’re currently eating each day. Once that’s determined, start by subtracting 250-500 calories per day. If you haven’t lost any weight in a couple weeks, subtract that amount again, until you start seeing progress.\n\nThere’s tons of food tracking apps out there, but I recommend [MyFitnessPal](https://www.myfitnesspal.com/) \\- it’s free, easy to use, you can scan food labels, and the food database included is enormous.\n\nAnother important note - increasing the amount of calories you burn per day (ie. exercising) will also help you stay in a caloric deficit. However, it’s best NOT to rely solely on this method. Doing a whole hour of cardio will only burn a few hundred calories (plus will likely make you hungry for snacks by the time you’re finished) … or, you can simply avoid eating a bag of chips or a piece of pizza, to have the exact same effect. \n\nThat’s not to imply that exercise isn’t important in your weight loss journey - quite the contrary! However, instead of focusing on doing hours of cardio a day, this should only be used to supplement your diet (1-2 hours a week is fine for most people). Your focus should instead be on resistance training. Lifting heavy weights 2-4 times per week plays the important role of ensuring you **maintain your muscle mass as you lose weight.** Want to avoid that “skinny fat” look, and get “toned” instead? Make sure you’re doing resistance training! \n\n&#x200B;\n\n### How do I lose weight in ___ area?\n\nUnfortunately, spot reduction is a myth. Where you lose weight first (and last) is determined by genetics. However, you \\*will\\* eventually lose weight in all your problem areas. You just need to be patient, and keep doing what helped you start losing weight in the first place.\n\n The good news is, the more weight you lose, the more visible the progress will be (especially if you’re doing a good job focusing on just fat loss, while retaining muscle). Going from 250-240lbs probably won’t be noticeable, but losing those last 10lbs will make a huge difference (since a few pounds will make up a far greater percentage of your total body mass). So the progress will be hard-fought for, but definitely worth it! \n\n&#x200B;\n\n### How do I gain muscle?\n\nIt’s a combination of progressively harder resistance training, eating enough food, and lots of patience.\n\nWhen you’re exercising, just going through the motions isn’t good enough. For optimal muscle gain, you should be performing each set with a weight that you can lift continuously for around 30-60s (this should amount to around 8-15 repetitions). If you feel like you can go for longer, choose a heavier weight. \n\nPerform each repetition slowly (about 1 second concentric, pause, 2-3 seconds eccentric, pause), through a full range of motion. To clarify - the concentric portion of a lift is when you’re moving against gravity, and the eccentric portion is when you’re moving with gravity. Exercises involving long static holds (like planks) are great for endurance, but they won’t amount to much muscle mass gained.\n\nI cannot overemphasize how important good form is either - for avoiding injury, hardwiring the correct neural pathways, and maximizing muscle gain. Especially when you’re just starting out, choose light weights, and make sure optimal form comes naturally before you start increasing the intensity. It’s way easier learning it correctly the first time than fixing bad habits later.\n\nHow much food should you be eating? It varies widely between people. Start with your maintenance calories, add a couple hundred to that (it doesn’t have to be a lot!), and measure your results. Be patient with your progress - men can expect to gain 1-2lbs of lean muscle a month, and 0.5-1lbs for women (beginners may gain a little faster). Eating enough protein is also vital to gaining muscle - a general rule of thumb is around 1 gram of protein (each day) per pound of lean body weight (ie. how much you weigh, minus the amount of fat you have). \n\n&#x200B;\n\n### How do I get stronger?\n\nIt honestly depends on your experience level. If you’re just starting out, doing a normal resistance routine focused on gaining muscle will make you stronger. However, if you’ve been working out regularly for awhile (close to a year), using heavier weights (1-6 reps max) will help you get stronger a lot faster. \n\nIf you’re focusing more purely on strength gain, it’s important that each repetition is done as perfectly as possible (even moreso than for other training goals). That means stopping 1-2 reps shy of failure. Doing just one sloppy rep can severely impact your strength output for the rest of the workout. Don’t be afraid of taking longer rests between sets either (up to 2-3 minutes), as you want to be ready with as much energy as possible before you start your next set. It also goes without saying that heavier weight = greater chance for injury, and proper form will help prevent that.\n\n&#x200B;\n\n### Is it possible to lose fat and build muscle at the same time?\n\nContrary to popular belief - yes. Especially if you’re a beginner! Just make sure you’re eating around maintenance level calories (along with enough protein), doing resistance training 3-4 times a week, and you’ll start seeing body composition changes. \n\nHowever, if you’re significantly over/underweight, or have already been working out for some time, you’ll see much faster progress if you focus on one goal at a time. The main difference here is going to be diet - eating less if you’re trying to lose weight, or eating more if you’re trying to gain weight. Regular resistance training plays a part in both shedding fat and gaining muscle.\n\n&#x200B;\n\n### How should I be structuring my workouts?\n\nFor the vast majority of people, full body workouts with compound exercises is the way to go. (For those who don’t know, compound exercises are those which use more than one joint at a time - think squats, bench press, rows, etc.)\n\nThe popular back/chest/shoulders/arms/legs split routine (or any variation of it) is good for advanced bodybuilders, but not ideal for beginners. Bodybuilders exercise like this because they need a much greater stimulus to properly stress any given muscle group, and more rest between days training that muscle group as a result of their increased workout intensity.\n\nFor a beginner, it’s better to hit each muscle group multiple times a week (this is great to hasten learning and growth). You won’t need as long of a rest period before training the same muscle again, because it won’t be as fatigued after each workout.\n\nCompound exercises give you the greatest bang for your buck because you’re working out so many muscles in one movement (and burning way more calories at the same time). Isolation exercises (those working one joint at a time, like bicep curls or leg extensions) are best for bodybuilders who really need to hone in on a single muscle.\n\nDoing resistance training 3-4 times a week is a good goal to shoot for. Workouts should be around 45-60 minutes, with around 6-8 exercises done during that time. Try to keep rests between sets to around 60s (this is all very generalized, and can change depending on experience level and goal). Space rest days evenly between workouts if you can.\n\nStart your workouts with the exercises which require the most energy (usually those which involve lifting the most weight), saving any isolation/ab exercises for the end.\n\nIf you’d like some help planning your workout routine, I just released a fitness app called [PerfectFit](https://www.perfect-fit.app/). It gives you access to workouts designed by a personal trainer, all customized according to your unique goals, fitness level, and available equipment. There are tons of bodyweight exercises included - ideal for anyone working out at home! The app is currently available to download on Android, and iOS is hopefully just a few days away (currently under review).\n\n&#x200B;\n\n### What should I be eating?\n\nIf your goal is a change in body composition (gaining muscle/losing fat), the amount of calories you’re consuming is the most important thing to pay attention to.\n\nIf you’re consistently working out hard but failing to gain/lose weight, chances are you need to make alterations to your diet. For weight loss, that usually means eating at a deficit of 250-500 calories per day; for weight gain, eating at a surplus of 200-300 calories per day.\n\nWhat exact foods you’re eating has an impact on how easily you can stick to your calorie goals, as well as your energy levels.\n\nConsuming around 1 gram of protein per pound of lean bodyweight (per day) is a given, regardless of what your fitness goal is. This helps to maintain satiety, and preserve/increase muscle mass.\n\nEating lots of fruits and veggies (as well as drinking 2-3L of water a day - more for some people) is a great way to feel full without consuming too many calories. It also just contributes to all-around health and energy levels.\n\nEating lots of fatty foods should be avoided if weight loss is the goal - not because fat makes you fat per se, but because they are so calorically dense. Only one tablespoon of peanut butter or olive oil is 100 calories! Conversely, if your goal is to **gain** weight, adding more fatty foods to your diet (healthy fats, if possible) can help you hit that calorie goal easier.\n\nAnd carbs? Not as evil as people make them out to be. Think of them as the energy that fuels your brain and your workouts. Having around 50% of your calories coming from carbs is about the norm. It’s likely beneficial to raise this number even higher if you’re an especially lean individual, or you’re regularly working out at intense levels.\n\n&#x200B;\n\n### When should I be eating?\n\nThe easiest way to time your meals properly is to think: “What will I be doing in the next 2-3 hours?” Eat according to the activity you’re about to do. That doesn’t mean you should be having a giant meal right before your workout, but ideally your biggest meal of the day would be several hours before you exercise. This will give you the energy you need, plus ensure the calories you consume are shuttled into your muscles instead of fat reserves.\n\nIf you’re about to do an intense workout, the best thing to eat beforehand (around 15-30 minutes prior) is a light snack of healthy carbs (like some fruit). For optimal recovery, aim for 20-30g of protein within an hour after you workout (if you miss this window though don’t worry about it). A protein shake is probably the simplest and most convenient way of doing this, but whole food is just as good.\n\n&#x200B;\n\n### What supplements should I be taking?\n\nIf you have a healthy, well-rounded diet, including 2-3 cups of different veggies each day,  enough protein per pound of bodyweight (from sources that include sufficient amounts of each essential amino acid), and adequate omega-3 fatty acids - then you’re golden, and probably don’t need any supplements.\n\nHowever, the vast majority of the population would probably benefit from a simple multivitamin and omega-3 supplement, just to help fill any nutritional gaps they have.\n\nIf you’re getting enough protein from whole food, then you probably don’t need to add protein powder. However, if you’re struggling with this, then protein powder is a great way to easily increase your daily protein intake. Whey protein is the most bioavailable and has a complete amino acid profile, so it’s the best choice for most people. However, if you’re vegan (or lactose intolerant), there are lots of plant proteins available. You just need to pay attention to the amino acid profile of each one (possibly mixing and matching different plant sources if you need to).\n\nAs for all the other supplements out there, it’s honestly on a case-by-case basis as to whether they’d actually help you or not. If you’re a beginner, unless you have any specific requirements or deficits, you probably don’t need them.\n\n&#x200B;\n\n### Is stretching important?\n\nYes. Please stretch (or do some other form of myofascial release, such as foam rolling), or you’ll eventually regret it. Regular exercise makes your muscles slowly form clumps of tissue and fascia. Neglecting to release these can result in restricted range of motion, and eventually pain.\n\nStatic stretching should be done at the **end** of your workout. Aim to stretch each worked muscle near its end range of motion for around 60s total. Don’t stretch before your workout, as this can impede strength output.\n\n&#x200B;\n\n### Is warming up important?\n\nYes. Warming up is paramount to increasing blood flow and activating your muscles properly before you move onto more intense, metabolically demanding exercises. \n\nIdeally, during your warm-up, you should be actively moving your muscles through the same ranges of motion you’ll be doing for your workout. This can be as simple as doing the exact same movement, but with minimal weight - for example, doing a few sets of bodyweight squats before doing barbell squats.\n\nYou want your warm-ups to elevate your heart rate, but not be so intense that they start tiring you out and detract from your workout. Usually 5-10 minutes of light activity is enough.",
        "comments": [
            {
                "comment": "this post is the bible for a workout beginner!!",
                "author": "None"
            },
            {
                "comment": "I am a passionate reader here on reddit, but as soon as I grt to read about workout routines, diets etc I loose interest very quickly, it is like an allergy to me, \n\nI am just overwhelmed with all these factual language.\n\nIf only I could get  a personal trainer who tells me daily/weekly what to workout/eat. I am a disciplined person in general, but too lazy to learn when it comes to sport/diet etc.\n\nMy next problem is, I am poor, so can't afford a personal trainer, if only there was a support group with an experienced leader, I would join immediately.",
                "author": "Gashosi"
            },
            {
                "comment": "I have one small doubt .Should I be weighing food like rice,chicken etc  raw or cooked ?",
                "author": "bigsandip"
            },
            {
                "comment": "Been using these for about 4 months now. \n\nPeople have been noticing. It's different when people notice rather than you",
                "author": "Coalas01"
            },
            {
                "comment": "Thank you so much for this detailed post!! I have this saved for future reference whenever I may need it. Appreciate you!",
                "author": "dearhc"
            },
            {
                "comment": "First of all: very very helpful. One question about excercising. Usually When I leave the gym I don’t feel any soreness or pain or minimum. I read somewhere that it doesn’t have to do with muscle growth but what do you think about this?",
                "author": "badiebiem"
            },
            {
                "comment": "Take my my up vote! Great advice",
                "author": "tw9319"
            },
            {
                "comment": "Thanks so much for this!",
                "author": "asilereddit"
            },
            {
                "comment": "Just started working out about a month ago and this is gold! Thanks a lot!",
                "author": "daxthedestroyer96"
            },
            {
                "comment": "This is incredible! Thank you so much for this ❤️",
                "author": "yourlocaltutor"
            },
            {
                "comment": "If you're doing 5/5, and your first rep is 8, next two are 5 and last two are 4. At what point do I increase weight? Should I do 5 reps first so I can do 5 on the last two sets?",
                "author": "regh91"
            },
            {
                "comment": "Thanks man",
                "author": "appplelamma"
            },
            {
                "comment": "Thanks so much this really helps as I’ve just started to work out.",
                "author": "samuraidude119"
            },
            {
                "comment": "Thank you",
                "author": "Duskbrown"
            },
            {
                "comment": "Amazing post! Thank you so much. Hopefully your app will be coming to Apple’s store, will definitely download.",
                "author": "Mrobert21"
            },
            {
                "comment": "this was super helpful to me, thank you so much!",
                "author": "okaynatascha"
            },
            {
                "comment": "In the perfectFit app there is a rep 8-12 what does that mean?",
                "author": "Reader_Da_Doo"
            },
            {
                "comment": "Thanks for the tips. I have one question. The first set is always pretty doable for me but even with 3 minute rests I often fail at the third set. Any advice?",
                "author": "SnooCats1770"
            },
            {
                "comment": "Thanks man. For a novice this is heaven.\nI'd like to learn more about working out but I'm quite ignorant about it and don't know which books should I read, could you suggest something?",
                "author": "starseeker37"
            },
            {
                "comment": "Thanks for the info i just started working out and this helps a lot!",
                "author": "Beautiful-Draw-6654"
            },
            {
                "comment": "Thank you so much for this. It's really simple and digestible for beginners like me.",
                "author": "None"
            },
            {
                "comment": "How do I lose weight healthily if I have arthritis. \nI can't really run & I've lost 50 lbs by basically drinking fluids and protein drinks and eating like once a day.\n\nBut I feel kinda weak now..\n\nThe plan was to lose weight by dieting then do some hiit or jogging or something.. but now idk..\n\nAny ideas? I haven't been able to run for years. It sucks.",
                "author": "Webdev420"
            },
            {
                "comment": "Does your work out routine matter much ? Or is it fine as long as u hit each muscle group twice a week and progressive overload with proper form & exercises ?",
                "author": "Hot-Parfait-5293"
            },
            {
                "comment": "Is there a good post on recovery? Looking for tips on this. I take an ice bath once a week, hot tub a few times a week, I eat heavily, take creatine, and try to get lots of sleep. Anything  to recover faster would be great!",
                "author": "papagarry"
            },
            {
                "comment": "I've been walking, doing cardio and it has largely helped me reduce fat on my hands and legs but doesn't help with the upper torso. Any specific exercise routine that someone can provide me with to reduce the fat on the upper body?",
                "author": "ShriraamS"
            },
            {
                "comment": "Great info. All the basics concisely stated. Saved!\n\nhttps://www.reddit.com/r/workout/comments/ihz264/beginners_guide_to_working_out/\n\nSee also https://thefitness.wiki/\n\nAnd https://exrx.net/",
                "author": "bro4bro2u"
            },
            {
                "comment": "I actually did download MyFitnessPal a few weeks ago and it helped calculate my diet Kcal count.\n\nI started on 22/09/20 and I've lost about 4lbs so far! It'll take a while but my start weight was 13st 6lb and my goal is 9st 8lb (or 9st exactly if I reckon I can push it).\n\nIt's been very motivating to watch the scale drop down each week.",
                "author": "MedeaRene"
            },
            {
                "comment": "What is the best rep range for endurance?",
                "author": "nicky_wriggs"
            },
            {
                "comment": "Or you can get good physique in r/Trenbolone",
                "author": "trentrt"
            },
            {
                "comment": "Is it good to start out with Cardio until you see weight loss, then move to compound?",
                "author": "None"
            },
            {
                "comment": "Is having a home gym such as a bow flex machine or a Zeus smith machine more convenient and also worth it versus having a gym membership?",
                "author": "jesusitohernandez"
            },
            {
                "comment": "Hi this is great! Thank you",
                "author": "SelectionOptimal5673"
            },
            {
                "comment": "Great tips thank you",
                "author": "ninojeroncic12"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "Yay",
                "author": "dumpingdonutz"
            },
            {
                "comment": "if i take creatine and glutamine and work out 3-4times a week with a good diet and sleep well can i get a good physique?",
                "author": "lakumies987"
            },
            {
                "comment": "Thank you so much! I am a beginner and this is very helpful!",
                "author": "Pale_Midnight2472"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "these are great tips. you guys seem like a wholesome and friendly community too",
                "author": "bunnywithahammer"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "This was some great advice! Thank you.",
                "author": "GiftHonest7386"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "any advice on going to the gym as a total beginner? terrified of embarrassing myself and don’t have anyone to go with",
                "author": "okria"
            },
            {
                "comment": "It’s not that simple. Technically, it is calorie in, calorie out. But what type of calories? Are you getting the amount of protein, carbohydrates, and fiber you need? Vitamins and minerals? Get some blood work if you have insurance. Speak to a real, licensed dietitian or nutritionists.",
                "author": "moplague"
            },
            {
                "comment": "If my goal is to just becoming stronger... is it reasonable to stay with 15 pounds dumbells and doing more and more repetitions? I am poor and I can't buy heavier dumbells nor go to a gym. I am doing this [https://www.youtube.com/watch?v=SRpPHlDUC0Y&pp=ygUWcmFuZHkgY291dHVyZSBzdXBlcnNldA%3D%3D](https://www.youtube.com/watch?v=SRpPHlDUC0Y&pp=ygUWcmFuZHkgY291dHVyZSBzdXBlcnNldA%3D%3D)\n\nMore and more every day.",
                "author": "danielm316"
            },
            {
                "comment": "Hello. I am doing this workout every day\n\n[This](https://www.youtube.com/watch?v=SRpPHlDUC0Y&pp=ygUWcmFuZHkgY291dHVyZSBzdXBlcnNldA%3D%3D)\n\nI want to know which muscles I am training, so I need the name of the 8 workouts\n\n1. Military Press\n2. Squats with military press\n\nEnglish is not my first language, please help me. I am working out with 15 pound dumbells after an 18 hour fast (to benefit from human growth hormone) and I pretend to do more and more rounds of this workout in order to get stronger.",
                "author": "danielm316"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "check out my poll \n\n[https://ambomb123.substack.com/p/how-often-are-you-able-to-go-to-the?r=3ftzhi](https://ambomb123.substack.com/p/how-often-are-you-able-to-go-to-the?r=3ftzhi)",
                "author": "Ok-Conference1016"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "Good job. Nice post man",
                "author": "Berdad91"
            },
            {
                "comment": "NICE",
                "author": "Bakinesco"
            },
            {
                "comment": "why nobody knows, why gainer or protein racing my heart and make me anxious?",
                "author": "garni1999"
            },
            {
                "comment": "Any chance you could take a look at the workout plan my gym made for me and give your thoughts?",
                "author": "ARH85"
            },
            {
                "comment": "Is it possible to gain weight before loosing it?\nI’m on my third week of working out. I split my workouts and end with 10 minutes of cardio. ( I work in the hospital and walk about 3-4 miles in just a shift so I add that in as well) \nI just feel like I’m getting more bloated and chubby. I know it’s holidays and I’m not eating as well as I could be. I meal prepped for rice and chicken, I have IBS so there’s a lot of food I can’t eat anymore which has a big effect. A few years back I dropped a lot of weight about 20lbs. All I did was eat salad yogurt and chicken. I also did a lot more cardio… It wasn’t the most comfortable life style but I was able to manage it, and if that’s what I need to go back to I will.",
                "author": "None"
            },
            {
                "comment": "Late to the party but I'm getting back into a healthy life style eating right and working out.  Recently quit smoking so I'm trying to get my lung function back. Currently I'm eating between 1000-1250 calories a day of lean protein( turkey/ chicken) and vegetables. (I've dropped 16lbs since the beginning of December as of last week,  I haven't checked recently)(Mostly ketogenic diet with aspects of Intermittent fasting(not completely intentional just busy and not hungry in the morning so I drink water). I've started doing the stairs at my local high school stadium. There's 28 sets of stairs in a lap I can do 2 sets before my lungs and body are done and need a break. I'm set to start early morning work outs at the gym next week. I have no idea what to focus on. Any help would be appreciated. Also gym is a fully stocked college gym with all kinds of workout machines and free weights.",
                "author": "estcaroauteminfirma"
            },
            {
                "comment": "Bruv, you made my day start better, zanks man, I'm going to make a workout plan based on this post, thanks again",
                "author": "lickmyflick02"
            },
            {
                "comment": "You probably won’t answer but I’ll take a chance anyway to ask:… So I don’t eat junk foods often and hear fruit/vegetables/and proteins a normal amount but have gained weight, I don’t drink water as often as I should be so is that the reason?",
                "author": "Qilbyy"
            },
            {
                "comment": "Very useful guide and to add to this I want mention about the deal [All-in-One Durable Gym Bench for Full Body Workout Perlecare](https://www.workoutgains.com) - £49.99 -  @ Amazon",
                "author": "infor_world123"
            },
            {
                "comment": "This guy I know says after his workout, if his muscles cramp, he likes to let them cramp because it’s like a passive workout.  He doesn’t have to do anything except let his muscle cramp and it’s like he’s working out.  \n\nHe wasn’t able to cite any source for this.  It was just his “common sense”.\n\nIs there any truth to this?  Is there any positive or negative impact of letting your muscle cramp?",
                "author": "JK_NC"
            },
            {
                "comment": "Guys this is the site I get all my work out equipment. https://popularbrand.store",
                "author": "DallasBeast"
            },
            {
                "comment": "Thank you so much for this post! I just started boxing with the aim to gain strength and lose weight and this is such great advice!",
                "author": "Ok-Bike-1912"
            },
            {
                "comment": "Such an informative post! Thank you for sharing!",
                "author": "Fitprincesss"
            },
            {
                "comment": "I am starting the 75 Hard challenge. i am a 5,2 around 120 pound female. \n\nI am a bit worried about the 1 gallon a day water intake. \n\ni am on day 1 (I know it will be hard in the beginning) and I feel super bloated right now. I have about 30 oz to go. while doing research, I found that a lot of women drink a gallon a day and its okay.\n\ni am worried about my small size and over-hydration or getting sick.\n\nany advice?\n\nThank you for your time!",
                "author": "None"
            },
            {
                "comment": "Just asking for more opinions, I have don't have any weights, bench, or gym equipment.   \nCan I just do the following and still lose fats and gain muscles with these workouts?   \n\n\nJumping Jacks  \nPush up  \nSit Up / Crunches  \nSquats  \nStep up (Stairs)",
                "author": "None"
            },
            {
                "comment": "I don't have any types of equipment to work out with so I mostly do stretching for my warm-up. Then Push-Ups, Crunches, Squats, Step-Ups, and Planks. After that, I stretch again and cool down.\r  \n\r  \nIs this sufficient for burning fats and strengthening? Or Do I need to add more",
                "author": "None"
            },
            {
                "comment": "Where can I find good low-impact workouts? My wife has suffered many injuries in her young life, and to put it bluntly she is in her 20's with the body/joint problems of a a sixty year old. I am capable of doing most types of exercising, but I'm not familiar with things for people with joint pain.\n\nHer knees are the worst. Beyond just not bending far while doing exercises I don't know what to tell her.\n\nAny suggestions?",
                "author": "AshamedResearch2950"
            },
            {
                "comment": "Just a small question. How much protein is enough protein for gaining muscle and losing fat? Is it the 1gram or pound of lean muscle or smth else?",
                "author": "atadbitconfizzled"
            },
            {
                "comment": "I need help on how to gain weight and muscle but at home it’s Usually hard for me to get rides to the gym but I don’t want that from stopping me working out I just need tips on what type of forms or supplements I should take if anyone would care to help thank u",
                "author": "No_Race7683"
            },
            {
                "comment": "Quick question, if I’m looking to lose calf muscle, what should I do? Is incline walking bad for that?",
                "author": "Minagami"
            },
            {
                "comment": "Is it normal to feel sick every time I work out? Backstory: been laying around (literally) for about 2 years due to a back injury and the depression. I just started working out again (light weights not rushing) and even after these small workouts I feel really nauseous after.",
                "author": "None"
            },
            {
                "comment": "Hello how im about to fast for a month.How should i exercise during this fasting month?",
                "author": "Charming_Door9894"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "Oh my God, this is the first time I've seen this post. I'm a beginner who hasn't stretched after my workouts in months, and I was wondering why my chest and upper traps felt locked when lying down and trying to flatten it on the floor. Will I regain my range of motion if I start stretching after my workouts?",
                "author": "HormonalZuko"
            },
            {
                "comment": "hey this helped insanely cheers 🍻, i've got a few questions: \n\n1. can i workout only my arms and legs? \n2. can i gain weight (im skinny) and muscle? \n3. does pushups help build your arms shoulders and back? \n4. i've been working on my legs lately - squats and pushups, my legs are really sore afterwards and when i do pushups why do they shake so much??\n\ncheers again mate :)",
                "author": "Formal_Carry"
            },
            {
                "comment": "Will it don't my hight?",
                "author": "None"
            },
            {
                "comment": "How do I deal with extreme exhaustion from dieting and exercising",
                "author": "Ocdrn1981"
            },
            {
                "comment": "Does anyone know of a good gym weight / rep tracking app for iPhones?",
                "author": "Samgeorge484"
            },
            {
                "comment": "This is amazing \nWill help a lot of people get started in the right direction\n👏🏻👏🏻👏🏻",
                "author": "None"
            },
            {
                "comment": "Hello - do you have anything on the mental part ? I am not consistent at all -",
                "author": "cercledali"
            },
            {
                "comment": "Thanks for this. It answered 80% what I was going to ask.",
                "author": "thebutchcaucus"
            },
            {
                "comment": "Thanks for this post, and about the app, does it recommend the number of reps and sets I do? Cause ik nothing",
                "author": "None"
            },
            {
                "comment": "You sir, are an absolute legend. 🙏",
                "author": "None"
            },
            {
                "comment": "Have only fans? Follow me for fitness & other content @ fitmindsetdime 💪🏽💋🍑🥰 Hope you have a great day",
                "author": "None"
            },
            {
                "comment": "Great post!! Perfect for the beginner!",
                "author": "Temporary_Name_6543"
            },
            {
                "comment": "This is probably a stupid question but anyone can answer. My coaches have always been super stern on not drinking soda. Is there really any correlation between soda and performance? Asking because I'm a huge zero sugar/diet soda fan lol.",
                "author": "blue7004"
            },
            {
                "comment": "Are those home fitness apps worth a damn at all?",
                "author": "_Volatile_"
            },
            {
                "comment": "In reference to losing weight in a specific area, what if a person is unhappy with the size of an area, such as their thighs, but are bordering on the edge of underweight and typical weight (BMI wise)? Losing any more weight could be an issue or unhealthy but if that area isn't to a point they want it to be what can somebody do? Would they just need to work on tone-ing that area?",
                "author": "APerfidiousDane"
            },
            {
                "comment": "I really want to do cardio but I don’t just want to run around the yard or something ide rather be in my home so I’m saving for a treadmill but I’ve been told a lot that it’s terrible for your back and feet but idk what else to do",
                "author": "None"
            },
            {
                "comment": "This is great thanks for sharing mate",
                "author": "Apprehensive-Put5487"
            },
            {
                "comment": "Under the losing weight section, you mentioned how they could just remove 250-500 calories worhh of food from whatever they eat daily. I hope I interpreted that correctly.\n\nWould that also work for someone trying to gain?\nDo they just eat an extra 250 calories worth of food in addition to their normal diet without getting into the whole weighing and calculating their food/calories of their normal diet?",
                "author": "covert_wav"
            },
            {
                "comment": "Wow. You’re amazing. How long did it take to write all that?",
                "author": "Lumpy_Reserve_4852"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "I work shifts in the evening and get off work at 11pm CST. I get to the gym roughly at 1130pm And finish my workout around 1245am.\n\nIs it okay to have a protein shake after my workout? Im sure it is but I am also hearing never go to bed on a full stomach",
                "author": "gr3gw0w"
            },
            {
                "comment": "What is the best range of reps for toning? I’ve lost plenty of weight but now I’m “skinny fat”",
                "author": "RunMaleficent954"
            },
            {
                "comment": "!",
                "author": "Personal_Ad_5348"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "is it bad to repeat a program multiple times? if i am running a 15 week program for instance, i'd obviously have progressed assuming i push hard enough and follow it accurately. by the end of the 15 week program, would you suggest finding a new one or running it again if i enjoyed it? obviously RPEs and weights would look different because i'd be stronger.\non a separate note:\nif i wanted to make my own, how would uou implement periodization?\nlike if my main goal is hypertrophy with strength in a close second, if i had 3 blocks of 4 weeks, how should each block change? like what should their goals be? increase volume each block? etc. and should each week within a block change? and when should i deload. if it's a 12 week program, maybe in the middle? and should i retest my maxes at the end before i repeat or at another time in the program?\n\nwhat do you think of this idea... i'm trying to gain weight but at the end of the day the main thing is calories in vs calories out. i've been eating about 3000 calories a day with about 1.2g/lb of protein.\ni wanted to create my own program and i only can go about 5 days a week because i'm a busy college student.\ni was thinking about maybe doing something like push, pull, legs, cardio+core, full body functional+calisthenics, for my 5 days. i want to be very well rounded. so i'd complete each of those each week.\nthose weeks would add up to maybe 3 blocks of 6 weeks with each week being that split that i discussed above. each block would end in a deload. (so actually 5 weeks + deload).\nso here are my questions\n- ﻿﻿is that even a good idea? if not, how would you change it?\n- ﻿﻿where would you suggest i test my maxes within those blocks?\n- ﻿﻿if i wanted to make those 3 blocks, what should each block focus on? ie: block 1 hypertrophic, block\n2: strength, etc. and what does it mean to focus on those things in terms of volume? for instance does hypertrophy mean that block should have lower or higher reps etc. kinda confused as far as how i should be changing each block.\n- should exercise selection & order change from week to week within a block? what about from block to block?\n\ni'm not new to fitness at all... been working just a regular push pull legs split whenever i have the time. i'm iust new to periodization because i was told i would flatline in my progress if i didn't start periodizing so now i can't manage to find any good help.",
                "author": "damonSalvatore696969"
            },
            {
                "comment": "I'm so retarded that even though I read this all the way I still have no idea what to do, wish I could afford a trainer to just tell me what to do and what to eat lmao",
                "author": "Hyper-scout2"
            },
            {
                "comment": "Hilo ok",
                "author": "Glad_Science_7493"
            },
            {
                "comment": "Is it better to do 50 pull-ups in like 20 30 minutes, or do like 5 pull-ups every time you go past the bar (also totaling to around 50)?",
                "author": "Yarm1d"
            },
            {
                "comment": "Thanks for this great thread. I'm looking for flat abs, not much more, and finds this. \n\nPlease correct me if I'm wrong. From what I read, I should train my body one by one. So it's somewhat like this\n\nDay 1: Hands\nDay 2: Chest \nDay 3: Abs\nDay 4: legs\nDay 5: Hands\nEtc\n\nSo that by the time I exercise certain body parts, it already gain enough rest. \n\nEnglish is not my first language. So if my understanding is wrong, please correct me! \n\nIt's been a months since I start working on my abs. I just want a flat abs, so I tough to work it out.\n\nSomehow it doesn't seems to work. I got soreness, yes. But it's always elsewhere, despite I work my abs\n\nSo after reading this, I notice it's a myth to just lose fat from one part of our body. So my whole months is just waste.",
                "author": "Mountain-Slip1690"
            },
            {
                "comment": "I'm just beginning working out for muscle building instead of activity. Should I be using stuff like protein powder and pre-workout?",
                "author": "Imchoosingnottoexist"
            },
            {
                "comment": "I just actually started working out and this was exactly what I needed. Really asked a lot of questions! Thanks.",
                "author": "None"
            },
            {
                "comment": "What to do at home without equipment?",
                "author": "thepotatoiswatchingu"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "I'm 15 and Ectomorph body type. And I eat a lot but still i don't gain any weight. I've started doing home workout without equipment since 8 months and now I don't get enough time to do so. I'm also active in Basketball therefore I want to which type of exercises i should do in ½ hr which will help me to gain weight. Besides, I also don't want my height growth to be getting affected by workout. I wanna do exercises which may help me gaining weight and also help me in height due to basketball. I'm 5.3 and vegetarian. Please enlighten me.\n\n:/",
                "author": "Acceptable_Creme_174"
            },
            {
                "comment": "Thank you for this!",
                "author": "poopypants2407"
            },
            {
                "comment": "Remindme! 4 days",
                "author": "energy_dash"
            },
            {
                "comment": "Remindme! 6 hours",
                "author": "energy_dash"
            },
            {
                "comment": "https://www.etsy.com/listing/1252045814/get-up-and-get-fit-with-the-perfect?click_key=4aa3901704ac8cda4f200629159bc526ed0dac79:1252045814&click_sum=95dbe4c5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=Get+up+and+get+Fit+with+the+perfect+fitness+journal.&ref=sr_gallery-1-1&organic_search_click=1",
                "author": "Complex_Incident_406"
            },
            {
                "comment": "I'm a 5'7 300lbs, 34yo male. I've had my diet correct for 6 months and I started push ups last week. I went from doing only 2, to 3, to 6 after waiting a day in between which was nice to see. I added a 45 second plank tonight. Later I'll add a daily 40 minute bike ride. \n\nShould I be doing more than one set of push ups? Does waiting a minute and doing 2 more push ups count as another set or would it be a part of the first set? How many sets should I do in a day? What's the healing rate of muscle?",
                "author": "DJGammaRabbit"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "Thanks man?",
                "author": "Dull-Acanthaceae-478"
            },
            {
                "comment": "This answers all the questions I came to ask.\n\nI am 58 year old male going from ad hoc exercise to a five days a week regimen - three strength and two cardio.  I was a four-sport high school jock (and nerd - it was a small school) and a springboard diver in college, and am currently walking 3x a week and being active on my hobby farm on the weekends.  I am fit for my demo but want to lose ten pounds and gain core and upper body strength especially.\n\nI have picked Muscle and Fitness' four week beginner program to start - [https://www.muscleandfitness.com/workout-plan/workouts/workout-routines/complete-mf-beginners-training-guide-plan/](https://www.muscleandfitness.com/workout-plan/workouts/workout-routines/complete-mf-beginners-training-guide-plan/)\n\nTomorrow is my orientation and Monday is Day One.\n\nHere we go - wish me luck!",
                "author": "KaleidoscopeWeird310"
            },
            {
                "comment": "I like to workout shortly after I wake up so eating my biggest meal of the deal hours before isn’t really an option. Is there any harm to eating a bigger carb meal before bed 11:30 pm if I am going to workout at 8:00?",
                "author": "Chucker925"
            },
            {
                "comment": "Didn’t want to open a new thread for this question. Hope this is the right place.\n\nSo, I can bench 205 at the moment. And it’s my PR, ever. Most of my upper body/back workouts I can lift around 150+. Arms and shoulder workouts are usually done around  of 50-60 lb. But why is it that when I try to move plates around I struggle so bad? 45’s really makes me feel weak. What type of workouts should I do where I can carry at least a single 45 lb plate relatively easily? \n\nPlease and thank you.",
                "author": "None"
            },
            {
                "comment": "Stay hydrated. Drinking fluids throughout the day is essential for maintaining healthy hydration levels\r, Optimize your nutrition. Be sure to consume a balanced diet to support your fitness program., Warm up. It's important to warm up before your workout.\r  \nCool down.\r Listen to your body",
                "author": "oliviaataylor"
            },
            {
                "comment": "My hardest problem is the nutrition planning aspect. Is there a specific resource you’d recommend that could help make sense and design meal plans?",
                "author": "Demstaway"
            },
            {
                "comment": "Thanks really helpful",
                "author": "1Drp"
            },
            {
                "comment": "[motivation video fitness](https://www.youtube.com/watch?v=_bNNr2eTACo)",
                "author": "graphiosinc"
            },
            {
                "comment": "I am planning to work out on a 2 hour break in between classes. I want to get a 30 minute work out in, should I eat before or after my gym time?",
                "author": "Sonically3"
            },
            {
                "comment": "This thread needs an update lol",
                "author": "SilverSuferNorr"
            },
            {
                "comment": "My fitness pal is not free. Why advertise that when it costs alot of money?",
                "author": "Comprehensive-Data90"
            },
            {
                "comment": "Awesome, thanks!",
                "author": "Raincleansesall"
            },
            {
                "comment": "So I started working out last year and then ran into nose issues I won’t get into here. I’m trying to get back into working out. I really got into hiit workouts. But I heard you are not supposed do hiit workouts everyday. So what’s a good regimen? I was also lifting weights this is at at home. Nothing extreme though. I am also seeing a lot of program ads on my feed for handstands and inversions. Wondering if there is a good program that is legit I can sign up for?. What’s the best thing to drink to stay hydrated?. I hear water is ok but you need more than just water. I am vegetarian I eat pretty healthy. Sometimes I cheat I usually give myself a rule be good during the week and the weekend I can cheat. I don’t cheat much just love to have a yummy breakfast like waffles and such. Any answers/suggestions greatly appreciated thank you.",
                "author": "thatchickneko"
            },
            {
                "comment": "What kind of workout should I do as a 16yr beginner to build arm muscles? Im terrible at pushups (incorrect forms as people said, and when I do the correct forms I can only do it 4 times) and can only lift around 15-20",
                "author": "TemporalEter"
            },
            {
                "comment": "https://www.ebay.com/itm/204227454972?mkcid=16&mkevt=1&mkrid=711-127632-2357-0&ssspo=TBu1SQDTS1G&sssrc=2047675&ssuid=TBu1SQDTS1G&widget\\_ver=artemis&media=COPY",
                "author": "Academic-Meat-6636"
            },
            {
                "comment": "Me move weight\nMe get stronger",
                "author": "None"
            },
            {
                "comment": "is working out really healthy? I have read that it puts stress on the heart. I want to work out to be healthy and to also put on muscle. is there any truth to premature aging and stress on the heart?",
                "author": "Spirited-Inspector37"
            },
            {
                "comment": "This was exactly what I needed. Did you release the IOS app yet? I tried to locate it. Thank you",
                "author": "museosole"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "Always make sure to track your progress\n\nhere is how and why\n\nhttps://www.youtube.com/watch?v=2ZIN98OFDIE",
                "author": "EyadGarden"
            },
            {
                "comment": "Anybody had a good routine program for legs?\nThanks",
                "author": "Ryanflorida2015"
            },
            {
                "comment": "I have 4 workouts i do at home each week 2 core/lower body(one is a more intense then the other)  upper/back, upper/ chest. Now if i did these 4 days in a row would it be better to do the core workouts and upper back to back or would it be better to go alternatively?",
                "author": "YungMucha"
            },
            {
                "comment": "If someone wants to workout to \"have a healthy lifestyle\" but they don't want to gain muscles or lose weight because they are underweight. What kind of exercises should they do?",
                "author": "ImportantClick3712"
            },
            {
                "comment": "The link to perfect fit doesn’t work",
                "author": "Cawlaw92"
            },
            {
                "comment": "I’m going to be trying to hit the gym 3x a week to help process a breakup with something productive. This seems like a solid area to start. \n\nOn stretching, short of foam rolling, what do you specifically recommend?  How should one go about preworkout stretching?\n\nI’ve also heard that starting off leaner is beneficial and yields better initial results. Is there any truth to this?",
                "author": "ThinSet3"
            },
            {
                "comment": "I’m overweight, and don’t like to cut my food intake. Instead, I started walking 15,000 steps a day and do some 2 miles of cycling. While I’m still overweight (according to the BMI index), I turned from being 220 lbs to 180lbs in a matter of 8 months. So, if you’re like me that likes to enjoy foods in life, just up your calorie use by doing basic cardio. If you’re a student in college, walk everywhere on campus, if you’re a worker in a big city, try to take public transit and walk. If you can’t walk outdoors, walk on a treadmill. If you don’t have access to a treadmill, then walk indoors like the hallways of your apartment or the floor of your house.",
                "author": "AdvancedAd1256"
            },
            {
                "comment": "This is amazing! Thank you!",
                "author": "JagatorG"
            },
            {
                "comment": "Thanks",
                "author": "Timberd00dl"
            },
            {
                "comment": "Thanks so much!! You answered so many of my questions I was going to ask. And recommendations on a good protein powder. I definitely feel like I'm going to struggle hit my bodyweight number in protein grams without a little assistance.",
                "author": "raindropjungle"
            },
            {
                "comment": "this beginner guide got me in the gym today.  Ty!",
                "author": "Free_Mail_7865"
            },
            {
                "comment": "https://youtu.be/XBjWBnA-oMY",
                "author": "Nattyking88"
            },
            {
                "comment": "It's late but i saw this randomly on my feed a motivational slash fitness journey on youtube..\n\n\nhttps://youtu.be/izge3gdUeTc",
                "author": "Due_Consequence_5375"
            },
            {
                "comment": "This helped so much",
                "author": "Livlc14"
            },
            {
                "comment": "Thanks! Sadly the android app is outdated and can no longer be downloaded.",
                "author": "marcola42"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "the link to the app is not working :(",
                "author": "None"
            },
            {
                "comment": "I'm 14 and I'm trying to cut and I need a good workout routine. Can you help me with that?",
                "author": "SmokeExisting3837"
            },
            {
                "comment": ":D\n\ngreat!! i love that you included that you cant do spot fat eduction!",
                "author": "Jojoceptionistaken"
            },
            {
                "comment": "Thank you so much for taking the time to share your knowledge with us! It was very well written and easy to understand.",
                "author": "Brown052717"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "I use Map My Run",
                "author": "Rahik-Ahsan18"
            },
            {
                "comment": "Just an update. I don't think MyFitnessPal is free anymore. You know have to pay a premium for it. Cronometer or FatSecrect are still free to use as of this post.",
                "author": "jaggedhaze"
            },
            {
                "comment": "Workout Bible",
                "author": "adits510"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "Does 15/30 minutes on treadmill count as warming up?",
                "author": "MoreImportance409"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "when I exercise on the elliptical, the first 5 minutes my legs will feel the burn, but then afterwards it goes away. What is going on here? There's no way I'm hitting some kind of runners high after 5 minutes am I?",
                "author": "MuffinEducational744"
            },
            {
                "comment": "Excellent post! Wish I had read this 10 years ago",
                "author": "Any_Hovercraft7708"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "I’m here to tell you there’s nothing wrong with not wanting to get in shape. There’s a difference between liking something as a concept, but not actually wanting or being able to dedicate the time and resources to doing it",
                "author": "ChickenAccurate"
            },
            {
                "comment": "This!!",
                "author": "hinreaper"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "[https://www.theprotocolshop.com/sales](https://www.theprotocolshop.com/sales)",
                "author": "lo_mas_supremo"
            },
            {
                "comment": "Good question! I'd recommend going with raw, and just comparing it with the \"uncooked\" options in food databases - with most grains, this is the default info on the label anyway.\n\nWhen you cook food it adds too many different variables to the end weight, based on how much water you used, how long you cooked it for, etc.",
                "author": "Perfect-Fitness"
            },
            {
                "comment": "did u plan ur workout session by ur self? Cause I want to start working out with a weekly plan, and foot diet, so do u know someone who can help?",
                "author": "None"
            },
            {
                "comment": "Muscle soreness is more related to working out muscles that you don't normally train. If you are training regularly, you may not experience soreness unless a workout is much more intense than usual. It's not an indicator of whether or not you exercised \"hard enough\".",
                "author": "Perfect-Fitness"
            },
            {
                "comment": "I would love to commit to this but I have a huge junk food problem, shit tastes too good, any tips as to how I can get over this?",
                "author": "IndiscreetBeatofMeat"
            },
            {
                "comment": "That means you should choose a weight you can do at least 8 reps with, but no more than 12 reps with.",
                "author": "Perfect-Fitness"
            },
            {
                "comment": "Is your form bad? That may make it exponentially harder. Do them slow and controlled, and exhale when you exert force",
                "author": "stultiloquy"
            },
            {
                "comment": "Bigger leaner stronger is like a longer version of this post. It is a great summary of everything. Starting strength is a guide for barbell exercises. It is mostly about proper technique. Overcoming gravity is a guide for bodyweight exercises. It has technique and programming advice.",
                "author": "Soggy_Worker7063"
            },
            {
                "comment": "Grant you mercy f'r the info i just did start working out and this helps a lot!\n\n***\n\n\n\n^(I am a bot and I swapp'd some of thy words with Shakespeare words.)\n\nCommands: `!ShakespeareInsult`, `!fordo`, `!optout`",
                "author": "Shakespeare-Bot"
            },
            {
                "comment": "50 lbs is the weight of 83.33 Minecraft Redstone Handbooks.",
                "author": "useles-converter-bot"
            },
            {
                "comment": "You definitely need to add more food back into your diet for it to be healthy. Running isn’t always the best way to lose weight. Maybe try picking up weights (maybe start with like 2lbs,3lb, or 5lb) and doing always like aerobic yoga, jump rope or cycling",
                "author": "Onyxtides"
            },
            {
                "comment": "Re-read this post and you will see that you don’t need to run to loose weight",
                "author": "Bizzy1995"
            },
            {
                "comment": "Read the guide above, it answers your question.",
                "author": "JustWantToPostStuff"
            },
            {
                "comment": "Out of curiosity how are you shaping up now?",
                "author": "Freddycipher"
            },
            {
                "comment": "Typically anywhere from around 15-30",
                "author": "Perfect-Fitness"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "Either : \n\n- start alone at home with bodyweight (it help to learn the basic however it's really important not to take bad habits)\n\n- build a full gym at home (really expensive and need a lot of space) \n\n- find a coach \n\n- find someone close to you through social media maybe\n\n- go anyway with your fear, most gym buddies are cool \n\n  \nI personally have a gym at home because I'm kinda germophobe so going to the gym was a no go from the start, the investment was long and it costed me a lot of money, however I do not regret it now that it's almost complete.",
                "author": "Lindzei_"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "Could be what is it in or perhaps the wrong ones for your body",
                "author": "Onyxtides"
            },
            {
                "comment": "Probably just eating too many calories. It doesn't matter how \"healthy\" or \"unhealthy\" the food is, if you consume more calories than you burn you will gain weight and if you burn more than consume you lose weight. Obviously eating well is good for you but it's not the quality of the food that determines if you gain or lose weight, at least not directly.",
                "author": "Mehrlin47"
            },
            {
                "comment": "If one dude that went to school/uni for this says to stretch, whilst having sources and the other dude just spouting bs without sources, who do u think has a higher chance to be \"right\"",
                "author": "None"
            },
            {
                "comment": "I’m sorry to hear that. If her joints are that bad, you might need to go see a physiotherapist. ",
                "author": "Relevant-Owl-9815"
            },
            {
                "comment": "Quick question, if 't be true i’m looking to loseth calf muscle, what shouldst i doth? is incline walking lacking valor f'r yond?\n\n***\n\n\n\n^(I am a bot and I swapp'd some of thy words with Shakespeare words.)\n\nCommands: `!ShakespeareInsult`, `!fordo`, `!optout`",
                "author": "Shakespeare-Bot"
            },
            {
                "comment": "If you mean you want to gain muscle on your calves I would recommend calf raises. You can do them weighted or in a machine to apply progressive overload.",
                "author": "Mehrlin47"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "1. In terms of possibility yes is it optimal no hitting your back, triceps and chest are also important. A fit back gives an illusion of a smaller waist plus it’s healthier to build a balanced structure body\n2. Yes 2 words caloric surplus \n3. Yes so does compound exercises \n4. Muscle fatigue and soreness it’s like that in the beginning but it gets easier it’s your muscles tissue tearing and getting stronger",
                "author": "ZiadTheChamp"
            },
            {
                "comment": "Sleep, electrolytes and don’t go beyond your limit take a rest and hit your nutrition targets low protein or carbs can make you feel exhausted. Make it fun!",
                "author": "ZiadTheChamp"
            },
            {
                "comment": "Do your workouts at the same time everyday plan them ahead so you have goal in mind instead of just drifting and then getting bored. Have you’re workout clothes ready on the bed so it pushed you to go. Track the days you go so you feel responsible for when you miss it. Joining a program really helps or getting to know people since they will push you and hold you accountable",
                "author": "ZiadTheChamp"
            },
            {
                "comment": "Try calisthenics and jump rope all you need really",
                "author": "ZiadTheChamp"
            },
            {
                "comment": "Body positivity is important !!! To reach optimal body structure you would need to build muscle in that area, over all body composition is important. Having a fit back gives an illusion of a smaller waist for example. You can’t target fat so caloric deficit is the only way, although considering you’re under weight I would highly suggest adding weight instead a (caloric surplus) and you’ll see your fat get reduced by muscle mass you build slowly generally.",
                "author": "ZiadTheChamp"
            },
            {
                "comment": "Jump rope",
                "author": "ZiadTheChamp"
            },
            {
                "comment": "If you want to gain and lose weight then do lean bulking other that that it’s either surplus or deficit",
                "author": "ZiadTheChamp"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "As he said the 1 hour window of protein intake after a workout is optimal and protein shakes are efficient in doing so. I would suggest maybe try having high protein meals across the day before you’re workouts to reach your daily protein intake.",
                "author": "ZiadTheChamp"
            },
            {
                "comment": "- 12 reps of focused slow mind muscle focused with good form \n- toning is mostly if your already at an optimal body fat percentage so you want to define muscles \n- focusing on high protein diet and a resistant training program should fix your “skinny fat” body to a more defined structure",
                "author": "ZiadTheChamp"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "I had a pull up bar in my bedroom doorway as a teen. Fast forward 30 years later and I still love pull ups. My recommendation is to really focus on doing proper dead-hang slow pull-ups where you touch your chest to the bar. Master this technique. Don't ever do those stupid kip up bouncing bullshit you see all the time nowadays. \n\nOnce you master the proper technique then do as many as you can until failure. Have goals and do whatever you can to reach that pull-up goal. Currently I'm trying to get back to doing 20 dead hang perfect pull ups. I attempt it once per week and try to get one additional pull up per week. I do 4 sets of pull ups per week which include weighted pull ups and regular ones with different grips (wide, close, palms in). You should be doing everything but don't do them everyday. You need to rest several days, if not a week after a solid workout.",
                "author": "Kav_McGraw"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "I will be messaging you in 4 days on [**2022-09-20 08:56:08 UTC**](http://www.wolframalpha.com/input/?i=2022-09-20%2008:56:08%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/workout/comments/ihz264/beginners_guide_to_working_out/ion4zpk/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fworkout%2Fcomments%2Fihz264%2Fbeginners_guide_to_working_out%2Fion4zpk%2F%5D%0A%0ARemindMe%21%202022-09-20%2008%3A56%3A08%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20ihz264)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                "author": "RemindMeBot"
            },
            {
                "comment": "Have you stayed on track? \n\nTo answer your question, a lot of it is gauging how your body feels. We’re you winded after 6 pushups? Or were you’re muscles just tired? \n\nIf the latter, then another set wouldn’t be a bad thing. Hopefully you figured it out in the end!",
                "author": "Marston_vc"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "I wouldn't worry too much about it. Over time your body will get used to moving those plates. It's mostly about grip strength. If you really want to work on it, you could do farmer carries.",
                "author": "Kav_McGraw"
            },
            {
                "comment": "yeah yeah sounds great",
                "author": "Louisgreeen"
            },
            {
                "comment": "ooooo, very informative",
                "author": "johndebb"
            },
            {
                "comment": "Keep it simple. Think in terms of portions. For example, each meal could have one portion of protein, one carbohydrate and one vegetable. A portion should be no bigger than your fist. Fruit should be included as a carb. Eat 4-6 meals a day. Lay off the sugar, cheese, and white breads.",
                "author": "Kav_McGraw"
            },
            {
                "comment": "Definitely after.",
                "author": "Kav_McGraw"
            },
            {
                "comment": "Last time I checked, the basic version of this app was free. It’ll do calorie tracking and integrate with other app for free. \nPremium just really unlocks the ability to see things like your protein, fat, and carb intakes. ",
                "author": "Relevant-Owl-9815"
            },
            {
                "comment": "You start with the correct form and build up. Can only do 4? Then do those 4 perfectly every day, once or twice a day. When you’re ready, try 5. Then repeat the cycle. By three weeks I bet you would have doubled your strength. \n\nAs a younger person, it can be hard to have the patience for this. But I promise you, as long as you just keep doing those good form pushups, you’ll eventually be able to do more. And that works for literally any workout. \n\nStart now instead of putting it off. When you’re 17 you’ll look back and be proud you’re 16 year old version of you put the work in.",
                "author": "Marston_vc"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "Can't see this video, it's private",
                "author": "johnyduke93"
            },
            {
                "comment": "The same kind of strength training someone who wants to get big would do but without sticking with it for the years and years it takes to get big muscles. \n\nWhile also eating enough to gain weight.",
                "author": "WonkyTelescope"
            },
            {
                "comment": "Being active is somewhat helpful for weight loss and maintenance, but it’s not going to help with things like cholesterol. So, it’s important to be aware of the way your diet affects things like heart health. ",
                "author": "Relevant-Owl-9815"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "On iOS at least, it’s still free. Just checked it now. The premium edition removes adverts and allows you to fine tune the tracking options to check things like protein or carb intake. But the free version still does calorie tracking. ",
                "author": "Relevant-Owl-9815"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "as much as i hate sentences wich start like that, this makes actual sence.\n\nmedically questionable though.",
                "author": "Jojoceptionistaken"
            },
            {
                "comment": "u/Anti-ThisBot-IB",
                "author": "Sufficient_Cellist20"
            },
            {
                "comment": "Says you need a code to get into the app",
                "author": "buttholez69"
            },
            {
                "comment": "And for those who can’t afford gym memberships or those overpriced fitness apps? How can we know that we’re doing the right thing?",
                "author": "Relevant-Owl-9815"
            },
            {
                "comment": "Try packing each portion so you don't over eat them",
                "author": "stultiloquy"
            },
            {
                "comment": "I would try to be more mindful of how much you’re putting in your body and eat more of a variety of your macros. Then you can have a treat once and a while. I agree with stultiloguy with trying portion sizes, this has helped me a lot. Also it comes with a lot of consistency and motivation to want to help your body be healthier. I use the app “MyFitnessPal”.",
                "author": "Livlc14"
            },
            {
                "comment": "I cant finish the other workout is it ok to finish the day?",
                "author": "Reader_Da_Doo"
            },
            {
                "comment": "k.",
                "author": "Webdev420"
            },
            {
                "comment": "Yeah. I'll probably just end up doing pushups and squats for a few months.",
                "author": "Webdev420"
            },
            {
                "comment": "I wanted advice on how I can run again.",
                "author": "Webdev420"
            },
            {
                "comment": "My bad. New to Reddit and didn't see the expand option. Thanks.",
                "author": "ShriraamS"
            },
            {
                "comment": "Well this is awkward XD life happened and I'm now *heavier* than my original start weight....\n\nI've got a plan to lose it again but I'm no longer near any gyms and between work and studying I have very little spare time to exercise.\n\nEdit: currently I'm around 13st 13lb (so I've gained 7 lbs from my start weight 2 years ago)",
                "author": "MedeaRene"
            },
            {
                "comment": "And would that be the best fot weight loss? Along with cardio and diet of course.",
                "author": "nicky_wriggs"
            },
            {
                "comment": ">Remindme! 4 days",
                "author": "energy_dash"
            },
            {
                "comment": "Nope! I was actually eating a little too much.",
                "author": "DJGammaRabbit"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "Just ask to join the site, I'll approve it and then you can access the program.",
                "author": "Upbeat_Carpet_1474"
            },
            {
                "comment": "I know this is really late, but I wanted to start jogging too. I used to when I was younger, and loved it but started smoking/not taking care of myself. When you’re young your invincible right? Lol. I got this treadmill on clearance a while back at Walmart that’s called IFIT, and it connects to this Apple app. I just tried it yesterday, and they have introduction to jogging classes on there and they adjust the treadmill for you. I think you get a free year subscription with the treadmill purchase, but the app has a free month trial. Maybe look into something like that? He tells you what he’s adjusting it to too so you don’t need that specific treadmill for it. Only tried it once, but it was the first time that I didn’t feel overwhelmed in jogging because it’s in bursts. This “class” has like 32 videos/workouts for it then there are more that get progressively harder.",
                "author": "Bambi943"
            },
            {
                "comment": "I didn't know it was based on genetics either.",
                "author": "ShriraamS"
            },
            {
                "comment": "This happens with everybody I know. People are motivated initially. But bad habits eventually kick in. Shits hard AF.",
                "author": "chinna3cks"
            },
            {
                "comment": "I would actually recommend lifting slightly heavier weights for fewer reps if your goal is weight loss (around 8-12). Your diet is what should be mainly taking care of the weight loss; the workouts should be ensuring you don't lose any muscle mass in the process. This is what gets you that \"toned\" look.",
                "author": "Perfect-Fitness"
            },
            {
                "comment": "I will be messaging you in 4 days on [**2022-09-26 15:32:58 UTC**](http://www.wolframalpha.com/input/?i=2022-09-26%2015:32:58%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/workout/comments/ihz264/beginners_guide_to_working_out/iphakve/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fworkout%2Fcomments%2Fihz264%2Fbeginners_guide_to_working_out%2Fiphakve%2F%5D%0A%0ARemindMe%21%202022-09-26%2015%3A32%3A58%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20ihz264)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                "author": "RemindMeBot"
            },
            {
                "comment": "Sponsored by **Body-Snack-Now**",
                "author": "Jojoceptionistaken"
            },
            {
                "comment": "And what should I do for weight gain?",
                "author": "LePingouinCosmique"
            },
            {
                "comment": "Eat more",
                "author": "Mehrlin47"
            }
        ]
    },
    {
        "title": "Do you need to Gain Weight, Lose Weight, or Maintain Weight? Look Here First!",
        "content": "The following post was originally contributed my /u/mjconns, who recently left the moderator team, and deleted the original post.\n  \nThis is a one-stop shop for all weight-related questions -- also known as cutting/bulking/recomp. Ideas, suggestions, guides, workouts, etc -- everything you'll need to answer 99% of questions! This is meant to be a community/collaborative effort, so please add in suggestions in the comments!\n\nTo be clear on a couple terms -- when exercising and eating to gain weight, that is called __bulking__ (aka caloric \"surplus\"). Eating less to lose weight is called __cutting__ (aka caloric \"deficit\"). And eating just enough to not gain or lose weight is called __maintenance__ (aka recomposition or \"recomp\").\n\n## A visual guide to male and female BF% estimates\n\n-   [From athleanx](https://www.instagram.com/p/B8IPmtkFYQx/?igshid=17upb60h7gk3)\n\nI don't like guessing BF% as there's no way to know how much visceral fat we store internally. But athleanx's general guidelines are as good as any for visual estimates.\n\n## Who should cut or bulk?\n\nThe idea behind cut and bulk cycles is to gain muscle and fat in a bulk phase and then try to keep all your muscle and burn off fat in a cut phase. This approach is generally 'faster', when done correctly, than \"recomps\" (recompositions) where you maintain your weight but work out hard and try to replace fat with muscle.\n\nGenerally speaking, if you're an active person and/or consistently working out, you can do cut/bulk cycles. To get started, you need to know your maintenance calories (\"maint\") to have an idea on how many calories you can consume without gaining or losing weight, hence the term maintenance; no change in weight. To bulk, you eat more than maintenance (aka \"surplus\") and to cut you eat less than maintenance (aka \"deficit\"). If you *are not* working out and you bulk, that's how you get fat. So don't eat above maint if you're not also working out.\n\n## Getting started\n\nTo get started, you need to know your \"maintenance\" calorie needs and for an estimate you need a TDEE calculator (I like [this one](https://tdeecalculator.net/), but you can google for others). Think of this as a starting point to use that will need some adjusting over time.\n\nOnce you have an estimated maintenance, you generally add 250-500 calories for a bulk and subtract 250-750 calories in a cut. Generally, it's safer to over-do cuts and under-do bulks. In a bulk you gain both fat and muscle and after a point you only gain fat (fat stores faster than you can build new muscle), so be cautious in bulks and don't \"dirty\" bulk.\n\n## Deciding to cut or bulk\n\nSo far as I'm aware, there isn't a hard science behind *when* to bulk or cut, but there are guidelines to consider. When bulking, our bodies build muscle *and* store fat and, after a point, our bodies prioritize storing fat over building muscle. This is why dirty bulking is bad and, generally speaking, if your BF% is > 20%, you should not bulk. Any higher BF% and your body tends to prioritize fat storage vs muscle gained from bulking.\n\nSimilarly, cuts are usually done to around 10% because any lower than that and the body will begin to consume more muscle than fat and muscle loss is more likely.\n\nYou *can* make strength gains on a cut. You can't build new muscle, but you can \"refactor\" (that's my word for it, I'm sure there's a scientific one) existing muscle to be more efficient, hence stronger, as you lose fat. Also, repetitive gym visits will help you become more proficient at working out which helps in the long run when you start bulking and building new muscle.\n\nIf you're really unsure, you can make a post in [r/BulkOrCut](https://www.reddit.com/r/BulkOrCut/) to get community feedback on what it's you personally should do.\n\nIf you're skinnyfat, generally you can eat at a small maintenance (aka \"clean bulk\") and make great strength gains. If you have little muscle mass to cut to, you will just look tiny/thin -- especially if you're tall. So for most skinnyfat people, and I would clean bulk and diligently follow a legit lifting routine. Which brings me to...\n\n## Workout routines\n\nBefore getting into routines, I think it's worth mentioning first that everyone should walk more. At least 5 times per week, 30 minutes per day:\n\n-   [Get ripped. Get walking.](https://www.t-nation.com/training/get-ripped-get-walking)\n\nCheck out [The Beginner's Guide to Working Out](https://www.reddit.com/r/workout/comments/ihz264/beginners_guide_to_working_out/)\n\nThe best workout routine is the one you can consistently follow. If you're new to the gym, just about anything will get you some results. To a point. If you want to be smart about it, do not make up your own routine! There are plenty of legit, tried-and-true, FREE [recommended lifting routines](https://thefitness.wiki/routines/strength-training-muscle-building/) to choose from. I like these routines vs googling something random because these are routines many, many people in various subreddits are doing and have done in the past that can help answer any questions you might have. It's nice to have someone else that is doing or has done the program you're running to offer direct advice from their experience. But you can just google other routines if you want. Just make sure it has:\n\n-   1.  Progressive overload\n\n-   2) Structured days to not hit body parts more than 2x/week\n\nIf you're working out at home, check out [this post](https://www.reddit.com/user/GovSchwarzenegger/comments/flz3es/stay_at_home_stay_fit/) from Arnold Schwarzenegger with a detailed bodyweight home routine.\n\nAlso another great [full body workout](https://www.instagram.com/p/CA3ajQZjUTx/) for people at home with no equipment.\n\n## What to eat\n\nAt the end of the day, for 99% of people (various diseases, ailments, and conditions aside), all that matters are Calories In, Calories Out (CICO). This controls weight gain and loss. Lifting heavy weights encourages strength gains or at least strength maintenance in both surplus/bulks and deficit/cuts. But to gain or lose lbs on a scale, the total calories consumed minus calories used and the resulting surplus/deficit are what matters. But how much of what you eat matters...\n\nThere's a lot of suggested science over what to eat, but there are generally sound rules of thumbs to follow which are easily broken down into \"Macros\" for tracking purposes:\n\n-   Proteins (1 gram = 4 calories)\n\n-   Carbs (1 gram = 4 calories)\n\n-   Fats (1 gram = 9 calories)\n\nCollectively, all the macros we consume = total consumption (Calories In). When cutting, it's easiest to cut down fats and carbs. But keep protein high. When bulking, generally you add carbs and/or fats. Protein should always be high; it's what helps build muscle directly.\n\nHowever, *how we feel* when consuming these calories and what we get out of other nutrients is important.\n\n#### Fats\n\nWe all need healthy fats to help regulate hormonal balances. This is usually room-temp fats (think extra virgin olive oil, avocado oil, various nuts, avocados, etc); less important are the fats in meat and dairy products, for example. A general rule of thumb is to aim for at least 30% x total calories for your fats macro. This is the same for cutting or bulking, but when bulking you can increase if you want.\n\nE.g. if you're consuming 2000 calories daily, aim for 0.3x2000 (600) calories to be from fats.\n\n#### Carbs\n\nNext come carbs. Carbs are not evil. They're a tool. Our body prefers and relies on carbs to refuel energy stores. Simple, nutrient-dense carbs are preferred -- not complex or junk carbs. The reason for this is 1) satiation, how long we'll feel full, and 2) other nutrient content. When you can, get your carbs from fresh/frozen fruits and veggies. That will do far more for you than crackers, cereal, donuts, etc. Even though the carbs will be utilized equally, produce holds far more vitamins and minerals that have relevant health and recovery benefits that can't be overstated.\n\nGenerally, aim for 25-45% of your calories to be carbs (depending on cutting/bulking).\n\n#### Protein\n\nGenerally, you want to keep protein fairly high. Anywhere from .75-1+ gram of protein per lbs of body weight. This can come from any source, as our body will utilize them the same. But some sources are preferred, depending on whether you're cutting or bulking. Ideally, aim for now more than 40-50 grams per meal/protein shake and spread out the consumption through the day.\n\nThe remainder of your calories should be protein.\n\n#### Timing\n\nAs carbs are for energy, many people prefer to have more carbs timed around workouts (and no fats during this period) to help boost performance and recovery. If you're going to eat your carbs (e.g. rice and chicken breast), do so about two hours before working out; otherwise, liquid/quickly consumed carbs are preferred (e.g. orange or apple juice). Again, post-workout, get simple carbs and protein into your system via a shake or meal fairly soon. Save fats for well-before or after workouts.\n\n##Measuring success\n\nFirst and foremost, gym progress should always be factored in first. If your routine says X lift should go up Y amount each week, generally you want to be hitting that to know you're on track. If your lift #s are going up according to your routine, you're doing great! If you aren't, there's a breakdown somewhere and you should ask for guidance if you cannot asses the fail point yourself.\n\nSecondly, the weight scale. You want to make sure your body weight is trending in your goal direction. It's ideal to weigh yourself *the same way* every time.\n\nFor example, I wake up, go to the bathroom, and then weigh myself every day for three weeks and then I average my daily changes over those three weeks. I generally aim to gain .5-.75 lbs per week and lose .75-1 lbs per week. If I'm gaining or losing too much, I adjust my macros ~ 250 calories and measure again for three weeks and so on.\n\nDon't get caught up daily changes; I sometimes vary 3-5 lbs between days! Weigh daily for three weeks and average it out. Don't worry about the daily weight, find an average to determine where the trend is taking you and adjust if needed. This will take the annoying variances out of the picture and let you focus on meaningful change.\n\nYou can also measure your wrists, waist, neck, etc, as well as take photos, but that's more preference and not as commonly suggested.\n\n##Bulking and cutting strategies\n\nI've seen people make amazing progress, both gaining and losing weight, in a variety of ways. Ideally, be healthy. Emphasize fresh/frozen fruits and veggies. But, at the end of the day, many approaches work. You can bulk or cut as a vegan, intermittent fasting (\"IF\"), KETO, IIFYM, etc. Many approaches work. They are but tools available to you, so find one that best helps you meet your goal. So choose the best \"diet\" or tool that helps you achieve a goal! If that's keto, great! If that's caveman, awesome. I don't care! Limit your calories in whatever \"diet\" you choose and you'll see results.\n\nIn my opinion, it's better to make *lifestyle* changes that to follow a diet for a short time. So I don't really like \"diets\" per se, but more so recommend eating like an adult and limiting calories. But even still, different tactics can help in that goal, and you can deploy as many or as few as you want:\n\n-   Intermittent Fasting (\"IF\")\n\n-   Tracking macros / IIFYM (If It Fits Your Macros)\n\n-   \"Banking\" calories\n\nI don't buy into the other 'benefits' of IF, but it was a tactic that worked for me. I am a volume eater. I generally eat well, but I like eating *a lot*. So when I'm cutting, my meals were small and sad. The idea behind IF is that you have a short window of time which you eat meals, the rest of the day you fast. Again, all that matters are calories. You can absolutely get fat eating 10k calories in a 5 hour window. So there's no magic in doing this. But for me, doing IF allowed me to have larger, more satiating meals within the \"eating window\" instead of more, smaller meals.\n\nMacros are discussed above, but the idea behind IIFYM is that you've a set # for each macro and, so long as what you're eating fits neatly into the prescribed macro allotment, go for eating whatever you want! And, again, so long as total calories are low enough for you, you will lose weight. But this is [r/BulkorCut](https://www.reddit.com/r/BulkorCut/), not [r/weightloss](https://www.reddit.com/r/weightloss/). People here are also working out. How well you workout, recover, perform, feel, etc is affected by what you eat. So, sure, add in \"fun\" foods sometimes. But don't eat like a child simply because it fit your macros. A safe rule of thumb is to eat \"cleanly\" 80% of the time when bulking, whatever the other 20% of the time. When cutting, I try to eat cleanly 90-95% of the time with fewer treats. What that treat is might change -- some weeks I just want pancakes, other weeks I just want a couple beers. Do what works for you, just do so in controlled quantities.\n\nI liked \"banking\" calories when I knew I had a special event, date night with the wife, party, or whatever where I'd be consuming extra calories. One way to account for that is to deduct an *additional* amount of calories each day leading up to the event, to then splurge on that event. Example:\n\nLet's say my maintenance is 2,500 calories and I'm eating at a -500 deficit, so I'm eating 2,000 calories daily. I want to take my wife out for our anniversary, so the week leading up to our date night I deduct an additional -250 calories each day and only eat 1,750 calories daily. This gives me 7x250 (=1750) \"banked\" calories I can add to my 2,000 calories on our anniversary. Now I can have a nice dinner, dessert, a drink or two, all without blowing my diet out of whack!\n\n##Body fat % (BF%) estimates\n\nEstimating ones body fat % is kind of hard. We can't see how much fat is stored internally around organs; some people store more fat over the abs, some more around their love handles (that's me!), and others in their legs/ass. So it's really hard to tell. There are various ways to scan BF%, but most are imprecise with a +/- 20% variance. In my opinion, the only thing they're useful for is estimating BF% *changes*. Let's say it reads 20% for you; in six months, you try again and it says 15%. You probably lost around 5% BF%, but your actual BF% might be 12%-18%. So it's not a particularly accurate reading, but the rate change is a useful gauge.\n\nThe best ways to learn BF% are via:\n\n-   Underwater Weighing (Hydrostatic Weighing) (1-2% variance)\n\n-   DEXA scan (1-2% variance)\n\nEverything else has huge variance and is only useful for measuring rate of change.\n\n##Differences in males and females\n\n-   Basically, [there aren't any](https://www.youtube.com/watch?v=HToXo6gS7-s)\n\n-   It ultimately comes down to goals and therefore what you're going to emphasize/work towards.\n\n##Useful posts/resources\n\n-   [The Absolute Beginner's Guide to the Gym](https://www.reddit.com/r/Fitness/comments/cg9c8d/the_absolute_beginners_guide_to_the_gym/)\n\n-   [To Bulk And Cut Or Not To Bulk And Cut](https://bretcontreras.com/to-bulk-and-cut-or-not/)\n\n-   [Here is a credible, no BS approach to getting abs](https://www.youtube.com/watch?v=Xsph7_-pizw&feature=youtu.be&t=146)\n\n##People to follow\n\n-   [pheasyque](https://www.instagram.com/pheasyque/) - excellent diagrams, tutorials, and generally great content on how to lift properly\n\n-   [Stefi Cohen](https://www.instagram.com/steficohen/) - 22 world records, doctorate in physical therapy, gym owner, coach. TONS of useful tips, talks, and various informative content.\n\n-   [Brian Alsruhe](https://www.youtube.com/channel/UC8Rt7E2JVz4fPmC8AhjDoaA) - Strongman competitor/gym owner, great content on lift techniques and personally the most beneficial video I've watched on [breathing and bracing](https://www.youtube.com/watch?v=PLHY2-nt-y4).",
        "comments": [
            {
                "comment": "Thank you for this, i needed it at this point in time",
                "author": "jcoolaa"
            },
            {
                "comment": "Please help me!\n\nI have been consistently working out for 8 weeks now, but on the 8th week, I am having a problem.  I work at night, I realise I have headaches at midnight.\n\nMy day to day routine is the same, and I consume three meals a day.\n\nWhat went wrong?\n\nThe solution to my headache is to add another snack at the time of the headache. I usually drink malt drink and oats. (Quite reluctantly, because I do not want to add calories.)",
                "author": "SerenaClover"
            },
            {
                "comment": "Thank you :)",
                "author": "Noctis_22"
            },
            {
                "comment": "Super helpful, thank you",
                "author": "DaDudeNextToYou"
            },
            {
                "comment": "This post is soo helpful ❤️",
                "author": "Frhn7ra"
            },
            {
                "comment": ">\tFor example, I wake up, go to the bathroom, and then weigh myself every day for three weeks and then I average my daily changes over those three weeks. I generally aim to gain .5-.75 lbs per week and lose .75-1 lbs per week. If I’m gaining or losing too much, I adjust my macros ~ 250 calories and measure again for three weeks and so on\n\nHow does creatine factor into this .5-.75 weight gain? I just started working out, started taking 3g of creatine every day, and slightly upped my calories. How much weight could the creatine (with water) add in itself? Should I take that into consideration and allow for more weight gain? Or still .5-.75?",
                "author": "germanthoughts"
            },
            {
                "comment": "Need a routine that ONLY has these 7 movements: squat, bench, deadlift, bb row, ohp, pull-ups, and dips.",
                "author": "Young_lad827"
            },
            {
                "comment": "Is a weight gainer with carbs a clean carb?",
                "author": "XXxsicknessxxx"
            },
            {
                "comment": "\"Any higher BF% and your body tends to prioritize fat storage vs muscle gained from bulking.\"\n\n&#x200B;\n\nCan someone please link some evidence?   \n\n\nSpeaking as someone who rarely dips below 20% and just prioritizes strength.. Feel like Im huge and still keep building muscle...",
                "author": "None"
            },
            {
                "comment": "Is it possible to gain strenght without adding weight but instead adding repetitions?\n\nYes or no would be a proper answer.\n\nThank you in advance.",
                "author": "danielm316"
            },
            {
                "comment": "I would like some help figuring out my maintenance calories.\n\nI went from 285 to 125 in 18 months. My diet consists of protein and fat.\n\nI lift weights 3 days a week and do jiujitsu 5 days.\n\nI don’t want to gain weight, at all. But I wouldn’t want to lose weight.\n\nCan someone help me figure out how many calories I can consume to stay the same weight?",
                "author": "thedudesteven"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "[deleted]",
                "author": "None"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "Excuse me. Im extremely weak im 15 years old and i cant do a push-up or a pull-up and I own no weights is there anything i can do to get stronger?",
                "author": "Comprehensive_Turn98"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "Very helpful, Thank you!",
                "author": "Convocei"
            },
            {
                "comment": "[The best keto you have to buy](https://weightlossfastusa1.blogspot.com/2021/07/apple-cider-vinegar-capsules-plus-keto.html)",
                "author": "Lablu123"
            },
            {
                "comment": "Hello! I'm kind of in a pickle and I need some guidance. I was 248lbs, 6\"4, and then I hit a rough patch and went down the wrong path and long story short, I got involved with drugs. I am currently 21 months clean and back into working out, however I am unable to gain weight back as my appetite is slim to none. Are there any preferred supplements to help me gain back some weight? 201lbs don't look too healthy on a 6\"4 22 year old. Thanks for the help!",
                "author": "UndisputedGOAT18"
            },
            {
                "comment": "Thanks",
                "author": "FearlessWillow9069"
            },
            {
                "comment": "Thank you for sharing detailed Information.",
                "author": "delamiyajoy"
            },
            {
                "comment": "Just one question, how long should the cut/bulk cycles last? Just until you reach the recommended BF %?",
                "author": "Hulque94"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "\"You can't gain new muscle on a cut\"  \nThat's false. The guy at Mind Pump Podcast consistently say you can. It comes down to triggering the muscle-building cycle in your body + enough protein.",
                "author": "masterz13"
            },
            {
                "comment": "What a wonderful guide.",
                "author": "None"
            },
            {
                "comment": "One of the most insightful post I have read on some time. Great work",
                "author": "besavecd"
            },
            {
                "comment": "How do I know my body fat",
                "author": "Easy-Soup140"
            },
            {
                "comment": "Guys this is the site I get all my work out equipment!!! https://popularbrand.store",
                "author": "DallasBeast"
            },
            {
                "comment": "Thanks!",
                "author": "None"
            },
            {
                "comment": "Hi friends, \nI’ve been doing PPL with heavy weights for a year and a half now. Been watching my nutrition, been doing progressive overload, everything good. \n\nHowever I feel like I started lifting weights because I’m 31 and was at a job desk since my twenties. Wanted to be in good shape and to find a functional body again. \n\nHowever, the more I’m lifting the more I feel stiff (been doing yoga and mobility routine for 2 months now) but still, this is not what I was really after. I really want to find a functional body again. Be able to lift somebody hurt and to carry him for 200m (I’m a former soldier so I still live in that fantasy). Being strongman or Arnold is nice but if your body is dogshit in terms of usefulness then I feel like it’s not for me. \n\nWhat should I do then? Should I try bodyweight workouts? Should I start calisthenics with some app like freeletics? If I keep my nutrition like that (high protein) will I lose muscle? \n\nThanks and have a great day",
                "author": "Downtown_Emotion8996"
            },
            {
                "comment": "God resisteth the proud he giveth grace (: that which is not deserved and yet given anyway,) to the humble. \r  \nLove Jesus, read the KJV and pray for wisdom, seek God and his sweet amazing grace.",
                "author": "DaFunkyCake"
            },
            {
                "comment": "I usually bulk in the colder months where I live and cut during the spring and summer",
                "author": "anthonyfern18"
            },
            {
                "comment": "I am 14, male, 5'7 and i weigh 59kg. I have already lost a lot of weight, before i was fat and i weighed 75kg. But now i am skinny fat. I have love handles, and man boobs that i really want to get rid of. What should I do?",
                "author": "Due-Basis973"
            },
            {
                "comment": "When it comes to weight management, it's important to assess your goals. If you want to gain weight, focus on consuming more calories than you burn through a balanced diet rich in healthy fats, proteins, and carbohydrates. Incorporate strength training exercises to build muscle mass.",
                "author": "yuvaap"
            },
            {
                "comment": "I didn’t wanna make a whole post since idk how people will take it, I’m fat and I was 300 at 14 then I went to 160 at about 22. 30 now and I’m sick of this, sick of the cycle and I really want to be healthy I can’t say I was healthy at 22 I just stopped eating mostly, I want some advice and info to get in shape. I’m inflexible and fat I won’t say otherwise and I’m tired of it, if it helps I’m 5 11 and I’ll be turning 30 soon.",
                "author": "TheBrave-Zero"
            },
            {
                "comment": "should i take creatine?",
                "author": "SMALL_NIGA_PEN"
            },
            {
                "comment": "I'm wanting to put on lean mass, I am 26M, 5'10, 77kg (170lbs) and workout 5 times a week. I've calculated that I need around 3050 calories made up of 440g carbs, 170g protein, 68g fats. Does this sound right",
                "author": "Brumbies5"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "Thanks for you sharing. 😊",
                "author": "Top-Haill-8657"
            },
            {
                "comment": "Thanks sharing.🥰",
                "author": "Patricia881020"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "\n\nI am 130.8lb, 5’ 1” and I have a chubby body and some mean love handles, I want to get a lean body (I don’t care about show off muscles, just being skinny and replacing fat with muscles). I looked at the guide pinned to the top of the sub, but does anyone have some good ideas on what workouts to do, also I don’t know what my daily caloric intake should be because I am below the 18yr old limit most calculators have unfortunately.",
                "author": "Halo3-ODST"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "How many calories is your caloric deficit?",
                "author": "lennarn"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "That is a very general question. What about frequency, goals, duration, etc?",
                "author": "lennarn"
            },
            {
                "comment": "The answer is it depends on what type of strength you want to gain. You get better at what you do, and if you want to get better at doing a lot of repetitions, then that is the way. If you want to lift heavier weights you must at some point lift heavier weights.",
                "author": "lennarn"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "This is really isn't any advice and it's also a very late response. But, one of the listed people in this article is Brian Alsruhe. Brian suffered from incredibly life threatening worms that caused him to puke up to 50+ times a day, chronic body fatigue, chronic headaches, mini seizures from time to time, perfuse sweating at times, and one horrible seizure and sweat episode. He had this for almost 10 years and continued to be one of the fittest and strongest people out there. If you're wondering, he got worms in his body from working in special forces in third world countries. After countless doctor visits, Mark Bell arranged for him to meet some shady doctor; the shady found the worms and said he would have died years ago if he wasn't such an incredible athlete. In conclusion, if he can do it, you can. :)",
                "author": "MergeIntoTheFray"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "Try making a thread about it, and you will probably get more replies. 😊",
                "author": "lennarn"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "If you want a program that leaves you with the ability to perform everyday while still gaining strength and endurance, I recommend you to take a look at tactical barbell ( r/tacticalbarbell ). It is very popular with military and law enforcement.",
                "author": "lennarn"
            },
            {
                "comment": "Your weight is about calories, not about training. Focus on what and how much you eat.",
                "author": "lennarn"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "To update this. I need to take something at midnight! So I chose oats and fibre drinks to make myself feel better.  I am not sure if I was a sugar deficit, but I felt comfortable if I take something sugary immediately.  However, it would defeat the purpose of my workout. I am not sure at this point.",
                "author": "SerenaClover"
            },
            {
                "comment": "On average I burn 1899 cals per week.  I consume on avg 1500 cals per week for 8 weeks.",
                "author": "SerenaClover"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "Indeed. Very helpful.",
                "author": "DaDudeNextToYou"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "Thank you, then I am walking the right path.",
                "author": "danielm316"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "[removed]",
                "author": "None"
            },
            {
                "comment": "Do you mean per day?",
                "author": "lennarn"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "Due to spam we have restricted posting rights. Posts and comments are manually approved as moderators' time permits. Your account is too young. (Less than one day old)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "Approximately yea",
                "author": "SerenaClover"
            }
        ]
    },
    {
        "title": "Why am I gaining weight?",
        "content": "F/26 here. In 2020-2022 I weighed about 124-131 lbs. I was mentally in the worst place and not eating much as well as not working out consistent or intensely. As of the end of March 2024, I began working out 6-7 times a week consisting of a cycle of 7,000-14,000 steps, lifting, legs, and infrared sauna. I burn anywhere from 300-700 calories a day. I have never been this consistent in my life at the gym. About 5 months into this exercise regimen, I am at 138-140 lbs. Some of my pants are more snug now in the thigh and butt area. My diet is excellent and at or under 2,000 calories a day. I’ve been doing much better mentally too. Why am I gaining weight?",
        "comments": [
            {
                "comment": "Any chance it is mostly muscle gain? How do you feel physically lately?",
                "author": "Sufficient-Union-456"
            },
            {
                "comment": "Muscle is heavier than fat.",
                "author": "makethatMFwork"
            },
            {
                "comment": "well, if you weren’t eating much before and you’re eating consistently now, your body is likely adjusting to that - but it’s likely a lot of muscle. the amount of weight you’ve gained seems healthy and consistent with a slow muscle gain (and maybe a bit of fat, but i wouldn’t worry about that if you’re feeling much better and energetic)",
                "author": "ytowndebate"
            },
            {
                "comment": "You're eating more than when you were depressed",
                "author": "buttbrainpoo"
            },
            {
                "comment": "Thighs and butt are snug... you grew muscle mass.... you did the damn thing!",
                "author": "mer_made_99"
            },
            {
                "comment": "That’s muscle baby! Good job!",
                "author": "SilviusSleeps"
            },
            {
                "comment": "Muscles that workout retain more carbs and water",
                "author": "NeoKlang"
            },
            {
                "comment": "You're eating more than You're burning so you're gaining weight \n\nIf your goal is to build muscle then a calorie surplus paired with hard training will fuel that growth\n\nIf your goal is to lose fat you need to be in a calorie deficit to cause the body to bridge the gap between intake and output with body fat\n\nRead the below links and follow the one that fits your goal\n\nhttps://thefitness.wiki/weight-loss-101\n\nhttps://thefitness.wiki/muscle-building-101",
                "author": "Ballbag94"
            },
            {
                "comment": "Weight is a good thing if it's muscle. You are working out quite a lot, don't sleep on having good quality rest days (pun intended)\nProper sleep and rest is essential.",
                "author": "SellUnfair2796"
            },
            {
                "comment": "Do your clothes fit better? Also, you could use a tape measure around parts of your body. That would say if you're getting leaner also. Good job on the exercise! You're on the right path. Always trust the process.",
                "author": "Smiffoo"
            },
            {
                "comment": "The scale is a number that's it. You feel healthy and fit. THAT'S what matters. Sounds like you've just put on lean muscle, which weighs more than fat. Be proud of the results your hard work has produced!",
                "author": "Sobeshott"
            },
            {
                "comment": "Calorie surplus. If you can find access to one, it might be good to get an In-Body machine test or the equivalent of to see what your BMI and Body Fat % is. You could be growing lean muscle, but maintenance might be closer to 1700-1800 calories per day (pure guess, need an online calculator to see). It also depends on your macro split. If protein is high, that could also help contribute to muscle gain. It’s easy to overeat a few hundred calories a day by accident if you’re not weighing food as well. Best bet would be to consult a nutritionist or a trainer to get a better estimate of your body composition.",
                "author": "No_Branch8192"
            },
            {
                "comment": "Muscle is dense and heavy.  Additionally, bone density is real and exercise helps develop it.  It'll weigh more, but you'll be glad you developed it when it starts decreasing later in life.",
                "author": "Red_it_stupid_af"
            },
            {
                "comment": "I would think your body specifically needs less calories than you originally thought or your eating calories you didn’t realize you had been eating. Your body by itself burns roughly the same amount of calories whether you exercise regularly or not.",
                "author": "Alexlikestheshow"
            },
            {
                "comment": "Because you’re in a calorie surplus",
                "author": "RedditAwesome2"
            },
            {
                "comment": "Lean muscle mass probably",
                "author": "cbh1997"
            },
            {
                "comment": "Much stronger and energetic",
                "author": "infjqueenofintrovert"
            },
            {
                "comment": "I think you are probably putting on lean muscle mass. Especially if you are feeling stronger. Sometimes we do not like the number on the scale, even if we are feeling better.",
                "author": "Sufficient-Union-456"
            }
        ]
    },
    {
        "title": "Recommend one pre workout and why!!",
        "content": "i've been doing a shit ton of research on important ingredients for pre workouts and i've found a lot of different brands that i wanna buy from but i don't wanna waste my money. I see and hear great things about the Raw Thavage and Gorilla mode pre workouts so as of tn im between them. I thought id come here and ask to get everyone else's opinions because i think thats important. Thanks in advance!!!!",
        "comments": [
            {
                "comment": "**Hey, thanks for making a new post!** Please be sure to assign your post with **flair** for the best support! Also, check out **[this post](https://www.reddit.com/r/workout/comments/noyv6p/do_you_need_to_gain_weight_lose_weight_or/)** to answer common questions.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ]
    },
    {
        "title": "Losing fat vs. losing weight? Is it a different approach?",
        "content": "Is there a different approach to losing fat as opposed to losing weight? It seems the cardinal rule when it comes to building muscle/losing weight is \"calories in, calories out\", which makes sense. I'm 5'11 170 lbs but have significant body fat. From photos I see online, I'd say probably \\~30%. I started lifting (compound movements) 1.5 months ago so I'm a total beginner, and don't expect to be muscular at this point. I have just added LISS cardio which I plan to work up to 6 days a week.\n\nI don't have an \"issue\" with my weight. 170 seems about the perfect weight for me and my height. I've been counting calories and get  \\~1g per lb of my weight every day. But should I be more concerned about the fat intake?\n\nI lost 70 lbs. recently, solely focused on carbs. But now I don't really need to lose weight, I need to lose fat. From what I've read, people on cuts/bulks don't seem to worry too much about the fat intake as long as there is a deficit/surplus and you get sufficient protein. I'm not eating crap but I'm wondering if I should really hone in on low-fat foods as well? It's kinda tough to get enough protein and also keep it low fat. Thanks for any tips!",
        "comments": [
            {
                "comment": "If you eat a calorie deficit while eating enough protein (0.8 to 1.0 g per lb) and weight train you will lose fat while maintaining muscle.",
                "author": "Traditional-Leader54"
            },
            {
                "comment": "1) the more you do weight training, the more you will gain muscles and you will increase your muscle mass as percent of your body weight \nSo if your weight stays the same , you should see a shift from fat to muscles\n2) to allow your muscles to recover and grow, you need to make sure you consume enough protein \n3) fat has a high calorie content so people who are training hard will add fat to get to the calories needed.  You also need fat to stay healthy \nI eat nuts which contains healthy fats and allow to get a high calorie.  I avoid bacon and other high fat meat as those fats are the more unhealthy kind\n4) critical with weight lifting is that you have to challenge yourself \nI do set of 10, then 8 and 6.  I don’t want to be a bodybuilder but still want to be able to grow strength \nDo you have targets in mind for example squatting at 1.25 body weight?",
                "author": "Competitive_Shock_42"
            },
            {
                "comment": "Thanks. I definitely am focused on lifting and getting enough protein.   \nRegarding you answer #3- maybe I need better sources of fat. I have 2 eggs and sausage with avocado for breakfast, but I know the sausage is high fat. I should probably focus in on more lean meats and nuts.   \nAnd #4- yes I'm following basically a greyskull program. I do have targets in mind and keep track of my progress. I've been improving which is good. Though honestly the targets are a bit secondary. The way I see it, the strength will come in time- it will take many months and years to build that up. In the meantime, I just want to lean out and have some muscle to show, however \"weak\" I am comparatively. I don't expect to build too much strength right now as I am keeping myself on a calorie deficit (while still getting enough protein). I'm keeping the same lifting program 3x a week of compound lifts. I am focusing on progressive overload, but right now I plan to cut to maybe 160 and at least have a baseline of lean muscle to build from. I had been bulking but then I learned that if you are already high bodyfat, then the body tends to keep even more fat. So I'm trimming down again. I got down to 155 a couple of months ago so 160 is doable.",
                "author": "Phelpsy68"
            }
        ]
    },
    {
        "title": "Bulk&Cut for women",
        "content": "Hey, kind of new to the entire bulk and cutting life for women. I have been on a cut for a month (almost) and wanted to know how and when to transition to a bulk. I want to stay small in fat mass yet strong and lean. ",
        "comments": [
            {
                "comment": "Well I don't know what to say except you should look into what exactly bulking is. Because I don't think that what you are aming for is quite right. If you start a bulking diet you just have to get a bit fatty. \n\nIf you want you should research an alternative called maingaining. Hope this helps.",
                "author": "celinapolir"
            }
        ]
    },
    {
        "title": "How to become a machine?",
        "content": "Sup guys! I hope everyone is fine.\nFirst of all, this is the account where I search my weird stuff and english isnt my main language, so sorry about the errors.\n\nRecently, I've been watching a lot of things involving revenge. The MCs passed through some tragedy and then they train to get their revenge, and that's where is my question: How should I train to be like them?\n\nI don't wanna make bad stuff. I just like the idea to transform my body in a machine. To be able to fight, to run, to shoot, etc...\nI tried to serve to the army in my country, but I didn't get called and dont wanna go through a militar career. I just wanna the training.\n\nObs: I was that kid who instead watched cartoons, I was watching Discovery and shows of Bear Grylls (don't know the name in English, but in Portuguese is \"A Prova de Tudo\")",
        "comments": [
            {
                "comment": "Movie are fiction. If you want to learn how to fight, then learn how to fight. There's no hidden secret of training with a mysterious master that teach you to be a \"machine\" by slapping water.",
                "author": "Azod2111"
            }
        ]
    },
    {
        "title": "Workout tips for a trans man?",
        "content": "I've been looking at lots of fitness videos and such online and I haven't really found any trying to get a rectangle body shape instead of get rid of it, I'm a trans man with a pear shaped body and I want to lose some weight especially in my thighs and ideally look more boxy and thin if that makes sense, does anyone have any tips? (Just for info, I've been eating around 15k cals and trying to be more healthy with food, doing pilates every morning, and walking around 8-10k steps a day.)",
        "comments": [
            {
                "comment": "**Hey, thanks for making a new post!** Please be sure to assign your post with **flair** for the best support! Also, check out **[this post](https://www.reddit.com/r/workout/comments/noyv6p/do_you_need_to_gain_weight_lose_weight_or/)** to answer common questions.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ]
    },
    {
        "title": "Any workout tips for a trans man?",
        "content": "I've been looking at lots of fitness videos and such online and I haven't really found any trying to get a rectangle body shape instead of get rid of it, I'm a trans man with a pear shaped body and I want to lose some weight especially in my thighs and ideally look more boxy and thin if that makes sense, does anyone have any tips? (Just for info, I've been eating around 15k cals and trying to be more healthy with food, doing pilates every morning, and walking around 8-10k steps a day.)",
        "comments": [
            {
                "comment": "**Hey, thanks for making a new post!** Please be sure to assign your post with **flair** for the best support! Also, check out **[this post](https://www.reddit.com/r/workout/comments/noyv6p/do_you_need_to_gain_weight_lose_weight_or/)** to answer common questions.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "There's not anything you can do about your default anthropometry or fat distribution. You can, however, to an extent build muscle in certain spots - and in that light, I'd start with a shitload of upper body volume. Big, compound movements. Bench, incline bench, chinups, rows, 3-4 sets of each, 2-3 times per week. Go heavy, go hard.\n\nAlso, your test levels will make or break those gains.",
                "author": "C9Prototype"
            },
            {
                "comment": "Definitely work on getting some arm and upper body strength. You can't spot reduce fat but building you upper body and abs/core will make you look more rectangular and to a certain point muscles will make you thinner/more toned. I'd avoid doing too much leg strength also, you can't spot reduce fat but you can build muscles. To see if your thighs are big mostly because of fat or muscle, try to flex your muscle as much as possible, pinch your thigh and feel how much of it is fat. If it's mostly muscle you might want to not do leg focused workouts. For a more boxy stomach, look into working the obliques as well as general core work. Also how tall are you? Because if you're short that might affect things as well (am a shortie so know the feeling).",
                "author": "Brittneybitchy"
            }
        ]
    },
    {
        "title": "Advice on exercises and diet for muscle growth ",
        "content": "I have been working out before but not that intensive and mostly just cardio. I wanna gain some muscle now and have some abs. The thing is I have strength without definition in my arms, I mean it's mostly grip strength and good back from bouldering.\n\nI am sporty active and fit, but have no muscle definition, that said I'm not very thin with chicken arms either. Currently I have a flat tummy, not much fat to burn there now.\n\nMy legs are pretty good need not that much work, I run, walk and hike a lot. So need to focus on upper body.\n\nThe goal is not to be super bulky but have an athletic body, coz I don't wanna affect the sports I do (Climbing, mountain sports, etc.)\n\nSo any tips??",
        "comments": [
            {
                "comment": "**Hey, thanks for making a new post!** Please be sure to assign your post with **flair** for the best support! Also, check out **[this post](https://www.reddit.com/r/workout/comments/noyv6p/do_you_need_to_gain_weight_lose_weight_or/)** to answer common questions.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ]
    },
    {
        "title": "What workouts would be good for a guy to build a butt? ",
        "content": "I lost a bunch of weight now have no ass. I can't keep my pants on even with a belt lol. My legs are solid muscle too. Just looks for some recommendations ",
        "comments": [
            {
                "comment": "**Hey, thanks for making a new post!** Please be sure to assign your post with **flair** for the best support! Also, check out **[this post](https://www.reddit.com/r/workout/comments/noyv6p/do_you_need_to_gain_weight_lose_weight_or/)** to answer common questions.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "I typically alternate leg day between dead lift and squats, 6 sets of one or the other. Add some sets of walking lunges while holding dumbbells. This is a solid leg workout hitting all areas, plus core and lower back and especially GLUTES.",
                "author": "Illustrious-X"
            },
            {
                "comment": "Sumo deadlifts, RDLs, Barbell hip thrust, and Bulgarian split-squats (sprinter style to place more emphasis on glutes, rather than quads).",
                "author": "madskilzz3"
            },
            {
                "comment": "Bulgarian split squats and hip thrusts are great for glute growth",
                "author": "no_joydivision"
            },
            {
                "comment": "Kettlebell swings with a heavy bell are good for it.",
                "author": "Tammer_Stern"
            },
            {
                "comment": "Squat RDL Split Squat Calf Raises 3x8-15r twice a week",
                "author": "roundcarpets"
            },
            {
                "comment": "Ditto",
                "author": "Sufficient-Union-456"
            }
        ]
    },
    {
        "title": "Is this workout good for a 15 year old boy?",
        "content": "Hello, I started yesterday with these workouts but I don’t really know if their gonna benefit me or not and can I add more or not if its not good \n\n- 3x8push ups(24)\n- 3x15 squats(45)\n- 15lying leg raises\n- 15shoulder taps (each side)\n- 15 lunges (each side)\n- 3x6crunches(18)\n",
        "comments": [
            {
                "comment": "Hei, what are your goals?\nThe workout plan you just gave us doesn't really make sense to me. You training chest, legs and abs all in one day with huge volume makes no sense imo\nHowever if it's your first time ever working out then I don't really take problem with this\nI started with simple plans like this too but I was 12 with no access to a gym. At 15 you may have access to a gym which is better, but although this isn't the best. It's a good start for building some foundation In abs and legs. I suggest you add something more for your upper body, like easier pull ups variants.",
                "author": "Guilty_Ad_349"
            },
            {
                "comment": "Good enough for his routine health",
                "author": "Resident-Nectarine91"
            },
            {
                "comment": "yeah tbh its my first time working out and I don’t really know if its good thats why I’m asking and I don’t really have any equipment so can you give me a good workout schedule if u have experience, I really want to improve my body",
                "author": "Life-Technician-3093"
            },
            {
                "comment": "Alright that makes sense, if you have time to workout 5 times a week then you can do something like this.\n(You choose sets and reps for yourself, because I don't know how strong you are)\n\nMon- upper body\n\nPush ups (idk how strong you are)\n\nBicep curls with random safe household item. Put heavy things in a backpack and just curl it. (not too heavy ur new to this)\n\nPull ups, if they are too hard you can do table reverse row.\nIf not then superman pull or holds are okey.\n\nDips if you have access to a park/playground\n\nMilitary press (safely) with a random obj or side delt raise with   a random object.\n\nTuesday - legs\nSquats 3x\nLunges 3x\nReverse lunges 3x\nSide lunges 3x\nCalv raises 3x \nGlute Bridges 3x\n\nWednesday: find a random beginner ab workout on YouTube and do it?\nTake notes from what you like to eventually make you own plan in the future.\n\nThursday: same upper body as Monday.\n\nFriday legs again\n\nSaturday abs again or go on a run (cardiovascular health matters)\n\nSunday rest.\n\nThe idea here is to just build foundation and strength whilst mastering basic movements. This will help you build the muscle connection, strength and what you need to transition over to a gym once you are 16 years old. After getting a gym then you should ditch some of these exercises for compound exercises with weights such as barbell squats and machine exercises, such as leg extensions, lat pull downs, Smith machine bench etc.",
                "author": "Guilty_Ad_349"
            },
            {
                "comment": "Is it good like this? I put cardio every 2 days after workout, please tell me if there is something wrong\n\nSaturday - upper body\n- Push ups 3x7\n- Bicep curls 3x10 each hand\n- Reverse row 3x8\n- Dips 3x8\n- Military press 2x9\n\n- After workout 20 mins walking 10 mins jogging\n\nSunday - legs\n- legs Squats 3x8\n- Lunges 3x8\n- Reverse lunges 3x8\n- Side lunges 3x8\n- Calf raises 3x20\n- Glute Bridges 3x15\n\nMonday - abs \n- Reverse crunch 3x8\n- Sit up 3x8\n- Climber 35 seconds\n- Knee to elbow crunch(30 sec each)\n- Leg raises 3x10\n- Plank Shoulder taps 40 secs 2 sets\n- Plank hold until failure \n\n- After workout 20 mins walking 10 mins jogging\n\nTuesday - upper body\n- Push ups 3x7\n- Bicep curls 3x10 each hand\n- Reverse row 3x8\n- Dips 3x8\n- Military press 2x9\n\nWednesday - legs\n- legs Squats 3x8\n- Lunges 3x8\n- Reverse lunges 3x8\n- Side lunges 3x8\n- Calv raises 3x20\n- Glute Bridges 3x15\n\n- After workout 20 mins walking 10 mins jogging\n\nThursday - abs\n- Reverse crunch 3x8\n- Sit up 3x8\n- Climber 35 seconds\n- Knee to elbow crunch(30 sec each)\n- Leg raises 3x10\n- Plank Shoulder taps 40 secs 2 sets\n- Plank hold until failure \n\nFriday - Rest day",
                "author": "Life-Technician-3093"
            },
            {
                "comment": "Yeah this is very solid, a great plan. I've been there. When it comes to cardio it's better to do them at least multiple hours after you strength training session, not right after or before.\nRunning 2x a week is a good start so I'd say you can spend Friday on a brisk long jogg  (don't if you feel sore).\n1. Start with 2 Running sessions one with a shorter but intense intervals and one with an easy jogg long distance jogg.\n\n2. Don't run on your legg day to avoid injury and impacting your strength. \n\n3. You can run on upper body day. Hours after your session or before.\n\n4. If you have enough time you can do upper body + abs all in one day. This will leave 2 or one day empty and so you can turn that or those empty days into running days. On what was supposed to be abs day.\n\n5. Stat with 2 and after 1 month increase run sessions to 3 per week and after that increase it to 4 after maybe 2-3 month of 3x. This will give you body ample time to adapt thus reducing chances of injury or overuse.\n\nSorry for the horrible grammar, I feel super lazy today. But, I Wanna help you as I once was a kid too trying to get fitt but never got the help or support I needed. Good luck.",
                "author": "Guilty_Ad_349"
            }
        ]
    },
    {
        "title": "Question about diet",
        "content": "i have a diet plan i put together, at the very bottom. Im just wondering if its safe with the calorie and protein count. Ive never been into body improvement until now, and just want to know what I can change. I do understand 1500 cals can be a dangerous deficit but amounts can be changed once I better understand what i personally need. Taste is not a concern.\n\n  \nDiet:\n\nHard Boiled Egg VitD - 80 cal\n\nBroccoli VitC VitK - 90g 30 cal \n\nBeef Liver VitA VitB6 - 100g 150 cal - 23g Protein\n\nChicken Breast VitA VitB12 VitB6 Vitb3 - 140g 230 cal - 43g Protein\n\nSpinach VitE - 30g 7 cal\n\nBrown Rice VitB3 - 195g 216 cal\n\nFlaxseed Omega3 - 1tbsp 55 cal\n\nChia Seed Omega3 1oz 138 cal\n\n1% Milk 2cups - 206 cal - 8g Protein + 2 Scoops Whey Protein - 360 cal - 60g Protein\n\nPlenty of water throughout the day / Tied with workout routine as well\n\n",
        "comments": []
    },
    {
        "title": "I don’t know what the “sets”, “reps”, and “rests” mean.",
        "content": "I apologise in advance because this is a very stupid question, but at 16 years of age I have decided that I should work out. I keep hearing the same words repeated, but never explained.\n\nFor example, people will say “do 3 sets of 10 reps with 30 seconds rest” and I don’t fully know what that means.\n\nThe past two days i’ve been doing the following: 10 bicep curls, 10 front shoulder raises, 10 hammer curls, 30 second rest, and repeat that twice more.\n\nI know what i’m doing is not effective but honestly I just want to get a routine down first, and anyways I still don’t know what these terms mean.",
        "comments": [
            {
                "comment": "3 sets of 10 reps with 30 second rest means. . . You do 10 repetitions of the exercise 3 separate times, with a 30 second rest in between.  \n\n So, 10 bicep curls, rest 30 seconds, 10 biceps curls, rest 30 seconds, 10 bicep curls, rest 30 seconds. That’s 3 sets of 10 reps with a 30 second rest.",
                "author": "10lbMustache"
            },
            {
                "comment": "A rep is a repitition. Pick the weight up, put the weight down. That's a rep.\n\nA set is a collection of repetitions . Pick the weight up, put it down. Do that 10 times (repititions) and you did a set of 10 reps.  \n\nNow take a rest break.\n\nDo those 10 repetitions again, you've now done 2 sets. \n\n  \n[https://www.boostcamp.app/programs](https://www.boostcamp.app/programs) is a great place to start looking for a well designed and strucutured program.",
                "author": "BigNastyOne"
            }
        ]
    },
    {
        "title": "Skeptical about my new workout plan",
        "content": "Hey guys, i was following Push pull legs since last 6 months but i have a knee injury now and i wont be able to do any leg workout for next 3-4 months atleast except light walking. So to avoid missing on daily activity for both the leg days i am thinking of altering my plan to go still go to gym 6 days a week. Here’s what i am thinking: \n\nMonday - Back + Forearm\nTuesday - Bicep + Tricep\nWednesday - Chest + Shoulder\nRepeat for Wed Thurs Fri\nSunday Rest\n\nDo you think this will be a good idea to change to this for 3-4 months?",
        "comments": []
    },
    {
        "title": "Could use some help coming up with an ideal workout split",
        "content": "so ive tried a few workout splits and none of them seem to hit right for me, including PPL (3 per week, and 6 per week), bro split, and a few others.\n\n\nideally for me, the split should:\n-train small muscles twice a week (biceps, triceps, shoulder, calves)\nand large muscle groups once a week (back chest, legs)\n-i dont mind if the split has an atypical non-7 days cycle\n- i cant train front delt after chest, and cant train biceps or rear delt after back day (and vice verse)\n-going to the gym 4 days a week is doable, but any more than that and i'll probably run into consistency issues.\n\nso the split i came up with:\n \n1- push (mostly chest) + triceps, front and side delt\n2- pull (mostly back) + biceps, rear delt\n3- legs\n4- rest\n5- arms and shoulders\n6- rest / home abs + calves workout\n7- rest\n\ni would appreciate if someone has some insight to what im missing or any adjustments / recommendations",
        "comments": []
    },
    {
        "title": "Beginner workouts to do at home?",
        "content": "I'm trying to become fitter and healthier for myself and I would like to know if there are any good workouts I can try at home (preferably no equipment required). Eventually I'd like to get some muscles and stuff but for now I want to focus on losing some weight. I eat pretty well with a good amount of protein and fruits and vegetables. I am F14 5'6 and 165 lbs.",
        "comments": [
            {
                "comment": "Walk. Just walk consistently for an hour a day. It’s good for your mental health to get out and you’ll lose weight",
                "author": "Fragrant_Pear3208"
            },
            {
                "comment": "https://thefitness.wiki/\n\n\nr/bodyweightfitness \n\n\nEat less.\n\n\nEdit: I didn't see your age. Don't change your diet significantly without talking to your doctor first.",
                "author": "deadrabbits76"
            },
            {
                "comment": "Thankyou!!",
                "author": "Mental-Proof-6935"
            }
        ]
    },
    {
        "title": "Not gaining weight",
        "content": "So I'm 6'0 170 pounds and I workout a lot and I can tell I'm making progress but I'm just not gaining any weight which I guess isn't necessarily bad but it's just kinda urking me how many calories and protein would you recommend I intake?",
        "comments": [
            {
                "comment": "**Hey, thanks for making a new post!** Please be sure to assign your post with **flair** for the best support! Also, check out **[this post](https://www.reddit.com/r/workout/comments/noyv6p/do_you_need_to_gain_weight_lose_weight_or/)** to answer common questions.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "How many calories and how much protein are you eating?",
                "author": "IronReep3r"
            },
            {
                "comment": "Take what you're eating and add 200 more. Reevaluate after a week. Not gaining weight?\n\nRepeat until you are.",
                "author": "Frodozer"
            },
            {
                "comment": "You can always add a mass gainer with your protein powder",
                "author": "Katsumirhea11392"
            },
            {
                "comment": "Yo, I feel you. It can be lowkey frustrating to put in the work and not see the scale budge.  Since you're already working out, it's really about dialing in your nutrition. You gotta eat big to get big, ya know?  There are a ton of calorie calculators online that can give you a more personalized estimate based on your activity level and goals. Just google \"calorie calculator for weight gain.\" For protein, aim for around 1 gram per pound of body weight. It sounds like a lot, but it'll help fuel those muscles and support growth. Good luck!",
                "author": "freedom4eva7"
            }
        ]
    },
    {
        "title": "Shocked at my progress",
        "content": "I'm in remission from long covid (after 4 years!) and started working out in June. I can finally exercise without it making me sick. 45/f. \n\nPost exertional malaise is no joke. I was fairly fit before I got covid with daily exercising. Post covid, a 20 minute walk left me bedbound for 6 weeks. It's a vicious cycle - the lack of exercise triggers PEM more easily, so you just spiral down. POTS as well, where I couldn't stand more than a few minutes without getting dizzy. My heart was in tachycardia 20% of the time. \n\nRecovery was long and slow. But eventually I cracked a diet that prevented PEM. Still couldn't exercise comfortably, but I could function without small activities leaving me bedbound. \n\nWithin the last 6-8 months, I found I could cheat my diet and not get sick. Exercise was hard, but it didn't feel like it was killing me any more. Out of shape vs causing muscle damage. I went on a vacation that had a lot of walking (a major achievement in of itself) and decided to build on that success.\n\nI started small, just 15 minutes a day on either my elliptical or rowing machine. My goal was to make it routine, and reduce my heart attack risk. I've been able to increase the intensity, slowly. Just doing what feels right. \n\nI've lost 3 inches off my waist line without loosing weight. My pants are starting fall off me. I'm looking trimmer than I have in years. The edema that is common with POTS is going away. \n\nNever in a million years would I have expected results like this in less than 3 months. It's clear the exercise is having huge impacts on fluid retention. \n\nI think increasing my core strength is helping the most, but frankly, I don't know what to do next.  I still can't do a sit up. And advice on what I should add to my routine?",
        "comments": [
            {
                "comment": "**Hey, thanks for making a new post!** Please be sure to assign your post with **flair** for the best support! Also, check out **[this post](https://www.reddit.com/r/workout/comments/noyv6p/do_you_need_to_gain_weight_lose_weight_or/)** to answer common questions.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ]
    },
    {
        "title": "Help finding a workout plan that fits me...",
        "content": "I (33f) have knee problems. Three years ago, I had knee surgery and the doctor told me I had to stop doing activities with \"high-impact repetitive movements\" (running, jumping, etc.) or else I would need a new knee in like 5 years. Since then, I've probably gained about 30 pounds and my knee still hurts, just not as bad as pre-surgery. \n\nI'm a swim coach, and my daily schedule looks like this:\n\n6:00-7:15 am: Morning high school swim practice\n\n7:30--3:35: School (I'm also a high school teacher) \n\n4:00--6:00 pm: high school swim practice \n\n6:00--7:00: USA swim club practice. (Sometimes this goes until 8 if the other coach is gone. But that's pretty rare.) \n\nMy issue is this. I want to work out, but obviously, my days are very long. This means I can't go to any fitness classes. The no high-impact repetitive exercises rule also restricts the workouts I can do (and my knee still hurts anyway). I would swim, but honestly, by the time all of the practices are over, I either really want to leave the pool or the pool is closed. Plus, swimming isn't a guarantee my knee won't hurt. Sometimes a random kick will hurt, pushing off the wall is always a gamble, etc. \n\nIdeas are welcome. ",
        "comments": [
            {
                "comment": "are you able to do basic barbell exercises in the gym? at the very least, upper body exercises? certain slow and controlled leg exercises (squats, deadlifts, leg curls)? all leg exercises? only certain rehab leg exercises?",
                "author": "accountinusetryagain"
            },
            {
                "comment": "For cardio some heavy-bag workouts could be a good idea. I’d obviously stay away from throwing any kicks, but light movement around the bag plus high intensity punches should be okay.",
                "author": "lordwerwath"
            },
            {
                "comment": "Squats, lunges, and deadlifts are a no. Basically anything that involves impact or weight-bearing knee-bending stuff I can't do. I can do leg curls, but leg extensions are pretty iffy. I guess another big part of it is that I'm scared of screwing my knee up more and needing knee replacement in my 30s. \n\nI'd also like more cardio than weight training, I think.",
                "author": "dbad-j"
            },
            {
                "comment": "I think a lot of lifting woud be the easiest to do since most cardio aside from swimming is pretty much weight bearing.\n\nIf you're saying you want more cardio than lifting because you are prioritizing weight loss your diet needs to be permissive of a calorie deficit in the first place so if you're doing something active i dont think the bottleneck is how many calories you can burn.\n\nIf you just want your heart rate to be high, do some high rep work and superset back to back exercises instead of resting 2 minutes between sets. eg chest supported row 10-15 reps 0-2rir, 30-40s rest, bench press 10-15 reps 0-2rir repeat    \n\nultimately id really hope that there's some light at the end of the tunnel in the sense that thinking of your body as permafucked and incapable of doing some basic movements ever again is probably a pretty bad place to be in psychologically which might even have physical implications. im not sure if there'd be a way but i'm hoping that there might be some physio out there who could find a way to rehab you into being able to do some of this basic stuff again vsjust having to avoid things for the rest of your life",
                "author": "accountinusetryagain"
            }
        ]
    },
    {
        "title": "Help me about diet and gym",
        "content": "I’m 22y, 174cm and ≈ 72kg.\n\nI do bjj 3/4 sessions per week, and I’m always overwhelming with gym sessions and diet and I can’t stay consistent, because I’m always changing strategies.\n\nI want an honest and unknown opinion, should I cut? Should I bulk?\n\nI will try a PPL 1x with 12-16 sets per muscle per week.\n\nSince 3 weeks ago I’m doing 3x full body",
        "comments": []
    },
    {
        "title": "Why have I lost so much squat strength?",
        "content": "I recently took a two week vacation, where I didn't really eat strict. I ate whatever I want and I was definetly in a surplus every day. When i came back and started working out, my back and chest lost 5 pounds which is what usually happens when I take a long break, however my squat went down from 205x3 to 190x4. I thought it was just an off day, so today I hit legs again and i only got 190x4 again, while all my other lifts started increasing. Why is this? ",
        "comments": [
            {
                "comment": "**Hey, thanks for making a new post!** Please be sure to assign your post with **flair** for the best support! Also, check out **[this post](https://www.reddit.com/r/workout/comments/noyv6p/do_you_need_to_gain_weight_lose_weight_or/)** to answer common questions.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "being silghtly uncoordinated, id try 5lb progressions which might be easier than trying to add reps",
                "author": "accountinusetryagain"
            },
            {
                "comment": "I wouldn't call 10lbs losing strength, I'd call it a bad day. You had a two week vacation. The groove is now greased, just move forward from where you are and ignore where you were. Take some weight off and work back up, or just keep on.",
                "author": "gazhole"
            },
            {
                "comment": "i usually do although I can only get like 3-4 if im able to get 6 with my last weight (ie when i hit 190x6 then i move to 195 which is usally 195x3-4)",
                "author": "Quix0607"
            }
        ]
    },
    {
        "title": "Excessive workout",
        "content": "Hello, I’m 19 years old and about 105.1lb I don’t like how my thighs touch and loose thick, I’m almost 5,1 which doesn’t make anything better. I don’t know how I could make my thighs slimmer, but I would love to do any workouts that would help them slim down. I know I have to loose weight overall to get slimmer thighs, so please someone give me some guidance.",
        "comments": [
            {
                "comment": "Running, particularly long distance running, is demonstrably effective at slimming down ones legs. Google pictures of marathon runners and you're going to see what I mean. ",
                "author": "CuteLingonberry9704"
            },
            {
                "comment": "My thighs tined up and got slimmer walking on a treadmill. Speed of 3, incline of 12, for 30 minutes.  Best work out ever.",
                "author": "mer_made_99"
            }
        ]
    },
    {
        "title": "Confused about set ",
        "content": "Suppose my workout is \n\n3x3 squats \n\n3x3 pushups \n\n3x3 lunges \n\nAfter completing first set of squats should I start doing first set of pushups or complete all squats and then go to pushups?\n\n",
        "comments": [
            {
                "comment": "all squats, then the push ups, all the push ups, then the lunges",
                "author": "theseasonfire"
            }
        ]
    },
    {
        "title": "Is 1-2 more reps for every workout is a good progression or is it too slow ?",
        "content": "I'm training with 2-3 sets of 8 to failure for each exercise, and so for it seems to work. I can do 1-2 more reps on my first set each time i workout again. But i wonder if it's enough ? \n\nBasically, every time i can do 8 reps on my first set, I add weight the next session. My volume is not very high, something like 4-6 sets to failure on each muscle. \n\nI was a bit inconsistent these last weeks but usually i plan on doing each (upper/lower) 2 times a week, so every 3-4 days. ",
        "comments": [
            {
                "comment": "That’s a good progression. Wait till you become an intermediate lifter and find that you haven’t gained a single rep in a month!",
                "author": "Capital_Comment_6049"
            },
            {
                "comment": "This would be an extra 52-104 reps in a year. Sounds like more than enough doesn't it?",
                "author": "Frodozer"
            },
            {
                "comment": "That’s fucking impressive. Imagine if this progress stays linear… holy fuck.",
                "author": "ilovechoralmusic"
            },
            {
                "comment": "yes that’s good",
                "author": "roundcarpets"
            },
            {
                "comment": "Thanks, sometimes it feels like it's a bit slow, but i think it's just me being impatient. I also wasn't the most consistent these last weeks, for example i did legs again after 9 days... yiks. And despite that i'm progressing. \n\nI just need to be more steady, patient, and go for my 4 times/week with 2 lower and 2 uppers.",
                "author": "AlmosThirsty"
            },
            {
                "comment": "Thanks man, I think it's just the fact that I start training again a month and a half ago, I doubt it will stays linear",
                "author": "AlmosThirsty"
            }
        ]
    },
    {
        "title": "Is using a pillow instead of an exercise mat not good?",
        "content": "I was starting doing some exercise that asks you to put your knees on the ground, and because when I'm doing it, my knees hurt. Not as in it hurts because of tiredness, but because I wasn't working on a mat, and the carpet irritated my skin and now it hurts. I also find it uncomfortable.\n\nI was thinking of using a pillow, but I wonder if it will affect the exercises in any way. I used a pillow and for some reason, it felt a bit too easy this time, like I didn't got as tired to do the amount of reps I was doing. Maybe I just got used to the exercise, but I'm asking to be sure.",
        "comments": []
    },
    {
        "title": "Am I overdoing it? Target heart rate questions.",
        "content": "I’m a 36 year old male and my weight is usually in the 150-155 lb range. I started working out again at the beginning of this year and have been holding my routine strong for over 7 months now and haven’t felt this good in years (since the last time I was regularly exercising). However, I’ve been monitoring my heart rate closely recently, and I had some questions about if I may be overdoing my exercises.\n\nI exercise everyday of the week and have a target calories burned of 300 per day from exercising regardless of the exercises done. I lift weights 2 days a week and the rest of the week is cardio-type stuff (mostly on the elliptical). My target heart rate from very basic calculations you can find online should be a max of about 185 bpm. During weightlifting I get around 135 bpm average, which sounds about right. But when I’m doing any kind of more intense cardio (I go for about 35 mins) my heart rate is usually in the 165-175 bpm range, which seems high based on what I’ve read. I finish all my exercises feeling great (no gasping for breath or uncomfortable feelings from rapid heart beat) so I didn’t think anything of it until recently.\n\nSo my questions are: am I overdoing it? Is there something else I should be doing? Are the online calculator tools actually accurate or does it vary widely from person to person?\n\nAny advice or insight is greatly appreciated!",
        "comments": []
    },
    {
        "title": "What will happen if I do 100 sit-ups a day?",
        "content": "",
        "comments": [
            {
                "comment": "add in 100 squats,100 sit ups and a 10 km run. And you too can be Saitama",
                "author": "Ok-Key-4544"
            },
            {
                "comment": "You’ll get much better at sit-ups. \n\nYour ab muscles are just like any other muscle group. They need to be trained with progressive overload if you want them to get bigger.",
                "author": "Capital_Comment_6049"
            },
            {
                "comment": "You fly off into the sunset on a magic carpet.",
                "author": "gleekotreeko"
            },
            {
                "comment": "You will be very efficient at sitting up. \n\nDiet and exercise affect lots of things.",
                "author": "bigwavedave000"
            },
            {
                "comment": "You will get very good at situps and your abs + hip flexors will get however endurant they need to make 100 sit-ups no longer a challenge. Or at least much  less of a challenge\n\nIf you’re wondering about negatives, there aren’t any guaranteed issues, unless you never train any other movement or muscle. Might run into imbalance issues but theyd probably be minor",
                "author": "PM__ME__YOUR_TITTY"
            },
            {
                "comment": "You are pathetic, I use to do 400/day.\n\nJokes, although I did use to do 400/day for a while in my teens. It did literally nothing, and sit ups aren't really a great core exercise anyway. Do a proper body weight strength training routine instead and 'graduate' to a gym when you're comfortable/have money.",
                "author": "AioliOrnery100"
            },
            {
                "comment": "Your hip flexors will get tight.",
                "author": "Mitaslaksit"
            },
            {
                "comment": "I used to do 100 situps a day. You can get away with it when youre young but it puts a lot of pressure on the lumbar spine, while its under significant flexion, and thats a terrible combination. Its more than enough to give you back problems later in life. You should look to other exercises that involve the lower back much less such as crunches.",
                "author": "Murky-Sector"
            },
            {
                "comment": "I wouldn’t do 100 a day. If ur gonna work them, train them properly that day and then let it rest and heal for 2days then train again and so on.",
                "author": "Green-Kitchen-4510"
            },
            {
                "comment": "what if you do a proper strength training program tha develops your body as a whole?",
                "author": "StuntMugTraining"
            },
            {
                "comment": "Not that much",
                "author": "BukkakeNation"
            },
            {
                "comment": "thoughts on 100 pushups a day?",
                "author": "SuspectNumber13"
            },
            {
                "comment": "Saitama learned the hard way...",
                "author": "bobbytgk"
            },
            {
                "comment": "Hulk Hogan and Brutus Beefcake will return.",
                "author": "Knightz101"
            },
            {
                "comment": "Take care of your spine and tail bone while you do it\n\ninstead do leg raises",
                "author": "NeoKlang"
            },
            {
                "comment": "one step closer to becoming one punch man",
                "author": "tsazn"
            },
            {
                "comment": "You might notice your abs coming through in about a month",
                "author": "akotski1338"
            },
            {
                "comment": "You’re a moron",
                "author": "UnitedPlantain8044"
            },
            {
                "comment": "But somewhere along the way it could have harmful effects right?",
                "author": "Xzaviertheman4"
            },
            {
                "comment": "Thank you for the tips",
                "author": "Xzaviertheman4"
            },
            {
                "comment": "^[Sokka-Haiku](https://www.reddit.com/r/SokkaHaikuBot/comments/15kyv9r/what_is_a_sokka_haiku/) ^by ^NeoKlang:\n\n*Take care of your spine*\n\n*And tail bone while you do it*\n\n*Instead do leg raises*\n\n---\n^Remember ^that ^one ^time ^Sokka ^accidentally ^used ^an ^extra ^syllable ^in ^that ^Haiku ^Battle ^in ^Ba ^Sing ^Se? ^That ^was ^a ^Sokka ^Haiku ^and ^you ^just ^made ^one.",
                "author": "SokkaHaikuBot"
            },
            {
                "comment": "Just regular situps? Not really.",
                "author": "Sobeshott"
            },
            {
                "comment": "Are you just looking to prove to someone that you’re right? Based off your post and comments it seems like you are all but begging someone to say why doing sit-ups everyday is bad",
                "author": "AlwysProgressing"
            },
            {
                "comment": "Harmful? Why?",
                "author": "Capital_Comment_6049"
            },
            {
                "comment": "good health and may you reach all your goals",
                "author": "Murky-Sector"
            },
            {
                "comment": "Couldn’t it cause back problems in the future or neck problems?",
                "author": "Xzaviertheman4"
            },
            {
                "comment": "Sure. If you’re doing them incorrectly, you could strain your neck and lower back.",
                "author": "Capital_Comment_6049"
            },
            {
                "comment": "you can get serious problems from overly developed abs regardless of the technique.\n\nrectifying the lordosis, exacerbating the kyphosis\n\nrespiratory issues\n\npelvic floor issues\n\nposterior pelvic tilt\n\ncompressed viscera\n\nOBVIOUSLY thie issue is a lack of balance not the situps themselves",
                "author": "StuntMugTraining"
            },
            {
                "comment": "100 sit-ups a day won’t do any of this.",
                "author": "Frodozer"
            }
        ]
    },
    {
        "title": "Newbie here!",
        "content": "I recently started going to the gym. But I have a few questions and I figured I may hear you guys' opinions as well.\n\nShould I do cardio before or after the weight workouts?\n\nShould I do swimming before or after?\n\nIn which order should cardio, weights and swimming go?\n\nThx!",
        "comments": [
            {
                "comment": "lift first. swimming is cardio. follow a proven program",
                "author": "accountinusetryagain"
            },
            {
                "comment": "if done on the same day: weights before, cardio after (swimming counts as cardio)",
                "author": "theseasonfire"
            },
            {
                "comment": "What about treadmill and jump rope?",
                "author": "Aggravating_Chest383"
            },
            {
                "comment": "Treadmill and jump rope are cardio. Same applies.",
                "author": "ToastyCrouton"
            }
        ]
    },
    {
        "title": "How often do you change up your workout routine ?",
        "content": "Cause a personal trainer at my gym told me the body gets use to things quickly so I would have to change up my workouts every couple weeks but I’m just wanting other peoples experiences ",
        "comments": [
            {
                "comment": "Just about never. Been on same routine since 2019. Can't see it changing anytime soon. ",
                "author": "Sufficient-Union-456"
            },
            {
                "comment": "The whole „muscle confusion“ or „you have to shock your muscles by changing everything up“ stuff is bs. You will get the exact same result with sticking to your plan",
                "author": "skip_the_tutorial_"
            },
            {
                "comment": "This only applies when you've plateaued your gains and you're just looking for those tiny 4% increments. If you haven't been training for more than 2 years, keep overloading the same routine you're on. \n\nProvided they hit all the muscle groups in question, you'll grow just fine (provided your sleep and nutrition is in check)",
                "author": "Gentle_Giant3142"
            },
            {
                "comment": "Being used to something doesn't mean you don't make gains from it. When you start a new exercise, some of the initial progression in the exercise is neural adaptation. That isn't the same thing as strength or muscle growth, however. When you swap exercises, you are also losing some efficiency as you neural network/CNS learn new adapatations. Its minor unless you are swapping every week, but there is some impact there. Consistency also allows better progression monitoring. \n\nIn general, joint fatigue or boredome are the only reasons I change exercises. Some people get bored easier and need more frequent change. I also change based on equipment availability, but I have a few go-tos for specific muscle groups. \n\nI'd always recommend minor exercise changes to program changes.",
                "author": "BigNastyOne"
            },
            {
                "comment": "the only way i change it is 1. go heavier or 2. less leg day volume when i’m training for a race",
                "author": "airplanel"
            },
            {
                "comment": "I changed my routine alot as a beginner but now I never change anything unless it's to swap out an exercise for something I think will be better, and even that's still rare.",
                "author": "Apeirophobia69"
            },
            {
                "comment": "I'll change 1, occasionally 2, exercises each workout day of my routine per month. Mostly to prevent my routine from getting stale. If you're happy with your gains and routine though, it's not necessary. \n\n\nA few times a year I may decide to change my goals which could cause me to change more exercises or my overall program, but that's not often. \n\n\nIf youre enjoying the gym and seeing growth, keep it up",
                "author": "Severe-Pattern-1589"
            },
            {
                "comment": "I've been doing the same kind of routine for at least three years now.  Only things that change is the exercise selection for the specific goal if I don't feel like it or the equipment I need is taken, and the rep/sets schema that goes by how I feel that day. \n\n>body gets use to things quickly so I would have to change up my workouts every couple weeks\n\nThis is an extremely stupid take. Do not hire that personal trainer.",
                "author": "Deevimento"
            },
            {
                "comment": "I tend to change it up every 8 to 12 weeks",
                "author": "Exerciseovermeds"
            },
            {
                "comment": "That's bro science. \n\nIncrease reps, weight, or sets, don't change the exercises. How else can you monitor to make sure you are actually improving? \n\nLast workout I did 200 crunches and 200 situps. How many minutes should I hold a plank for today? Who knows. Gotta compare apples to apples.",
                "author": "Eplitetrix"
            },
            {
                "comment": "Change your rep ranges, not your routine if you are hitting the muscles properly",
                "author": "Captobvious75"
            },
            {
                "comment": "Better outcomes are realized by adhering to the same stimulus consistently for a longer period of time.",
                "author": "ProbablyOats"
            },
            {
                "comment": "Every 2 months",
                "author": "bozkurt81"
            },
            {
                "comment": "Every 4-5 weeks",
                "author": "bitter_sweet9798"
            },
            {
                "comment": "U should not be regularly changing up your gym routine. Ive done the same thing for yrs with results. I only just started to strength training again cuz its more fun (hypertrophy got boring after 4 yrs)",
                "author": "Tiny_Primary_7551"
            },
            {
                "comment": "When it stops working or I'm moving into a different focus, for instance when bulking I'll generally run harder programs than when cutting\n\n>a personal trainer at my gym told me the body gets use to things quickly so I would have to change up my workouts every couple weeks\n\nIf they mean changing the program you're running and picking a different one then changing every couple of weeks would be a great way to never make progress\n\nIf they mean making things harder via more reps, sets, or weight then they'd be correct because as your body adapts you need to make things harder\n\n\nPick a program from the link below and just run that for a bit\n\nhttps://thefitness.wiki/routines/strength-training-muscle-building/\n\nAlso read\n\nhttps://thefitness.wiki/muscle-building-101",
                "author": "Ballbag94"
            },
            {
                "comment": "It's crucial to keep your routine fresh to avoid plateaus. I found it super helpful to plan my workouts methodically. I personally used the FitPPL push pull legs routine planner app, which tailored my workouts perfectly and kept things engaging while helping me build strength and stay motivated.",
                "author": "TrashMaleficent635"
            },
            {
                "comment": "When the length of the program is over.\n\nWhen my goals shift from one thing to another and the current programming doesn’t fit those goals anymore.\n\nFor me personally it’s about every three months.",
                "author": "Frodozer"
            },
            {
                "comment": "Your trainer is right, your body will adapt to stimulus like rep ranges, etc over time. However, you don't need to change your routine every couple of weeks. A good program will vary the details of your routine so as to maximize growth.\n\n\nMy last two programs were approximately 21 weeks each, and they worked wonderfully.\n\n\nI recommend ditching the PT, and finding a better designed program.",
                "author": "deadrabbits76"
            },
            {
                "comment": "Dude you got to mix it up!",
                "author": "randomferalcat"
            },
            {
                "comment": "Same here.  I take a week off then rotate in another routine (which change the workout/recovery days).\n\nI also have an A/B plan within a routine with similar exercises for slight variations.",
                "author": "slade51"
            },
            {
                "comment": "Why?",
                "author": "IronReep3r"
            },
            {
                "comment": "Personally I'm open to try new things?\n\nThere's a million ways to build muscle, it's endless.\n\nAs long your consistent everything works so do as you please.",
                "author": "randomferalcat"
            }
        ]
    },
    {
        "title": "Tips for beginners in workout ",
        "content": "Im a 6 feet guy with around 73 kgs in weight and am 17 I recently started doing workout \nSo I need a suggestion that should I loose my weight during these excercise or should I maintain it cause I look average by figure ",
        "comments": []
    },
    {
        "title": "Beginner program tips",
        "content": "\nJust about to start my journey, looking for an advice on a good beginner program.\n\nFull body workout 3 times a week. Any good programs?",
        "comments": [
            {
                "comment": "**Hey, thanks for making a new post!** Please be sure to assign your post with **flair** for the best support! Also, check out **[this post](https://www.reddit.com/r/workout/comments/noyv6p/do_you_need_to_gain_weight_lose_weight_or/)** to answer common questions.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "https://thefitness.wiki/routines",
                "author": "Azod2111"
            },
            {
                "comment": "Start by going to [FitWiki](https://thefitness.wiki/) and read all of it, ALL OF IT. There are several easy digestible articles on training, diet and routines. The FAQ page will probably answer all your follow-up questions. Then pick a program from the recommended routines, preferably [the beginner program ](https://thefitness.wiki/routines/r-fitness-basic-beginner-routine/). If you don't have access to a gym, follow [the beginner bodyweight program ](https://reddit.com/r/bodyweightfitness/w/kb/recommended_routine?utm_medium=android_app&utm_source=share). Go on YouTube, and you will find several videos on how to perform the different exercises. If you want do add some cardio (as you should), you will find proper cardio- and conditioning routines [here](https://thefitness.wiki/routines/cardio-and-conditioning/).\n\nI would start with the following articles:\n- [Getting started with fitness](https://thefitness.wiki/getting-started-with-fitness/)\n\n- [Improving your diet ](https://thefitness.wiki/improving-your-diet/)\n\n- [Muscle Building 101](https://thefitness.wiki/muscle-building-101/)\n\n- [Recommended routines ](https://thefitness.wiki/routines/strength-training-muscle-building/)\n\nGL dude!",
                "author": "IronReep3r"
            }
        ]
    },
    {
        "title": "Please advise on workout plan",
        "content": "I’m a beginner, please give feedback on workout plan:\n\nMONDAY & FRIDAY- Back,Bicep, Forearm\n\nWide Grip Lat Pulldown 4x10\n\nNarrow Grip Lat Pulldown 4x10\n\nBicep Curl 4x10\n\nHammer Curl 4x10\n\nFace away Cable Curl 12x4\n\nWrist Curl 12x2\n\nReverse Curl 12x2\n\nFarmer’s Walk 9 laps\n\n\nTUESDAY & SATURDAY - Chest, Shoulder and Tricep\n\nFly Chest Machine 4x10\n\nIncline Chest Press Machine 4x8\n\nFlat Chest Press DB 4x8\n\nShoulder Press 4x10 \n\nUpright Row 4x10\n\nLat Raise 4x8\n\nTricep Overhead 12x4\n\nTricep Pushdown 12x4\n\nSkullcrusher till failure \n\nWEDNESDAY - Legs and Core\n\nLeg Extensions 4x10\n\nSquat 4x15\n\nCalf Raises 4x10\n\nLeg Raise 3x10\n\nPlanks, left and right 30 secs x 2\n\nMountain Climber 3x10 \n\nTHURSDAY & SUNDAY - Rest Day/Cardio",
        "comments": [
            {
                "comment": "I would suggest if doing push pull legs to do push day before pull day as your lats support a lot of your pushing movements and so them being sore after a pull session will impact your push lifts\n\norder of exercises doesn’t have to be this exactly but i would suggest:\nmain lift\naccessory lift\nisolations & core\n\ni’d begin with 3 sets rather than 4 and increase to 4 after a couple of weeks if 3 doesn’t feel like enough, however, you shouldn’t really need to go beyond 3 if you’re training hard enough unless you’re doing strength training doing 5 or less reps\n\nPush day for example could look more like\nA) Flat bench\nB) OHP\nC) Chest fly\nD1) Lat raise\nD2) OH Tri Ext\nE) Decline crunch\n\nI’d squat before leg press as it’s more technical and being toasted from leg press could lead to you unintentionally shifting weight through your lower back on squats and injuring yourself, whereas this isn’t a concern if the exercises are swapped around",
                "author": "roundcarpets"
            },
            {
                "comment": "Thanks for your comment. So you don’t actually need to train same muscles back to back? Is there any harm in doing it that way?",
                "author": "touchmaspaghetkev"
            },
            {
                "comment": "i’ll direct you to a previous comment i made elsewhere which talks about creating a plan in more depth and hopefully a bit more clearly:\nhttps://www.reddit.com/r/bodyweightfitness/s/k1vRukG9OJ",
                "author": "roundcarpets"
            }
        ]
    },
    {
        "title": "Good work out plan for 3 days",
        "content": "\nHello, in my old job I had enough time to go to the gym after work, but I went to a new place now and I work 12 hours for 4 days each week and I can’t go to the gym after. I have 3 days off, any advice what kind of split I could do for the best efficiency?",
        "comments": [
            {
                "comment": "Push pull legs should work perfectly. You’ll have all  parts of your body with ease.",
                "author": "ibzaa1"
            }
        ]
    },
    {
        "title": "Is creatine necessary",
        "content": "I’ve been taking creatine for years and never had a bad effect on me. I recently got a diagnosis of Ulcerative Colitis on top of my nocturnal Epilepsy. So I’m taking like 4 different medications so my kidneys are on full blast rn. So I’m getting off of creatine for awhile until things calm down. Can you still make good gains and get a good physique w/o creatine?",
        "comments": [
            {
                "comment": "A LOT of people don’t use creatine or pre workout or anything else, and they are doing great! The internet kinda makes you think that everyone is on it.",
                "author": "-Real-eyes"
            },
            {
                "comment": "Yes. You can get good gains without creatine.",
                "author": "AdmirableAd7753"
            },
            {
                "comment": "Most people don’t use creatine and those of us who do made most of our gains before it. It works but it’s responsible for a pretty small % of my (and everyone’s) gains. You don’t ever need to touch it, don’t feel like you’re missing out on something crazy",
                "author": "PM__ME__YOUR_TITTY"
            },
            {
                "comment": "From my understanding If you workout regularly vs working regularly with creatine you’ll only see a difference of maybe 5 pounds of muscle growth annually.\n\nSo ya you could definitely workout without it.",
                "author": "TwoPointsForYou"
            },
            {
                "comment": "Yeah, the internet certainly has its way of making it seem like creatine is a magic supp",
                "author": "Fun_Use_4962"
            },
            {
                "comment": "Thanks! Have hopes to get pretty big, unfortunately currently having some holdbacks with my health, but we will get there.",
                "author": "Fun_Use_4962"
            },
            {
                "comment": "100%. Internet is cray-cray. \n\nI have taken it on and off for 30 years. It helps - only helps - a bit when pushing yourself on compound lifts or doing sprints. But it is very minor. Hilarious the amount of guys who have I met that thought they would turn into Arnold or Lebron James from taking. Ahhhhhh, NO!",
                "author": "Sufficient-Union-456"
            },
            {
                "comment": "Yep. I almost started taking it. But I am in no way risking my hair falling out any more than it already does. No way, no how.  A lot of people experience that on creatine and the internets also try to make you believe they are all full of sh!t lol\n\nGood luck on your creatine free future, and your health journey!",
                "author": "-Real-eyes"
            },
            {
                "comment": "You're an idiot.\n\n\nEdit: creatine is literally one of the most studied supplements on earth and there is zero evidence that it causes balding. You're just trying to spread bullshit.",
                "author": "Wakenbake585"
            },
            {
                "comment": "Oh no. Thanks for telling me! Explains a lot about my life.",
                "author": "-Real-eyes"
            }
        ]
    },
    {
        "title": "3 day PPL vs 4 day UL split",
        "content": "I switched off the UL after around 1 yr because I was training legs too much and wanted a stronger upper body. But do you think this 3-day PPL will help develop my upper enough?\n\n\n\nPPL--\n\n\n\nCore:\n\n• Crunch Machine: 3 sets of 15-20 reps every gym day\n\nDay 1 - Upper Body (Push Focus):\n\n• Chest Press Machine: 3 sets of 8-12 reps\n\n• Shoulder Press: 3 sets of 8-12 reps\n\n• Incline Dumbbell Press: 3 sets of 10-12 reps\n\n• Cable Tricep Extension: 3 sets of 12-15 reps\n\nLateral Raise Machine: 3 sets of 12-15 reps\n\nDay 2 - Upper Body (Pull Focus):\n\nLat Pulldown Machine: 3 sets of 8-12 reps\n\n• Seated Row Machine: 3 sets of 10-12 reps\n\n• Face Pulls: 3 sets of 12-15 reps\n\n• Preacher Curl: 3 sets of 12-15 reps\n\nHammer Curl: 3 sets of 12-15 reps\n\nDay 3 - Lower Body\n\nLeg Curl Machine: 3 sets of 8-12 reps\n\nLeg Extension Machine: 3 sets of 10-12 reps\n\nHack Squat Machine: 3 sets of 8-12 reps\n\n• Standing Calf Raise Machine: 3 sets of 12-15 reps\n\n\n\nUL--\n\n\n\nCore: Do 3 sets of crunch machine every gym day\n\nUpper Body Day\n\nDay 1 - Upper Body:\n\nNote: Remember to warm up with some light cardio or dynamic stretches before starting your upper\n\nbody workout.\n\nChest Press Machine:\n\n• 3 sets of 8-10 reps\n\nRest for 1-2 minutes between sets.\n\nLat Pulldown Machine:\n\n2.\n\n• 3 sets of 8-10 reps\n\nRest for 1-2 minutes between sets.\n\nSeated Row Machine:\n\n3.\n\n• 3 sets of 10-12 reps\n\nRest for 1-2 minutes between sets.\n\nShoulder Press:\n\n4.\n\n• 3 sets of 8-10 reps\n\nRest for 1-2 minutes between sets.\n\nPreacher Curl:\n\n5.\n\n• 3 sets of 10-12 reps\n\nRest for 1-2 minutes between sets.\n\nCable Tricep Extension:\n\n6.\n\n• 3 sets of 10-12 reps\n\nRest for 1-2 minutes between sets.\n\n  \n\n\nLower Body Day\n\nDay 2 - Lower Body:\n\nOnce again, warm up before starting your lower body workout, and cool down and stretch after your\n\nsession.\n\nLeg Curl Machine:\n\n1.\n\n• 3 sets of 8-10 reps\n\nRest for 1-2 minutes between sets.\n\nLeg Extension Machine:\n\n2.\n\n• 3 sets of 10-12 reps\n\nRest for 1-2 minutes between sets.\n\nHack Squat Machine:\n\n3.\n\n• 3 sets of 8-10 reps\n\nRest for 1-2 minutes between sets.\n\nStanding Calf Raise Machine:\n\n4.\n\n• 3 sets of 12-15 reps\n\nRest for 1-2 minutes between sets.  \n\n\n",
        "comments": [
            {
                "comment": "Interesting. I did a 4 day upper/lower split for a while and felt like my legs were getting way too big compared to my upper body -  guess I'm all about that runner's body haha. Have you considered adding a 4th day and doing a PPL split with an extra upper body day? Could help you reach your goals faster without burning out your legs. Just a thought!",
                "author": "freedom4eva7"
            },
            {
                "comment": "Switching up your routine can be good.  Three days might be enough to see gains if you're hitting it hard and eating right. But if you're really trying to pack on serious upper body strength, four days might be the move.  You could always try the three day and then switch it up if you feel like it's not enough.",
                "author": "freedom4eva7"
            },
            {
                "comment": "Legs to big ? Bro go compete ! That’s crazy. I’m in natural bodybuilding for more than 25 years now, and never met someone who thought their legs grow to fast, those fuckers are haaaard to grow",
                "author": "ilovechoralmusic"
            },
            {
                "comment": "What can I make the 4th day?",
                "author": "gamer20088"
            }
        ]
    },
    {
        "title": "Mon- Arms, Tue- Chest, Wed- Legs, Thur- Back, Fri- Core",
        "content": "I’m looking to revamp my workout routine and diet. I’ve been doing the routine listed in the title and I like it because I get to focus on specific areas each day and finishing with a single core exercise after each day except Fridays. What is your experience? I only get about 40 minutes a day and I’ve been doing like 3 sets of 15 or going to failure. I think im going to start pushing every set to failure instead. Let me know your thoughts!\n\n28 y/o\n5’8, 170\n\nDaily Diet- \n\n8-10 bottles of water\nRAW Isolate Protein Shake\nOmelette with 3 eggs, bacon and cheese\nProtein yogurt with granola and honey\nLeftover dinner for lunch (varies)\n2 6g protein bars\nDinner (varies)\n*looking for a consistent healthy late night snack\n*glass of scotch roughly every 3 o r 4 days",
        "comments": [
            {
                "comment": "**Hey, thanks for making a new post!** Please be sure to assign your post with **flair** for the best support! Also, check out **[this post](https://www.reddit.com/r/workout/comments/noyv6p/do_you_need_to_gain_weight_lose_weight_or/)** to answer common questions.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "My recovery doesn’t allow for core exercises each day. I hit my abs 2-3x per week just like any other muscle group. \n\nI prefer to hit each muscle group 2x/week (following the consensus that it’s better to stimulate each muscle group 2x/week) so bro splits don’t work for me.",
                "author": "Capital_Comment_6049"
            },
            {
                "comment": "Yo, that's a solid routine for hitting each muscle group. I used to do something similar but switched it up to full-body workouts three times a week. I found that works better for me since I only have around 40 minutes too.  As for pushing to failure,  it's cool but don't overdo it, especially every single set. You could risk injury or burnout. \n\nYour diet seems pretty solid, but that scotch... maybe cut back a bit?  For a late-night snack, I've been digging Greek yogurt with some berries or a small handful of almonds.  Keeps me full and avoids that late-night sugar crash.",
                "author": "freedom4eva7"
            },
            {
                "comment": "When do you train shoulders?",
                "author": "Brother_Dave37"
            }
        ]
    },
    {
        "title": "Should I do lateral raises?",
        "content": "So, I’ve been trying something. After every shoulder workout, I would do lateral raises. It would normally be one set to failure, and I would increase that each week by like 5 reps for progressive overload. However, I was wondering. Are these a good idea? I don’t include them in the shoulder workouts but instead as a finisher. What I’m planning is doing lateral raises as a finisher after every workout (I do workouts 5 times a week so I would do lateral raises 5 times a week), and I would just increase it by 5 reps a week. Is this a good idea and would this train my shoulders? I always train to my maximum for it, and I always feel my shoulders, so I know it has some sort of impact. I just wanna make sure what I’m doing and are planning to do would be efficient.",
        "comments": [
            {
                "comment": "There are plenty of guys in these forums saying their delts blew up after switching to lat raises 4x/week.",
                "author": "Capital_Comment_6049"
            },
            {
                "comment": "Alright, just wanted to make sure whether or not it was a good idea. Thx! ",
                "author": "Conlanbb"
            }
        ]
    },
    {
        "title": "Help with routine for overweight teen",
        "content": "Hi. My daughter is 13, about 5’6” and is 190lbs. Since she was young I’ve had her in sports. We’ve tried everything but she always says it’s not for her. I’ve tried swimming, soccer, volleyball, softball, taekwondo… even tennis. I cook healthy meals and prepare lunches. But I cannot control what she’s eating as I try not to be controlling. For example if she’s at school she’ll eat extra meals there too. Or when we are not around she’ll snack. So I try to avoid buying tempting things. I’m trying. We are also getting some blood work done because it very well could be a health issue too. \n\nWhat are some work outs we can do together? I take her on walks. I have a gym membership I’m going to start taking her with me. But what are some workouts we can do at home together? What should we focus on in the gym? I do not want to make her feel bad for her size but I also want her to start taking health seriously. \n\nI’m trying to do my best here. I’m inexperienced with working out besides walking and treadmill/elliptical… I want to learn so I can motivate her as well. ",
        "comments": [
            {
                "comment": "**Hey, thanks for making a new post!** Please be sure to assign your post with **flair** for the best support! Also, check out **[this post](https://www.reddit.com/r/workout/comments/noyv6p/do_you_need_to_gain_weight_lose_weight_or/)** to answer common questions.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "I enjoy physical activities but at 190lbs I would suddenly hate it all, and I've been there. An unconditioned teenager at that weight will not enjoy a lot of these things.\n\nYou have to try and teach her how much to eat in order to lose weight, and let her decide based on knowledge of how to get there. If you want her doing activities, you need to find something that can be done at her condition. Couch to 5k is the program I would run when I'm at my worst shape.",
                "author": "Kerune403"
            },
            {
                "comment": "I feel for your kid, that sucks so bad and people don’t realize how easy it is to be a fat kid. School lunches are shit, you sit for like 7 of the 8 hours, and there’s vending machines with a bunch of fatty, sugary foods and drinks. I was a fat kid (like 280lbs at 16) and it sucked and I wish my mom would’ve noticed how shitty it was for me and my future. So first off, nice job. \nRunning when I was 280 was hard asf, and walking was just as bad. Your hips hurt, back hurts, knees hurt. Like bro everything hurts. So if I can say anything I’d say to add weight lifting into your workouts. Lifting saved me. It burns more calories than running too. I seriously started melting off fat. \nObviously everyone is different but yano you should try it out with her and see if she falls in love w it like I did. Also don’t forget that she probably wants to take her health seriously but is embarrassed. It sucks being that big when you know you shouldn’t be and you have all those puberty emotions going through you and you hurt and you just get used to it. So she probably wants to just doesn’t know how yet.",
                "author": "grey_ram__"
            },
            {
                "comment": "You guys could try dance workouts on YouTube, she might find that fun.",
                "author": "nothanks99999"
            },
            {
                "comment": "i would probably detach the gym from weight loss since i’m not a big fan of having that emotional connotation and would rather pursue other goals like strength snd hypertrophy in the gym that will still accomplish the basic goal of having an active habit that can last for a while. even for you as an adult it’s probably a good idea to do basic compound lifting focused on progression to combat aging related fuckery.    \n\ni would think that basic lifting is probably more accessible to overweight individuals than tons of team sports and cardio due to joint stress or just the demotivation of not being able to keep up.   \n\nid imagine reasonably protein centric meals might be good for satiety as well",
                "author": "accountinusetryagain"
            },
            {
                "comment": "All suggestions for exercises are good . You can follow them . But first take a opinion of doctor specially endocrinologist.  Do some blood test as told by doctor  . Because for this age and height her weight is little bit high. Also see her diet strictly.",
                "author": "Resident-Nectarine91"
            },
            {
                "comment": "Not an expert in any of this, but pickleball is really fun and gets you moving. It’s becoming more popular so she be might be more inclined to try it because it’s “trendy”",
                "author": "lenora-"
            },
            {
                "comment": "Another issue is that she is entering her teens, so be careful with your pressure on her. Did you play any of those games when you were her age or later?\n\nChildren can seldom be taught, but they do copy their parents in whatever they do. Think of all the actions you wouldn't want your daughter to take and stop doing them.\n\nMothers can be best friends at this age, so try that.",
                "author": "EmbraceNew"
            },
            {
                "comment": "Oh thank you for this. I never thought maybe she is embarrassed but really wants to. I assumed she didn’t care. But thank you. Makes so much more sense now. And I will try weights! That’s something we can do at home.",
                "author": "BeneficialOrange2247"
            },
            {
                "comment": "Good idea!",
                "author": "BeneficialOrange2247"
            },
            {
                "comment": "oh this reminds me of Just Dance, those are great as a cardio routine.",
                "author": "MedalSera"
            },
            {
                "comment": "Thanks for the tip! We took an hour walk together and stopped at a park. It wasn’t too bad for her. I’m going to do some light weights with her and progress as we get more comfortable. For dinner we had baled chicken, steamed broccoli and garlic brown rice. We all ate the same thing so it’s more of a family effort rather than singling her out. Thanks for the tips!",
                "author": "BeneficialOrange2247"
            },
            {
                "comment": "Yes. We have the order forms now. Going to schedule testing with the lab.",
                "author": "BeneficialOrange2247"
            },
            {
                "comment": "Great idea! She likes tennis but we can try pickleball!",
                "author": "BeneficialOrange2247"
            },
            {
                "comment": "Obviously how I felt isn’t how every overweight kid feels or felt but yeah we live in a comparison world and it sucked comparing myself to everyone else and having to suck it up and act like I was fine when I was not fine. But yeah I think you’re doing good by checking on her now rather than later. Try out them weights! There’s so many benefits to weight lifting!",
                "author": "grey_ram__"
            },
            {
                "comment": "The Madfit ones are good fun.",
                "author": "Tammer_Stern"
            },
            {
                "comment": "yee ill link some good resources   \n\n[learn how to lift playlist/megsquats](https://www.youtube.com/playlist?list=PLq5HZUY4iks6hx3UJ169OAFTSQi3jAK51)\n\n[/r/xxfitness lifting for dummies basically](https://www.reddit.com/r/xxfitness/wiki/lifting/#wiki_what_lifting_programmes_are_there.3F_which_one_should_i_follow.3F)\n\n[https://thefitness.wiki/routines/strength-training-muscle-building/](https://thefitness.wiki/routines/strength-training-muscle-building/)\n\n[https://thefitness.wiki/faq/](https://thefitness.wiki/faq/)",
                "author": "accountinusetryagain"
            },
            {
                "comment": "Thank you!",
                "author": "BeneficialOrange2247"
            },
            {
                "comment": "Amazing. Thank you!",
                "author": "BeneficialOrange2247"
            }
        ]
    },
    {
        "title": "Which is better, full body workout 3 times per week or body split workout 4 times a week?",
        "content": "Hi! For the past year I've been training 3 days per week making a full body workout. I'm trying to gain muscle mass. Do you think it's best to make a 4 days split workout?\n\nThis is the workout I created myself, feel free to comment about it.\n\n\\*\\*Monday\\*\\*\n\n- Bench Press: 4 sets of 8-12 reps\n\n- Overhead Press: 3 sets of 8-12 reps\n\n- Wide Grip Lat Pulldown: 3 sets of 8-12 reps\n\n- Seated Cable Row: 3 sets of 8-12 reps\n\n- Skull Crusher: 2 sets of 8-12 reps\n\n- Lateral Raises: 2 sets of 8-12 reps\n\n\n\n\\*\\*Tuesday\\*\\*\n\n- Crunches: 4 sets of 6-10 reps\n\n- Bicep Curl: 3 sets of 12 reps\n\n- Calf Raise: 3 sets of 60 reps\n\n- Barbell Deadlift: 3 sets of 8-12 reps\n\n- Squats: 2 sets of 8-12 reps\n\n\n\n\\*\\*Thursday\\*\\*\n\n- Inclined Bench Press: 4 sets of 8-12 reps\n\n- Overhead Press: 3 sets of 8-12 reps\n\n- Wide Grip Lat Pulldown: 3 sets of 8-12 reps\n\n- Seated Cable Row: 3 sets of 8-12 reps\n\n- Skull Crusher: 2 sets of 8-12 reps\n\n- Lateral Raises: 2 sets of 8-12 reps\n\n\n\n\\*\\*Friday\\*\\*\n\n- Lying Leg Raise: 4 sets of 20-30 reps\n\n- Bicep Curl: 3 sets of 12 reps\n\n- Calf Raise: 3 sets of 60 reps\n\n- Barbell Deadlift: 3 sets of 8-12 reps\n\n- Squats: 2 sets of 8-12 reps",
        "comments": []
    },
    {
        "title": "Plateau Questions",
        "content": "Hey everyone, I had a quick question. I started taking my weight loss seriously last year in November. I have gone from 315 lbs to 255 lbs but have been hard stuck on a plateau, bouncing from 254-258 for a little over a month. \n\nDuring the first three months of my journey I had a goal of 8k steps a day with weight training three days a week. Eventually I vunoed that up to four days a week but it was a very light and easy program with very little progressive load while I focused primarily on form. \n\nI got divorced at the beginning of this summer and ended up dropping weight training due to depression hitting me hard but I continued to walk and upped my goal to 10k steps a day. \n\nAbout a month ago I started to reincorporate strength training into my routine. I am doing it four days a week and have seen fantastic gains. I have seen a (Roughly) 5-10% load increase for *most* exercises from week to week (Sometimes even from day to day). I also started taking Creatine a week or two ago. I also upped my step goal from 10k to 15k per day. \n\nI am 35, male, 6'1\" tall and have basically never consistently exercised till this year (Though I have worked fairly physical jobs most of my life). I aim for a 2,000 net calories a day and usually eat somewhere between 2,750-3,000 gross calories a day. I track calories and exercise using a food scale, MyFitnessPal, and Samsung Fitness (Which is connected to my watch to track steps and calorie expenditure). \n\nSo my question is this: Do I need to reduce my calorie intake to get over this hump or am I seeing this struggle because my body is putting on muscle and this plateau will level out once I get past the \"Beginner gains\" stage of lifting? I was down to 249 lbs before a trip to New York where I wasn't as strict with tracking my calories and jumped to 255 and then I started weight training once I got back. ",
        "comments": [
            {
                "comment": "Yes you need to decrease your calories",
                "author": "FTX-SBF"
            },
            {
                "comment": "def possible to be losing fat but staying the same weight due to noob muscle and intramuscular water from training. eventually muscle gain will be more like 1-2lbs/month (or in short a fraction of the amount of fat you’re probably trying to lose) so you’ll either see the scale go down or need to drop cals",
                "author": "accountinusetryagain"
            },
            {
                "comment": "Awesome. Thank you very much",
                "author": "DarthRevan00m9"
            }
        ]
    },
    {
        "title": "Is this a good deadlift?",
        "content": "I’m 5’9 weigh 150 pounds and deadlift 260 pounds.  Is this a good deadlift?  Am I below average above average or just normal?  And what should be my goal for a deadlift?",
        "comments": [
            {
                "comment": "If it's better than a deadlift you did in the past, then yeah, it's good. \n\nDon't measure yourself to other people because, ultimately, unless you're competing against them in an actual competition, who cares. \n\nAs someone who's competed in strength sports, even then while you try to win, there is nothing you can do about other people. You can only control your own performance. \n\nIn absolute terms, I would say you are at novice/beginner level. You're not \"Untrained\" because I assume you have basic proficiency in the lift to be able to lift considerably more than your own bodyweight. \n\nDepends on the cohort you're comparing against in terms of what's \"normal\" or \"average\". Most people, even regular gym goers, would consider a 400lbs Deadlift very strong, but even at a local level in strongman that would be your entry level weight for a first timers comp - for max reps (say x5-10).\n\nAt your bodyweight I'd be shooting for around the early 300s for intermediate, around 400lbs for an advanced lifter, and if you hit 500lbs and above that would be very impressive. 600lbs you're at the elite level.\n\nEven so, you still get freaks. There is a woman in the UK called Rhiannon Lovelace who competes in the 61kg class (i think), so considerably lighter than 150, and hit over 600lbs which blows most distribution curves out of the water even for elite male lifters.\n\nEssentially- who gives a shit. Lift, get as strong as you can. If you're improving you're winning.",
                "author": "gazhole"
            },
            {
                "comment": "\nto preface i dont care if its good or bad, if you want to be stronger the goal will always be the next milestone. maybe 5lbs on your work sets every week or two, hit a 1-3 rep pr every now and then repeat\n\nfor the general health benefits of exercise, you’re gucci.   \n\nto impress normies, 405 or 315 RDL for reps.   \n\nto be a competitive threat, probably 500ish but depends on weight class",
                "author": "accountinusetryagain"
            }
        ]
    },
    {
        "title": "275m walking 4-6 miles a day and eating again a calorie deficiency ",
        "content": "Hey guys! So I started the keto diet 3 weeks ago. I lost a lot of water weight in the beginning between the diet and the walking. But now I'm thinking of just going to calorie deficiency and walking the same amount. I'm just curious how healthy this is for me. Like based on my app that I'm using to track my calories I ate only a thousand calories yesterday and my total allotment was just over 2,000. I didn't feel hungry or anything else like that I just felt normal. Can anybody maybe point me in the right direction I don't want to destroy my body.",
        "comments": [
            {
                "comment": "**Hey, thanks for making a new post!** Please be sure to assign your post with **flair** for the best support! Also, check out **[this post](https://www.reddit.com/r/workout/comments/noyv6p/do_you_need_to_gain_weight_lose_weight_or/)** to answer common questions.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "Weight loss comes down to calories in vs. calories out - if you eat fewer calories than your body needs, you will lose weight. Fad diets like the keto diet may make it easier for some people to maintain the needed calorie count, but they’re not really any better than just tracking calories overall. If you want to gain muscle, you’ll need to eat a high level of protein while also being in a calorie deficit, but it doesn’t sound like that’s necessarily your goal. \n\nThat said, 1000 calories a day is generally not enough for most people to be healthy. It’s also not likely to be very sustainable. I suggest starting with a deficit of 300-500 calories a day, and track your progress. That deficit should have you losing at a healthy rate of about 1lb/week…if you don’t see those results, you can adjust as needed.",
                "author": "Cephandrius13"
            }
        ]
    },
    {
        "title": "Would a personal trainer be worth it for me?",
        "content": "Hi! So I'm an 18 year old guy and I've been going to the gym for a while, a year and a half now, though I didn't go very consistently for the first year and I only started taking it seriously and actually turned it into a habit instead of relying on motivation half a year ago. All of this time I've always worked out alone.\n\nI've been a really unathletic guy basically my whole life, and I'm still in pretty bad shape and usually the weakest guy at the gym (yeah I compare myself to others too much but that's besides the point lol) Though I look up a lot of fitness advice online, and I'd say that by now I mostly know what I'm doing, I still think it would be nice to get personal feedback from a trainer in real time, just to be sure. Also to maybe get me a better routine, since that's what I'm the most unsure about.\n\nI already feel pretty comfortable going to the gym regularly, and as I said online advice has helped me a ton and I think I mostly understand what I'm doing now, so I figured it would be enough to train with a trainer for a short while, maybe a few weeks or up to a few months?\n\nDo you guys think this would be worth it? Or should I train with a trainer for longer than that? Or maybe it would be better if I just kept looking for advice online, or from friends irl?",
        "comments": [
            {
                "comment": "I say look for a trainer at your gym who will listen to what you are asking for. And give it a shot. Some trainers are amazing, some or are okay and a lot are bad. If you feel in the orientation or meet up that you are not being listened to, don't sign up. \n\nSome trainers have super high sales tactics. Trying to force you to sign up for 3 months, 6 months or a year. If they are unwilling to do just a month, odds are it is not a good fit for you.",
                "author": "Sufficient-Union-456"
            },
            {
                "comment": "You could ask if your gym has options for newbs..  at mine they'll at least get you started with a schedule for a low fee and many gyms just do that as part of the intake. \n\nYou can usually also just ask about specific exercises, I don't think any trainer would refuse to answer a question like \"hey I'm new could you tell me if I'm doing this exercise right?\"\n\nSame with more experienced people in the gym, most ppl are friendly and I think many are also flattered that people think they know what they're doing and ask them stuff. \n\nBut there's also advantages to just having a trainer who you can ask a bunch of stuff and who can help you in a more personalized way: if you have the money and there're definitely dumber ways to spend it 😂",
                "author": "SebSpellbinder"
            },
            {
                "comment": "I’d been a gym guy, Muy Thi guy for years before I actually went to a gym with a trainer. It really helped me achieve crazy results, but at also did everything I was supposed to do, including the diet and never had cheat day. In 60 days I was a beast. I’ve use trainers on three other occasions (all for 60 day challenges) and each time with amazing results. The key for me is this, I’m paying this person for their expertise so I’m going to listen to them and do everything they tell me to do, what workouts, what intensity, how long, and what to eat. I haven’t used a trainer for a few years now and it’s definitely taken me longer to lose weight and build muscle on my own because I’m not paying for it. I’ll still get there but it’s taken five months to lose 30 lbs.",
                "author": "Raincleansesall"
            }
        ]
    },
    {
        "title": "Workout Plans",
        "content": "I'm new to working out and wondering what I should do about my workout plan. \n\nShould I hit several things in one day? Liek legs and arms and chest? Or split it up into different days?\n\nAnd should I do cardio everyday or once in a while?\n\nMy goal is to just have an overall toned and healthy body.",
        "comments": [
            {
                "comment": "**Hey, thanks for making a new post!** Please be sure to assign your post with **flair** for the best support! Also, check out **[this post](https://www.reddit.com/r/workout/comments/noyv6p/do_you_need_to_gain_weight_lose_weight_or/)** to answer common questions.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "comment": "There are many factors. Read the following and see what fits your lifestyle and goals: \n\nhttps://thefitness.wiki/",
                "author": "Capital_Comment_6049"
            }
        ]
    },
    {
        "title": "Body fat. ",
        "content": "Nobody is answering my questions. Im a basketball player. (Fem, 13) and I want to lose weight. People always say “it’s fine, you’ll thin out when you get older!” I don’t give a crap. I want to lose weight now. Right now I’m focusing on my lower abdomen, my glutes, my breasts, my hips, and my arms.\n\nAny tips? And don’t say I’m still growing or any of that, I know what I want.",
        "comments": [
            {
                "comment": "It's good that you're focused on your fitness. At 13, your body is still developing, so it's important to approach weight loss in a healthy and sustainable way. Crash dieting or extreme measures can be counterproductive. Focus on eating whole foods, getting enough protein, and incorporating strength training into your routine. That will help you build muscle and look more toned. Also, basketball itself is hella good exercise, so keep ballin' out. Consistency is key. You got this.",
                "author": "freedom4eva7"
            },
            {
                "comment": "You're 13 so you probably can't calculate your daily intakes accurately. Best option would be to kiss watch what you eat, avoid having a lot of sweets and moving a lot throughout your day.\n\n>Right now I’m focusing on my lower abdomen, my glutes, my breasts, my hips, and my arms.\n\nFocusing fat loss is not a thing.",
                "author": "Azod2111"
            },
            {
                "comment": "Unless you’re very overweight it would be counterproductive to your growth and mental well being to do so. So you’re getting he right advice. You just don’t like it. \n\nThat being said, if you’re interested in ruining your health and having a tough road ahead… You need to eat less food and continue your sports. Lifting would help maintain muscle and support growth as well.\n\nIf that doesn’t work then you’re eating too much and not moving enough.",
                "author": "Frodozer"
            },
            {
                "comment": "You can't spot reduce fat. You want to lose weight? Eat less, move more. It will come off wherever you body decides to, first.",
                "author": "jiebyjiebs"
            },
            {
                "comment": "Honestly that advice isn't bad. It's just worded wrong.\n\nAt 13 you're still growing.  So you should focus on your fitness and try to be the best basketball player you physically can be. Your body will adapt much faster as a teenager than it will in your 20s-30s-40s and so on. Do drills, sprints, and some strength training. Try to eat as low-processed whole foods as you can, but don't forget the occasional fun treat and snacks. You will lean out because of the physical demands are so high. By the time  you reach your 20s, you'll be way ahead of the game in terms of physical fitness than 99.99% of your peers.  That will benefit you even if you decide that basketball is not the sport for you.  It sticks with you for the rest of your life.\n\n  \nTo put it another way, you can't lose weight \"right now\".  It takes several weeks and even months depending on your starting point. It would be a waste of time to focus on weight loss when that time could be better utilized being a better athlete. \n\nI'm 36, and this is the advice I'd give to my 13 year old self.",
                "author": "Deevimento"
            },
            {
                "comment": "Everyone here is giving you some good advice. The truth is, it’s okay if you don’t feel great about yourself right now. But remember, feeling good starts from within.\n\nYou might feel a lot of pressure to look or act a certain way, but trust me—you are good enough just as you are!\n\nIt's awesome that you're interested in fitness. Keep moving, play sports you enjoy, and hang out with friends. Eating healthy is important, but it's also okay to have snacks and sweets sometimes.\n\nMost people have felt the way you do now. When people say you're growing, it means your body and mind are still developing, so you need good food to stay healthy. Skipping meals or trying to lose weight by not eating isn't good for you.\n\nIf you're actually overweight and find it hard to move, try to eat less sugary stuff, choose healthier foods, and be more active. As you exercise and play sports, you’ll gain muscle, which might make the scale go up, but you’ll also lose fat. So don’t worry too much about the number on the scale.\n\nYou can't choose where your body loses fat, and most diet pills don’t work. The best thing you can do is eat healthy and exercise.\n\nYour body is really smart. If you're hungry, it’s a sign you need food. If you're not hungry, you probably don't need to eat.\n\nSo, keep playing sports, eating well, and doing things you love. Give yourself time—things will get better.",
                "author": "SellUnfair2796"
            }
        ]
    },
    {
        "title": "Workout plan review",
        "content": "Hi everyone! I was wondering if I could get feedback on the workout plan I created for myself.\n\nJust as background: I have about 2 years of experience in gym bodybuilding and about 3 years in bodyweight fitness training.\n\nSince it is a rough plan, I did not include the warm-up and cardio. The rep ranges worked for me so far but I am open to other ideas/feedback.\n\nAs for my goals, I want to spend my time in the gym as efficiently as possible, do hypertrophy-focused training, and get lean. I tried to include all groups of muscles and match them with exercises that I like doing the most (easy on the joints, less fatigue build-up).\n\nI would love to see what you guys think!\n\n||Split 1/A|Split 2/A|Split 1/B|Split 2/B|\n|:-|:-|:-|:-|:-|\n|Chest(4 sets, 8-12 reps)|Incline bench press||Machine fly||\n|Back(4 sets, 8-12 reps)||Lat pulldown||Sitting cable row|\n|Shoulder(4 sets, 8-12 reps)|Shoulder press||Reverse fly||\n|Quadriceps(4 sets, 8-12 reps)|Leg press||Seated leg extension||\n|Hamstrings(4 sets, 8-12 reps)||Machine leg curl||Machine leg curl|\n|Biceps(4 sets, 12-15 reps)||EZ Bar curl||EZ Bar curl|\n|Triceps(4 sets, 12-15 reps)|cable pushdown||overhead cable extensions||\n|Leg adductors(4 sets, 12-15 reps)||Hip adduction machine||Hip adduction machine|\n|Calves(4 sets, 12-15 reps)|seated calf raise||seated calf raise||\n|Traps(4 sets, 12-15 reps)||Dumbbell shrugs||Dumbbell shrugs|\n\nEdit: table formatting",
        "comments": [
            {
                "comment": "Does this mean you are doing 1A, 2A, 1B, 2B over the course of a 7d week?\n\nIf so, it doesn’t look like enough volume. For example, you have one exercise with 4 sets for vertical pull and one exercise with 4 sets for a horizontal pull.\n\nIf efficiency is a goal, then I’d prioritize compound lifts and supersets. Full body IMO isn’t very efficient when you consider all the time warming up all your body parts.",
                "author": "Capital_Comment_6049"
            },
            {
                "comment": "Thanks. Yeah I wasn't clear on that. So I would be doing this 4x per week.\n\nI thought 8-10 sets per muscle group per week was enough. For which muscle groups do you think it's not enough? Where can I implement compound movements?",
                "author": "royaltroop"
            },
            {
                "comment": "FWIW:  \n[How Many Sets Per Muscle Group Per Week To Force Growth? (Less = More!) (builtwithscience.com)](https://builtwithscience.com/fitness-tips/how-many-sets-per-muscle-group-per-week/)\n\nIf you've lifted for 2+ years, you're past the beginner stage and can likely progress better with at least the bottom of their 10-20 sets/week range. You probably know what your recovery time is like from past programs. For my part, I know that if I do 9 working sets for chest, I need a minimum of 72h for recovery time before hitting it again.",
                "author": "Capital_Comment_6049"
            },
            {
                "comment": "Have you used the more popular PPL, upper/lower, or Bro Splits in the past? Did they not work for you? You seem to have more of what I would call \"part body\" on each of your days.\n\n1A; Chest/Delts/Triceps/Quad/Calf\n\n2A: Lats/Hams/Bicep/Hip adduction/Traps\n\nI'd personally just go Upper/Lower if you're in the gym 3 or 4 days per week.\n\nI'd do something like this (trying to combine most of your exercises because you probably like them):\n\nUpper1: Incline DB Bench Press 3 sets, Lat pulldown 3 sets, DB Shoulder press 3 sets, Chest Fly 2-3 sets, Row 2-3 sets, Lat raise 2-3 sets, Triceps Extensions 3 sets, Bicep Curls 3 sets.\n\nUpper2: BB Bench Press 3 sets, Row (different grip/width than in Upper1) 3 sets, Machine or BB Press 3 sets, Incline press, 2-3 sets, Pull-ups 3 sets, rear delt fly 3 sets, overhead rope or bar extension (or skullcrushers) 3 sets, hammer curls 3 sets.\n\nThat would put you at 12 sets/week of compounds for back and chest\n\nedit: You seem to be missing core workouts. Abs are like any other muscle group. Progressive overload 2-3x/week. I left out squats and deadlifts although I find that they're elite - I figured there was some reasons you don't have them. Maybe there is no ability to do them at your gym",
                "author": "Capital_Comment_6049"
            },
            {
                "comment": "Thanks a lot for the recommendation! I have tried upper/lower splits before but for some reason, my body responded better to push/pull type programs. From past experience, if I go hard and make sure the technique doesn't suffer, I seem to get spent after max. 7 exercises in 1 session. Anything after that makes the recovery take longer and I lose consistency.\n\nYeah, I forgot to include abs there since I mainly combo it with cardio work.",
                "author": "royaltroop"
            },
            {
                "comment": "Yeah I hear you. I tried Upper/Lower for a couple weeks when work became hectic and found that it was too exhausting. I prefer my 6d PPL. It may not be the best for everyone, but it works out the best for me.\n\nI think I’d have to lower the number of compound exercises if I ever went back to an Upper/Lower. I’m pretty exhausted after just 3 sets of incline DB press and 3 sets of Pec Deck on my Push day!",
                "author": "Capital_Comment_6049"
            }
        ]
    },
    {
        "title": "Home workout routines",
        "content": "Hello Everyone,\n\nI was able to save some money and get a 7 foot olympic (44lb) bar, 40 (10x4) lbs plates. I have a bench press + squat rack and adjustable training bench. I'm waiting for the adjustable 80 lbs einsenlink dumbells to arrive in a week.\n\nI'm 40+ and have some experience working out at a gym (beginner level) and trying to get back into some routine if possible. Can someone suggest a workout routine with which I can perform using the above. I will be able to spend at least 3 to 4 days a week,\n\nTIA",
        "comments": [
            {
                "comment": "**Hey, thanks for making a new post!** Please be sure to assign your post with **flair** for the best support! Also, check out **[this post](https://www.reddit.com/r/workout/comments/noyv6p/do_you_need_to_gain_weight_lose_weight_or/)** to answer common questions.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/workout) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ]
    },
    {
        "title": "Back workout help",
        "content": "My first back routine was a simple wide grip lat pulldowns, lat pushdown and bent over barbell row but i didnt see any growth and i decided to change lat pushdown with seated row after 2 months still no growth and my form is decent said by the people i asked  so now i wanna change it a im thinking of Assisted Pull ups, single arm lat pulldown, iso-lateral row, seated row what do you guys think? Should i just build a better mind body connection?",
        "comments": [
            {
                "comment": "did you gain body weight and get stronger at the exercises before swapping them",
                "author": "accountinusetryagain"
            },
            {
                "comment": "What is your routine and how many sets/rep are you doing?",
                "author": "Dependent_Steak5323"
            },
            {
                "comment": "Dude, 2 months is nothing. Be patient and keep grinding. It will happen.",
                "author": "EisenKurt"
            },
            {
                "comment": "The issue isn’t your exercise selection, it’s probably some other things. We don’t know your effort level, volume or how much you’re eating. We also don’t know what you mean by growth. Did you get stronger at these movements? 2 months isn’t much especially if you’re talking about visual growth in a muscle you can’t usually see.\n\nI personally prefer pull-ups (even assisted), dumbbell / barbell rows and hammer strength rows to everything else you mentioned like pull downs and cable stuff. I like dumbbell pullovers too. But those wouldn’t be game changers for you unless the other stuff you’re likely not doing, including patience, are on point",
                "author": "PM__ME__YOUR_TITTY"
            },
            {
                "comment": "Im tryna build muscle and lose fat at the same time so I lost some body weight and I got a bit stronger",
                "author": "Radiant_Context3849"
            },
            {
                "comment": "For my back, I do lat pulldowns (4 sets of 8-12 reps), bent-over rows (4 sets of 6-8 reps), and seated rows (4 sets of 8-12 reps). I’ve been consistent with this routine for 2 months, but I haven’t seen any growth, unlike my arms and chest.",
                "author": "Radiant_Context3849"
            },
            {
                "comment": "if you keep getting stronger at rows and pulldowns somethings gonna have to grow",
                "author": "accountinusetryagain"
            },
            {
                "comment": "Build muscle and lose fat is hard without juice.. are you on juice??",
                "author": "Typedre85"
            },
            {
                "comment": "To build muscle and lose fat at the same time is difficult without juice.. if your on juice then carry on..",
                "author": "Typedre85"
            },
            {
                "comment": "I wish smth were growing, but I don’t know, it just doesn’t seem like it is. I’ve been doing the same routine for 2 months now.",
                "author": "Radiant_Context3849"
            },
            {
                "comment": "What kind of juice?",
                "author": "Radiant_Context3849"
            },
            {
                "comment": "HRT",
                "author": "Typedre85"
            },
            {
                "comment": "Oh i take that kind of stuff",
                "author": "Radiant_Context3849"
            }
        ]
    },
    {
        "title": "Pull workout",
        "content": "I’m not happy with my pull workout. Right now I do 3 sets of lat pulldown, 3 sets of cable row, 3 sets of barbell row, 3 sets of rear delt flies, 3 sets of z-bar curl and I rotate between preacher curl and hammer curls weekly. Can you guys recommend me a pull workout plan because I don’t feel like I’m getting stronger or building muscle with this? Is there anything I can improve?",
        "comments": [
            {
                "comment": "Why aren't you happy with it?",
                "author": "Dependent_Steak5323"
            },
            {
                "comment": "There’s always pull-ups. Or Deadlifts. \n\nIf time permits, single arm rows; DB or Cable. Or even seated rows if you can. I’m doing Lat Pull-Downs 2/wk but alternate grips. \n\nI superset Back and Shoulders, so Upright Rows are fun. \n\nThen there’s always taking what you’re doing and modifying the rep ranges. Do 3x20 for a few weeks, or 5x5.",
                "author": "ToastyCrouton"
            },
            {
                "comment": "I slot three sets of straight-arm pulldowns after the compound lifts. Especially as someone who used to struggle with not being able to really feel pull-ups or rows in my lats, I think they’re a great exercise.",
                "author": "ArticleGerundNoun"
            },
            {
                "comment": "Swap out barbell rows for a more efficient exercise. Rear delts almost never need specific training by beginners or early intermediate, but rear delt crossovers or face pulls are generally superior.\nCheck your form on your rows but you could do unilateral variations like one armed rows supported.\nIncline bicep curls are great option as well.",
                "author": "BigNastyOne"
            },
            {
                "comment": "I have been doing this routine for a couple of months now and I’ve been stuck in the same weight. It doesn’t feel like I’m improving or anything. My back strength is the same. In terms of my biceps I don’t feel my biceps while doing z-bar curls. I mostly feel my forearms for some reason.",
                "author": "Emir_Bastug"
            },
            {
                "comment": "Make sure your wrists are straight while you’re curling. Many people curl their wrist at the top. Make sure to have a slow eccentric (2-3 secs). I never have issues feeling my biceps on curls.",
                "author": "Capital_Comment_6049"
            },
            {
                "comment": "have you gained any weight? try for micro PRs or take off 10% and ramp back up for PRs.",
                "author": "accountinusetryagain"
            }
        ]
    }
]