{
    "title": "What’s Your Go-To Fitness Hack or Workout Routine?",
    "content": "What’s one fitness “hack” or workout routine that has really made a difference for you? Whether it’s a specific exercise, a nutrition tip, or something else!",
    "comments": [
        {
            "comment": "Focussing on the lift at the stretch part, I see most people not do this \nControlling the eccentric, again most people are not controlling it and are too fast\n\nAnd partials, oh man",
            "author": "IAmGeeZee"
        },
        {
            "comment": "For me it was: learning that recovery is subjective, not linear. \n\nYou don’t necessarily *need* 48hrs of recovery between muscle groups. Hell you can train the same muscle group every day as long as the volume and load management is done appropriately \n\nWhen I started benching at moderate intensity 4-5x a week with variations to intensity and load management to get my bench better for competitive powerlifting, it skyrocketed my shit way more than training hard as fuck 1-2x a week and using multiple days in between to recover",
            "author": "None"
        },
        {
            "comment": "\"Training until involuntary slowdown\" is probably the biggest thing.  Basically you perform reps at full power on the concentric until you can't move the weight as fast as you could the previous reps.  It turns how that once you start slowing down, you're essentially at an RIR of about 3-4.  So it became a great way to gauge how close to failure I am during a set.  \n\nThe other is 2 second controlled eccentric in to full stretch on the muscle.  Basically never let gravity take control of the weight when resetting.",
            "author": "Deevimento"
        },
        {
            "comment": "These are a few that I use that I find helpful. \n\nTraining opposing muscle groups. So If I'm working my glutes, I'm also training hip flexors. Or if I'm working my chest I also work my back. Pull-ups and dips back to back baby!\n\nFocusing primarily on my core. Unlike every other muscle group, the core can handle nearly 6 days of training a week, so I give it as much attention in as many novel ways as possible.\n\nBeing more concerned about form and being able to pause during sets than worrying about how heavy the weight is. I don't fall into the camp of chasing huge numbers. I can lift heavier than your average 34-year-old in most major lifts, so I am way more concerned with form and having control through the entire move.\n\nI train for longevity. Fitness for most people is a race against yourself, and I have plenty of years ahead of me. So there is no reason to go crazy or do anything too wild. \n\nBuilding novelty into every workout. I am currently using a 3-month plan I developed which trains for an hour twice a week. Day one is glutes, hip flexors, chest, and back. Day two is delts, lats, quads, and hamstrings. Then both have a ton of core work mixed in. Each workout has its own unique design so I don't get bored and I am just slowly cycling through different skills. It's a blast.",
            "author": "Coachricky247"
        },
        {
            "comment": "Consistency",
            "author": "Green-Blueberry6083"
        },
        {
            "comment": "Core workouts and Yoga, these two are the saviors of my body when strength training.",
            "author": "TechTunePawPower"
        },
        {
            "comment": "Calisthenics. Less injury prone, less soreness, workout anywhere, most exercises have easier variants. Changed my life, never had a fitness program I wanted to stick with but setting goals besides \"lift heavier\" has helped me keep focus and be consistent.",
            "author": "Puzzleheaded_Poet_81"
        },
        {
            "comment": "Tailoring your workout routine to your body.\n\nWhen I first started, I used a bunch of different videos, websites, and people to make it. However, now that I have been doing it for longer, I know what exercises, time of day, and split my body reacts to best and I focus on those.",
            "author": "Eyebrow_Jones"
        },
        {
            "comment": "I do reverse reps: starting with the heaviest weight I can just about manage. For the next rep I take one weight off, and it’s still challenging after the heavy set. And the third set is another notch lighter. \nIt’s harder than moving up, as my muscles are more exhausted.",
            "author": "isearn"
        },
        {
            "comment": "Working out at home with supersets. Build a lot of muscle with 25 min workouts I do every day. For example today I did 10 pull-ups - 30 push-ups and 2 min plank 5x. In between sets I can empty the dish washer, vacuum, etc 😅 overall quite efficient",
            "author": "makybo91"
        },
        {
            "comment": "Not really a hack, but I appreciate stretching and flexibility a lot more now. It is an area that I had been neglecting for years and kind of accepted that I am just not a very flexible person. However, at a certain point I thought it was ridiculous that I couldn't even touch touch my toes without bending my knees. \n\nI now incorporate dynamic stretching before every workout and do specific exercises for flexibility (especially targeting my hips and hip flexors). It allows me to get a better ROM during my lifts and supposedly protects form injury (I can't say for sure if it has decreased my injury risk but I certainly feel a lot less stiff now). It's also great for stress relief and is a nice change from the usual high intensity workouts.",
            "author": "MedMindly"
        },
        {
            "comment": "I like lifting heavy on last set.  Only 2-3 reps before failure.  Since I switched, I feel much stronger.",
            "author": "Initial-Look-1676"
        },
        {
            "comment": "While I lift at the gym 3X a week, what really makes me feel good, and gives me a great total body workout is rucking. Going for a 5-10km ruck(walking with extra weight, like a rucksack, backpack, or I use a weight vest)is wonderful. It burns a decent amount of calories, and depending on the weight, can really build your cardio and lower body and core strength.",
            "author": "Jealous-Problem-2053"
        },
        {
            "comment": "1. Fats are the best way to ensure you get enough calories in. Good sources ofc not trash like seed oils \n\n2. Don’t be super stringent about time based programs, if it says 12 weeks then don’t just flip it around or drop it after 12, if you feel like you can keep going then do so, conversely if you plateau somewhere then first order of business should be to switch it up for the closest variation( eg switch incline dumbell for incline barbell). This is advice geared towards slightly more advanced people \n\n3. There’s days I wake up feeling like crap(like today) where I feel like I couldn’t move the empty bar if I tried my best, I still went though, and lo and behold I did just fine and even made progress. Entering the gym alone gives me what it takes to do my best. I never decide whether or not I should take today off when I’m at home(unless it’s a scheduled day off ofc)",
            "author": "Ashamed_Smile3497"
        },
        {
            "comment": "I like your philosophy. I would love to see your workout plan, if you're willing to share.",
            "author": "justgreene71"
        },
        {
            "comment": "I'll message you",
            "author": "Coachricky247"
        },
        {
            "comment": "same here, please!",
            "author": "Outrageous-Put6250"
        }
    ]
}